Model: "sequential_231"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1355 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_672 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1686 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1686 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1356 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_673 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1687 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1687 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_432 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1357 (Conv2D)         (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_1688 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1688 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_433 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1358 (Conv2D)         (None, 8, 8, 32)          36896     
_________________________________________________________________
activation_1689 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1689 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_1359 (Conv2D)         (None, 8, 8, 32)          9248      
_________________________________________________________________
activation_1690 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1690 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_1360 (Conv2D)         (None, 8, 8, 128)         36992     
_________________________________________________________________
activation_1691 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1691 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1361 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_674 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1692 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1692 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_231 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_562 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1693 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1693 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_563 (Dense)            (None, 10)                1290      
=================================================================
Total params: 401,306
Trainable params: 400,986
Non-trainable params: 320
_________________________________________________________________
