Model: "sequential_171"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_950 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1220 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1220 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_951 (Conv2D)          (None, 32, 32, 512)       74240     
_________________________________________________________________
batch_normalization_492 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1221 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1221 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_322 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_952 (Conv2D)          (None, 16, 16, 128)       589952    
_________________________________________________________________
activation_1222 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1222 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_323 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_953 (Conv2D)          (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_493 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_1223 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1223 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_954 (Conv2D)          (None, 8, 8, 256)         1179904   
_________________________________________________________________
activation_1224 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1224 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_955 (Conv2D)          (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_1225 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1225 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_956 (Conv2D)          (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_494 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1226 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1226 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_171 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_441 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1227 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1227 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_442 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,885,018
Trainable params: 2,882,938
Non-trainable params: 2,080
_________________________________________________________________
