Model: "sequential_38"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_206 (Conv2D)          (None, 32, 32, 32)        896       
_________________________________________________________________
batch_normalization_141 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_275 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_275 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_77 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_207 (Conv2D)          (None, 16, 16, 512)       147968    
_________________________________________________________________
batch_normalization_142 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_276 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_276 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_208 (Conv2D)          (None, 16, 16, 16)        73744     
_________________________________________________________________
activation_277 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_277 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_209 (Conv2D)          (None, 16, 16, 512)       74240     
_________________________________________________________________
batch_normalization_143 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_278 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_278 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_210 (Conv2D)          (None, 16, 16, 256)       1179904   
_________________________________________________________________
activation_279 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_279 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_211 (Conv2D)          (None, 16, 16, 128)       295040    
_________________________________________________________________
activation_280 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_280 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_212 (Conv2D)          (None, 16, 16, 16)        18448     
_________________________________________________________________
batch_normalization_144 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_281 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_281 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_38 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_107 (Dense)            (None, 128)               524416    
_________________________________________________________________
activation_282 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_282 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_108 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,320,234
Trainable params: 2,318,090
Non-trainable params: 2,144
_________________________________________________________________
