Model: "sequential_111"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_597 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_351 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_786 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_786 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_598 (Conv2D)          (None, 32, 32, 512)       1180160   
_________________________________________________________________
batch_normalization_352 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_787 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_787 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_213 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_599 (Conv2D)          (None, 16, 16, 128)       589952    
_________________________________________________________________
activation_788 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_788 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_214 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_600 (Conv2D)          (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_353 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_789 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_789 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_601 (Conv2D)          (None, 8, 8, 256)         1179904   
_________________________________________________________________
activation_790 (Activation)  (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_790 (Dropout)        (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_602 (Conv2D)          (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_791 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_791 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_603 (Conv2D)          (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_354 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_792 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_792 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_111 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_300 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_793 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_793 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_301 (Dense)            (None, 10)                1290      
=================================================================
Total params: 3,998,682
Trainable params: 3,996,090
Non-trainable params: 2,592
_________________________________________________________________
