Model: "sequential_188"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1060 (Conv2D)         (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_539 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1351 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1351 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_1061 (Conv2D)         (None, 32, 32, 1024)      2360320   
_________________________________________________________________
batch_normalization_540 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1352 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1352 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_350 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_1062 (Conv2D)         (None, 16, 16, 128)       1179776   
_________________________________________________________________
activation_1353 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1353 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_351 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1063 (Conv2D)         (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_541 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_1354 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1354 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_1064 (Conv2D)         (None, 8, 8, 256)         1179904   
_________________________________________________________________
activation_1355 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1355 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_1065 (Conv2D)         (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_1356 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1356 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1066 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_542 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1357 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1357 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_188 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_479 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1358 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1358 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_480 (Dense)            (None, 10)                1290      
=================================================================
Total params: 5,770,714
Trainable params: 5,767,098
Non-trainable params: 3,616
_________________________________________________________________
