Model: "sequential_117"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_633 (Conv2D)          (None, 32, 32, 64)        1792      
_________________________________________________________________
activation_831 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_831 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_634 (Conv2D)          (None, 32, 32, 64)        36928     
_________________________________________________________________
batch_normalization_364 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_832 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_832 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_635 (Conv2D)          (None, 32, 32, 32)        18464     
_________________________________________________________________
activation_833 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_833 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_226 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_636 (Conv2D)          (None, 16, 16, 512)       147968    
_________________________________________________________________
activation_834 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_834 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_227 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
flatten_117 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_315 (Dense)            (None, 16)                524304    
_________________________________________________________________
batch_normalization_365 (Bat (None, 16)                64        
_________________________________________________________________
activation_835 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_835 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_316 (Dense)            (None, 32)                544       
_________________________________________________________________
activation_836 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_836 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_317 (Dense)            (None, 10)                330       
=================================================================
Total params: 730,650
Trainable params: 730,490
Non-trainable params: 160
_________________________________________________________________
