Model: "sequential_365"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2240 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_1078 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2687 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2687 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_2241 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
activation_2688 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2688 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_658 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_2242 (Conv2D)         (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_2689 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_2689 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_2243 (Conv2D)         (None, 16, 16, 256)       73984     
_________________________________________________________________
activation_2690 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_2690 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_2244 (Conv2D)         (None, 16, 16, 128)       295040    
_________________________________________________________________
activation_2691 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2691 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_2245 (Conv2D)         (None, 16, 16, 16)        18448     
_________________________________________________________________
batch_normalization_1079 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_2692 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2692 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_365 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_812 (Dense)            (None, 10)                40970     
=================================================================
Total params: 484,474
Trainable params: 484,410
Non-trainable params: 64
_________________________________________________________________
