Model: "sequential_267"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1599 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_791 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1962 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1962 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1600 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_792 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1963 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1963 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_499 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1601 (Conv2D)         (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_1964 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1964 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_500 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1602 (Conv2D)         (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_793 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_1965 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1965 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_1603 (Conv2D)         (None, 8, 8, 256)         1179904   
_________________________________________________________________
activation_1966 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1966 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_1604 (Conv2D)         (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_1967 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1967 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1605 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_794 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1968 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1968 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_267 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_630 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1969 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1969 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_631 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,385,498
Trainable params: 2,384,154
Non-trainable params: 1,344
_________________________________________________________________
