Model: "sequential_249"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1478 (Conv2D)         (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_730 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1825 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1825 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_1479 (Conv2D)         (None, 32, 32, 512)       1180160   
_________________________________________________________________
batch_normalization_731 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1826 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1826 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_467 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_1480 (Conv2D)         (None, 16, 16, 128)       589952    
_________________________________________________________________
batch_normalization_732 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1827 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1827 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_468 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1481 (Conv2D)         (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_733 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_1828 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1828 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_1482 (Conv2D)         (None, 8, 8, 256)         1179904   
_________________________________________________________________
activation_1829 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1829 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_1483 (Conv2D)         (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_1830 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1830 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1484 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_734 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1831 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1831 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_249 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_596 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1832 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1832 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_597 (Dense)            (None, 10)                1290      
=================================================================
Total params: 3,999,194
Trainable params: 3,996,346
Non-trainable params: 2,848
_________________________________________________________________
