Model: "sequential_262"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1566 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_775 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1925 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1925 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1567 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_776 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1926 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1926 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_491 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1568 (Conv2D)         (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_1927 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1927 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_492 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1569 (Conv2D)         (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_777 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_1928 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1928 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_1570 (Conv2D)         (None, 8, 8, 256)         1179904   
_________________________________________________________________
activation_1929 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1929 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_1571 (Conv2D)         (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_1930 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1930 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1572 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_778 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1931 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1931 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_262 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_621 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1932 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1932 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_622 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,385,498
Trainable params: 2,384,154
Non-trainable params: 1,344
_________________________________________________________________
