Model: "sequential_60"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_323 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_212 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_430 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_430 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_119 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_324 (Conv2D)          (None, 16, 16, 1024)      2360320   
_________________________________________________________________
batch_normalization_213 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_431 (Activation)  (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_431 (Dropout)        (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_325 (Conv2D)          (None, 16, 16, 16)        147472    
_________________________________________________________________
activation_432 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_432 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_326 (Conv2D)          (None, 16, 16, 512)       74240     
_________________________________________________________________
batch_normalization_214 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_433 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_433 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_327 (Conv2D)          (None, 16, 16, 1024)      4719616   
_________________________________________________________________
activation_434 (Activation)  (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_434 (Dropout)        (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_60 (Flatten)         (None, 262144)            0         
_________________________________________________________________
dense_167 (Dense)            (None, 64)                16777280  
_________________________________________________________________
batch_normalization_215 (Bat (None, 64)                256       
_________________________________________________________________
activation_435 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_435 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_168 (Dense)            (None, 512)               33280     
_________________________________________________________________
activation_436 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_436 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_169 (Dense)            (None, 10)                5130      
=================================================================
Total params: 24,131,930
Trainable params: 24,128,218
Non-trainable params: 3,712
_________________________________________________________________
