Model: "sequential_385"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2367 (Conv2D)         (None, 32, 32, 256)       7168      
_________________________________________________________________
activation_2825 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2825 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_2368 (Conv2D)         (None, 32, 32, 128)       295040    
_________________________________________________________________
batch_normalization_1125 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2826 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2826 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_687 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_2369 (Conv2D)         (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_2827 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2827 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_688 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_2370 (Conv2D)         (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_1126 (Ba (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_2828 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_2828 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_2371 (Conv2D)         (None, 8, 8, 256)         1179904   
_________________________________________________________________
activation_2829 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_2829 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_2372 (Conv2D)         (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_2830 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_2830 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_2373 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_1127 (Ba (None, 8, 8, 16)          64        
_________________________________________________________________
activation_2831 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_2831 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_385 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_843 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_2832 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_2832 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_844 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,668,634
Trainable params: 2,667,322
Non-trainable params: 1,312
_________________________________________________________________
