Model: "sequential_54"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_292 (Conv2D)          (None, 32, 32, 8)         224       
_________________________________________________________________
batch_normalization_188 (Bat (None, 32, 32, 8)         32        
_________________________________________________________________
activation_384 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_384 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
conv2d_293 (Conv2D)          (None, 32, 32, 512)       37376     
_________________________________________________________________
batch_normalization_189 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_385 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_385 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_110 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_294 (Conv2D)          (None, 16, 16, 64)        294976    
_________________________________________________________________
activation_386 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_386 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_295 (Conv2D)          (None, 16, 16, 256)       147712    
_________________________________________________________________
batch_normalization_190 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_387 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_387 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_111 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_54 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_146 (Dense)            (None, 128)               2097280   
_________________________________________________________________
batch_normalization_191 (Bat (None, 128)               512       
_________________________________________________________________
activation_388 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_388 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_147 (Dense)            (None, 32)                4128      
_________________________________________________________________
activation_389 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_389 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_148 (Dense)            (None, 128)               4224      
_________________________________________________________________
batch_normalization_192 (Bat (None, 128)               512       
_________________________________________________________________
activation_390 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_390 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_149 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,591,338
Trainable params: 2,589,274
Non-trainable params: 2,064
_________________________________________________________________
