Model: "sequential_147"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_802 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_427 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1043 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1043 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_282 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_803 (Conv2D)          (None, 16, 16, 128)       295040    
_________________________________________________________________
activation_1044 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1044 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_283 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_804 (Conv2D)          (None, 8, 8, 32)          36896     
_________________________________________________________________
activation_1045 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1045 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_805 (Conv2D)          (None, 8, 8, 32)          9248      
_________________________________________________________________
activation_1046 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1046 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_806 (Conv2D)          (None, 8, 8, 128)         36992     
_________________________________________________________________
activation_1047 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1047 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_807 (Conv2D)          (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_428 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1048 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1048 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_147 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_388 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1049 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1049 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_389 (Dense)            (None, 10)                1290      
=================================================================
Total params: 537,370
Trainable params: 536,826
Non-trainable params: 544
_________________________________________________________________
