Model: "sequential_211"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1219 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_612 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1532 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1532 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1220 (Conv2D)         (None, 32, 32, 512)       74240     
_________________________________________________________________
batch_normalization_613 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1533 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1533 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_392 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_1221 (Conv2D)         (None, 16, 16, 128)       589952    
_________________________________________________________________
activation_1534 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1534 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_393 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1222 (Conv2D)         (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_614 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_1535 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1535 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_1223 (Conv2D)         (None, 8, 8, 256)         1179904   
_________________________________________________________________
activation_1536 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1536 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_1224 (Conv2D)         (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_1537 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1537 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1225 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_615 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1538 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1538 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_211 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_524 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1539 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1539 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_525 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,885,082
Trainable params: 2,882,970
Non-trainable params: 2,112
_________________________________________________________________
