Model: "sequential_252"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1498 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1848 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1848 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1499 (Conv2D)         (None, 32, 32, 512)       74240     
_________________________________________________________________
batch_normalization_743 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1849 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1849 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_471 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_1500 (Conv2D)         (None, 16, 16, 128)       589952    
_________________________________________________________________
activation_1850 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1850 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_472 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1501 (Conv2D)         (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_744 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_1851 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1851 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_1502 (Conv2D)         (None, 8, 8, 1024)        4719616   
_________________________________________________________________
activation_1852 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1852 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
max_pooling2d_473 (MaxPoolin (None, 4, 4, 1024)        0         
_________________________________________________________________
conv2d_1503 (Conv2D)         (None, 4, 4, 128)         1179776   
_________________________________________________________________
activation_1853 (Activation) (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_1853 (Dropout)       (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_1504 (Conv2D)         (None, 4, 4, 16)          18448     
_________________________________________________________________
batch_normalization_745 (Bat (None, 4, 4, 16)          64        
_________________________________________________________________
activation_1854 (Activation) (None, 4, 4, 16)          0         
_________________________________________________________________
dropout_1854 (Dropout)       (None, 4, 4, 16)          0         
_________________________________________________________________
flatten_252 (Flatten)        (None, 256)               0         
_________________________________________________________________
dense_602 (Dense)            (None, 128)               32896     
_________________________________________________________________
activation_1855 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1855 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_603 (Dense)            (None, 10)                1290      
=================================================================
Total params: 7,211,162
Trainable params: 7,209,082
Non-trainable params: 2,080
_________________________________________________________________
