Model: "sequential_53"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_288 (Conv2D)          (None, 32, 32, 64)        1792      
_________________________________________________________________
batch_normalization_186 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_378 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_378 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_107 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_289 (Conv2D)          (None, 16, 16, 16)        9232      
_________________________________________________________________
activation_379 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_379 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
max_pooling2d_108 (MaxPoolin (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_290 (Conv2D)          (None, 8, 8, 128)         18560     
_________________________________________________________________
batch_normalization_187 (Bat (None, 8, 8, 128)         512       
_________________________________________________________________
activation_380 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_380 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
max_pooling2d_109 (MaxPoolin (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_291 (Conv2D)          (None, 4, 4, 512)         590336    
_________________________________________________________________
activation_381 (Activation)  (None, 4, 4, 512)         0         
_________________________________________________________________
dropout_381 (Dropout)        (None, 4, 4, 512)         0         
_________________________________________________________________
flatten_53 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_143 (Dense)            (None, 16)                131088    
_________________________________________________________________
activation_382 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_382 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_144 (Dense)            (None, 32)                544       
_________________________________________________________________
activation_383 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_383 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_145 (Dense)            (None, 10)                330       
=================================================================
Total params: 752,650
Trainable params: 752,266
Non-trainable params: 384
_________________________________________________________________
