Model: "sequential_301"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1830 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_906 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2223 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2223 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1831 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
activation_2224 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2224 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_563 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1832 (Conv2D)         (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_2225 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_2225 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_1833 (Conv2D)         (None, 16, 16, 256)       73984     
_________________________________________________________________
activation_2226 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_2226 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_1834 (Conv2D)         (None, 16, 16, 128)       295040    
_________________________________________________________________
activation_2227 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2227 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1835 (Conv2D)         (None, 16, 16, 16)        18448     
_________________________________________________________________
batch_normalization_907 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_2228 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2228 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_301 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_694 (Dense)            (None, 128)               524416    
_________________________________________________________________
activation_2229 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_2229 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_695 (Dense)            (None, 10)                1290      
=================================================================
Total params: 969,210
Trainable params: 969,146
Non-trainable params: 64
_________________________________________________________________
