Model: "sequential_307"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1870 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_2269 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2269 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1871 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_925 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2270 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2270 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_1872 (Conv2D)         (None, 32, 32, 128)       147584    
_________________________________________________________________
activation_2271 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2271 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_575 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1873 (Conv2D)         (None, 16, 16, 512)       590336    
_________________________________________________________________
batch_normalization_926 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_2272 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_2272 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_1874 (Conv2D)         (None, 16, 16, 256)       1179904   
_________________________________________________________________
activation_2273 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_2273 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_1875 (Conv2D)         (None, 16, 16, 128)       295040    
_________________________________________________________________
activation_2274 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2274 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1876 (Conv2D)         (None, 16, 16, 16)        18448     
_________________________________________________________________
batch_normalization_927 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_2275 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2275 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_307 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_706 (Dense)            (None, 128)               524416    
_________________________________________________________________
activation_2276 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_2276 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_707 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,778,650
Trainable params: 2,777,338
Non-trainable params: 1,312
_________________________________________________________________
