Model: "sequential_341"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2089 (Conv2D)         (None, 32, 32, 256)       7168      
_________________________________________________________________
activation_2517 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2517 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_2090 (Conv2D)         (None, 32, 32, 128)       295040    
_________________________________________________________________
batch_normalization_1024 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2518 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2518 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_623 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_2091 (Conv2D)         (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_2519 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2519 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_624 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_2092 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
activation_2520 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_2520 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_2093 (Conv2D)         (None, 8, 8, 256)         37120     
_________________________________________________________________
activation_2521 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_2521 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_2094 (Conv2D)         (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_2522 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_2522 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_2095 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_1025 (Ba (None, 8, 8, 16)          64        
_________________________________________________________________
activation_2523 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_2523 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_341 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_769 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_2524 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_2524 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_770 (Dense)            (None, 10)                1290      
=================================================================
Total params: 951,914
Trainable params: 951,626
Non-trainable params: 288
_________________________________________________________________
