Model: "sequential_399"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2445 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_1159 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2915 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2915 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_2446 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
activation_2916 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2916 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_704 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_2447 (Conv2D)         (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_2917 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_2917 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_2448 (Conv2D)         (None, 16, 16, 16)        4624      
_________________________________________________________________
activation_2918 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2918 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_2449 (Conv2D)         (None, 16, 16, 128)       18560     
_________________________________________________________________
activation_2919 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2919 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_2450 (Conv2D)         (None, 16, 16, 16)        18448     
_________________________________________________________________
batch_normalization_1160 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_2920 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2920 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_399 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_869 (Dense)            (None, 128)               524416    
_________________________________________________________________
activation_2921 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_2921 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_870 (Dense)            (None, 10)                1290      
=================================================================
Total params: 623,370
Trainable params: 623,306
Non-trainable params: 64
_________________________________________________________________
