Model: "sequential_62"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_333 (Conv2D)          (None, 32, 32, 64)        1792      
_________________________________________________________________
activation_443 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_443 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_334 (Conv2D)          (None, 32, 32, 32)        18464     
_________________________________________________________________
activation_444 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_444 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_335 (Conv2D)          (None, 32, 32, 32)        9248      
_________________________________________________________________
activation_445 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_445 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_336 (Conv2D)          (None, 32, 32, 128)       36992     
_________________________________________________________________
activation_446 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_446 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_337 (Conv2D)          (None, 32, 32, 16)        18448     
_________________________________________________________________
batch_normalization_219 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_447 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_447 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
flatten_62 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_172 (Dense)            (None, 128)               2097280   
_________________________________________________________________
activation_448 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_448 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_173 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,183,578
Trainable params: 2,183,546
Non-trainable params: 32
_________________________________________________________________
