Model: "sequential_153"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_837 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_441 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1087 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1087 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_838 (Conv2D)          (None, 32, 32, 512)       1180160   
_________________________________________________________________
batch_normalization_442 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1088 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1088 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_297 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_839 (Conv2D)          (None, 16, 16, 128)       589952    
_________________________________________________________________
activation_1089 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1089 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_298 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_840 (Conv2D)          (None, 8, 8, 512)         590336    
_________________________________________________________________
batch_normalization_443 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_1090 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1090 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_841 (Conv2D)          (None, 8, 8, 256)         1179904   
_________________________________________________________________
activation_1091 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1091 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_842 (Conv2D)          (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_1092 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1092 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_843 (Conv2D)          (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_444 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1093 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1093 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_153 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_403 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1094 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1094 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_404 (Dense)            (None, 10)                1290      
=================================================================
Total params: 3,998,682
Trainable params: 3,996,090
Non-trainable params: 2,592
_________________________________________________________________
