Model: "sequential_192"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1088 (Conv2D)         (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_552 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1382 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1382 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_1089 (Conv2D)         (None, 32, 32, 128)       295040    
_________________________________________________________________
batch_normalization_553 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1383 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1383 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_357 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1090 (Conv2D)         (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_1384 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1384 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_358 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1091 (Conv2D)         (None, 8, 8, 32)          36896     
_________________________________________________________________
activation_1385 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1385 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_1092 (Conv2D)         (None, 8, 8, 32)          9248      
_________________________________________________________________
activation_1386 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1386 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_1093 (Conv2D)         (None, 8, 8, 128)         36992     
_________________________________________________________________
activation_1387 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1387 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1094 (Conv2D)         (None, 8, 8, 16)          18448     
_________________________________________________________________
batch_normalization_554 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1388 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1388 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_192 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_486 (Dense)            (None, 128)               131200    
_________________________________________________________________
activation_1389 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1389 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_487 (Dense)            (None, 10)                1290      
=================================================================
Total params: 685,466
Trainable params: 684,666
Non-trainable params: 800
_________________________________________________________________
