Model: "sequential_80"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_429 (Conv2D)          (None, 32, 32, 64)        1792      
_________________________________________________________________
activation_570 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_570 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_430 (Conv2D)          (None, 32, 32, 32)        18464     
_________________________________________________________________
activation_571 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_571 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_431 (Conv2D)          (None, 32, 32, 32)        9248      
_________________________________________________________________
activation_572 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_572 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_159 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_432 (Conv2D)          (None, 16, 16, 512)       147968    
_________________________________________________________________
activation_573 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_573 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_160 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
flatten_80 (Flatten)         (None, 32768)             0         
_________________________________________________________________
dense_221 (Dense)            (None, 16)                524304    
_________________________________________________________________
activation_574 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_574 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_222 (Dense)            (None, 32)                544       
_________________________________________________________________
activation_575 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_575 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_223 (Dense)            (None, 10)                330       
=================================================================
Total params: 702,650
Trainable params: 702,650
Non-trainable params: 0
_________________________________________________________________
