Model: "sequential_97"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_456 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
batch_normalization_385 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_585 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_585 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_457 (Conv2D)          (None, 32, 32, 8)         73736     
_________________________________________________________________
batch_normalization_386 (Bat (None, 32, 32, 8)         32        
_________________________________________________________________
activation_586 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_586 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
max_pooling2d_168 (MaxPoolin (None, 16, 16, 8)         0         
_________________________________________________________________
conv2d_458 (Conv2D)          (None, 16, 16, 256)       18688     
_________________________________________________________________
batch_normalization_387 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_587 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_587 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_459 (Conv2D)          (None, 16, 16, 16)        36880     
_________________________________________________________________
batch_normalization_388 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_588 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_588 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_460 (Conv2D)          (None, 16, 16, 512)       74240     
_________________________________________________________________
activation_589 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_589 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_461 (Conv2D)          (None, 16, 16, 16)        73744     
_________________________________________________________________
activation_590 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_590 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_97 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_226 (Dense)            (None, 16)                65552     
_________________________________________________________________
activation_591 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_591 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_227 (Dense)            (None, 10)                170       
=================================================================
Total params: 376,898
Trainable params: 374,290
Non-trainable params: 2,608
_________________________________________________________________
