Model: "sequential_50"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_249 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_198 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_314 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_314 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_95 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_250 (Conv2D)          (None, 16, 16, 128)       18560     
_________________________________________________________________
batch_normalization_199 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_315 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_315 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_251 (Conv2D)          (None, 16, 16, 64)        73792     
_________________________________________________________________
batch_normalization_200 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_316 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_316 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
flatten_50 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_115 (Dense)            (None, 128)               2097280   
_________________________________________________________________
activation_317 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_317 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_116 (Dense)            (None, 512)               66048     
_________________________________________________________________
batch_normalization_201 (Bat (None, 512)               2048      
_________________________________________________________________
activation_318 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_318 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_117 (Dense)            (None, 10)                5130      
=================================================================
Total params: 2,264,138
Trainable params: 2,262,698
Non-trainable params: 1,440
_________________________________________________________________
