Model: "sequential_129"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_618 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_544 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_799 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_799 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_619 (Conv2D)          (None, 32, 32, 128)       295040    
_________________________________________________________________
batch_normalization_545 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_800 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_800 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_620 (Conv2D)          (None, 32, 32, 16)        18448     
_________________________________________________________________
batch_normalization_546 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_801 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_801 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_621 (Conv2D)          (None, 32, 32, 512)       74240     
_________________________________________________________________
batch_normalization_547 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_802 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_802 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_218 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
flatten_129 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_310 (Dense)            (None, 512)               67109376  
_________________________________________________________________
activation_803 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_803 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_311 (Dense)            (None, 64)                32832     
_________________________________________________________________
batch_normalization_548 (Bat (None, 64)                256       
_________________________________________________________________
activation_804 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_804 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_312 (Dense)            (None, 10)                650       
=================================================================
Total params: 67,541,658
Trainable params: 67,539,706
Non-trainable params: 1,952
_________________________________________________________________
