Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_125 (Conv2D)          (None, 32, 32, 512)       14336     
_________________________________________________________________
activation_156 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_156 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_126 (Conv2D)          (None, 32, 32, 128)       589952    
_________________________________________________________________
batch_normalization_91 (Batc (None, 32, 32, 128)       512       
_________________________________________________________________
activation_157 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_157 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_127 (Conv2D)          (None, 32, 32, 1024)      1180672   
_________________________________________________________________
batch_normalization_92 (Batc (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_158 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_158 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_128 (Conv2D)          (None, 32, 32, 8)         73736     
_________________________________________________________________
activation_159 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_159 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
flatten_23 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_54 (Dense)             (None, 64)                524352    
_________________________________________________________________
batch_normalization_93 (Batc (None, 64)                256       
_________________________________________________________________
activation_160 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_160 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_55 (Dense)             (None, 10)                650       
=================================================================
Total params: 2,388,562
Trainable params: 2,386,130
Non-trainable params: 2,432
_________________________________________________________________
