Model: "sequential_48"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_242 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_191 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_304 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_304 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_243 (Conv2D)          (None, 32, 32, 8)         18440     
_________________________________________________________________
activation_305 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_305 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
max_pooling2d_92 (MaxPooling (None, 16, 16, 8)         0         
_________________________________________________________________
conv2d_244 (Conv2D)          (None, 16, 16, 1024)      74752     
_________________________________________________________________
batch_normalization_192 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_306 (Activation)  (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_306 (Dropout)        (None, 16, 16, 1024)      0         
_________________________________________________________________
max_pooling2d_93 (MaxPooling (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_245 (Conv2D)          (None, 8, 8, 8)           73736     
_________________________________________________________________
activation_307 (Activation)  (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_307 (Dropout)        (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_48 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_110 (Dense)            (None, 64)                32832     
_________________________________________________________________
batch_normalization_193 (Bat (None, 64)                256       
_________________________________________________________________
activation_308 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_308 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_111 (Dense)            (None, 32)                2080      
_________________________________________________________________
batch_normalization_194 (Bat (None, 32)                128       
_________________________________________________________________
activation_309 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_309 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_112 (Dense)            (None, 10)                330       
=================================================================
Total params: 214,842
Trainable params: 212,090
Non-trainable params: 2,752
_________________________________________________________________
