Model: "sequential_123"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_586 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
activation_755 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_755 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_587 (Conv2D)          (None, 32, 32, 256)       590080    
_________________________________________________________________
batch_normalization_510 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_756 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_756 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_588 (Conv2D)          (None, 32, 32, 16)        36880     
_________________________________________________________________
batch_normalization_511 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_757 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_757 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_589 (Conv2D)          (None, 32, 32, 512)       74240     
_________________________________________________________________
batch_normalization_512 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_758 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_758 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_590 (Conv2D)          (None, 32, 32, 64)        294976    
_________________________________________________________________
activation_759 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_759 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_591 (Conv2D)          (None, 32, 32, 512)       295424    
_________________________________________________________________
batch_normalization_513 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_760 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_760 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_208 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
flatten_123 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_292 (Dense)            (None, 128)               16777344  
_________________________________________________________________
batch_normalization_514 (Bat (None, 128)               512       
_________________________________________________________________
activation_761 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_761 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_293 (Dense)            (None, 256)               33024     
_________________________________________________________________
activation_762 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_762 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_294 (Dense)            (None, 10)                2570      
=================================================================
Total params: 18,117,402
Trainable params: 18,114,554
Non-trainable params: 2,848
_________________________________________________________________
