Model: "sequential_21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_116 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization_86 (Batc (None, 32, 32, 16)        64        
_________________________________________________________________
activation_146 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_146 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_117 (Conv2D)          (None, 16, 16, 256)       37120     
_________________________________________________________________
batch_normalization_87 (Batc (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_147 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_147 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_118 (Conv2D)          (None, 8, 8, 128)         295040    
_________________________________________________________________
activation_148 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_148 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 8, 8, 64)          73792     
_________________________________________________________________
activation_149 (Activation)  (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_149 (Dropout)        (None, 8, 8, 64)          0         
_________________________________________________________________
flatten_21 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_51 (Dense)             (None, 10)                40970     
=================================================================
Total params: 448,458
Trainable params: 447,914
Non-trainable params: 544
_________________________________________________________________
