Model: "sequential_205"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_983 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_957 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1293 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1293 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_984 (Conv2D)          (None, 32, 32, 128)       295040    
_________________________________________________________________
batch_normalization_958 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1294 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1294 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_985 (Conv2D)          (None, 32, 32, 16)        18448     
_________________________________________________________________
batch_normalization_959 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1295 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1295 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_986 (Conv2D)          (None, 32, 32, 512)       74240     
_________________________________________________________________
batch_normalization_960 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1296 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1296 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_987 (Conv2D)          (None, 32, 32, 64)        294976    
_________________________________________________________________
activation_1297 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1297 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_988 (Conv2D)          (None, 32, 32, 512)       295424    
_________________________________________________________________
batch_normalization_961 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1298 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1298 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
flatten_205 (Flatten)        (None, 524288)            0         
_________________________________________________________________
dense_515 (Dense)            (None, 16)                8388624   
_________________________________________________________________
batch_normalization_962 (Bat (None, 16)                64        
_________________________________________________________________
activation_1299 (Activation) (None, 16)                0         
_________________________________________________________________
dropout_1299 (Dropout)       (None, 16)                0         
_________________________________________________________________
dense_516 (Dense)            (None, 32)                544       
_________________________________________________________________
batch_normalization_963 (Bat (None, 32)                128       
_________________________________________________________________
activation_1300 (Activation) (None, 32)                0         
_________________________________________________________________
dropout_1300 (Dropout)       (None, 32)                0         
_________________________________________________________________
dense_517 (Dense)            (None, 10)                330       
=================================================================
Total params: 9,380,682
Trainable params: 9,377,738
Non-trainable params: 2,944
_________________________________________________________________
