Model: "sequential_117"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_554 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
batch_normalization_480 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_715 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_715 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_555 (Conv2D)          (None, 32, 32, 8)         73736     
_________________________________________________________________
batch_normalization_481 (Bat (None, 32, 32, 8)         32        
_________________________________________________________________
activation_716 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_716 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
max_pooling2d_199 (MaxPoolin (None, 16, 16, 8)         0         
_________________________________________________________________
conv2d_556 (Conv2D)          (None, 16, 16, 256)       18688     
_________________________________________________________________
batch_normalization_482 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_717 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_717 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_557 (Conv2D)          (None, 16, 16, 16)        36880     
_________________________________________________________________
batch_normalization_483 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_718 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_718 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_558 (Conv2D)          (None, 16, 16, 512)       74240     
_________________________________________________________________
batch_normalization_484 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_719 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_719 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_559 (Conv2D)          (None, 16, 16, 16)        73744     
_________________________________________________________________
activation_720 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_720 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_117 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_278 (Dense)            (None, 16)                65552     
_________________________________________________________________
activation_721 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_721 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_279 (Dense)            (None, 10)                170       
=================================================================
Total params: 378,946
Trainable params: 375,314
Non-trainable params: 3,632
_________________________________________________________________
