Model: "sequential_147"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_702 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_636 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_914 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_914 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_703 (Conv2D)          (None, 32, 32, 128)       295040    
_________________________________________________________________
batch_normalization_637 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_915 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_915 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_704 (Conv2D)          (None, 32, 32, 16)        18448     
_________________________________________________________________
batch_normalization_638 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_916 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_916 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_705 (Conv2D)          (None, 32, 32, 512)       74240     
_________________________________________________________________
batch_normalization_639 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_917 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_917 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_246 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
flatten_147 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_359 (Dense)            (None, 64)                8388672   
_________________________________________________________________
batch_normalization_640 (Bat (None, 64)                256       
_________________________________________________________________
activation_918 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_918 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_360 (Dense)            (None, 10)                650       
=================================================================
Total params: 8,788,122
Trainable params: 8,786,170
Non-trainable params: 1,952
_________________________________________________________________
