Model: "sequential_135"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_645 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_571 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_835 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_835 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_646 (Conv2D)          (None, 32, 32, 256)       590080    
_________________________________________________________________
batch_normalization_572 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_836 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_836 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_647 (Conv2D)          (None, 32, 32, 16)        36880     
_________________________________________________________________
batch_normalization_573 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_837 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_837 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_648 (Conv2D)          (None, 32, 32, 512)       74240     
_________________________________________________________________
batch_normalization_574 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_838 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_838 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_649 (Conv2D)          (None, 32, 32, 64)        294976    
_________________________________________________________________
activation_839 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_839 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_227 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_650 (Conv2D)          (None, 16, 16, 512)       295424    
_________________________________________________________________
batch_normalization_575 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_840 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_840 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_228 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
flatten_135 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_325 (Dense)            (None, 128)               4194432   
_________________________________________________________________
batch_normalization_576 (Bat (None, 128)               512       
_________________________________________________________________
activation_841 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_841 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_326 (Dense)            (None, 256)               33024     
_________________________________________________________________
activation_842 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_842 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_327 (Dense)            (None, 10)                2570      
=================================================================
Total params: 5,535,514
Trainable params: 5,532,154
Non-trainable params: 3,360
_________________________________________________________________
