Model: "sequential_65"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_313 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_254 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_397 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_397 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_314 (Conv2D)          (None, 32, 32, 8)         18440     
_________________________________________________________________
batch_normalization_255 (Bat (None, 32, 32, 8)         32        
_________________________________________________________________
activation_398 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_398 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
conv2d_315 (Conv2D)          (None, 32, 32, 64)        4672      
_________________________________________________________________
activation_399 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_399 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_116 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_316 (Conv2D)          (None, 16, 16, 16)        9232      
_________________________________________________________________
activation_400 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_400 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
max_pooling2d_117 (MaxPoolin (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_317 (Conv2D)          (None, 8, 8, 32)          4640      
_________________________________________________________________
batch_normalization_256 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_401 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_401 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
max_pooling2d_118 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_65 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_149 (Dense)            (None, 512)               262656    
_________________________________________________________________
activation_402 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_402 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_150 (Dense)            (None, 64)                32832     
_________________________________________________________________
activation_403 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_403 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_151 (Dense)            (None, 10)                650       
=================================================================
Total params: 341,474
Trainable params: 340,882
Non-trainable params: 592
_________________________________________________________________
