Model: "sequential_82"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_385 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
batch_normalization_314 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_490 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_490 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_386 (Conv2D)          (None, 32, 32, 8)         18440     
_________________________________________________________________
batch_normalization_315 (Bat (None, 32, 32, 8)         32        
_________________________________________________________________
activation_491 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_491 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
conv2d_387 (Conv2D)          (None, 32, 32, 64)        4672      
_________________________________________________________________
activation_492 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_492 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_146 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_388 (Conv2D)          (None, 16, 16, 64)        36928     
_________________________________________________________________
batch_normalization_316 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_493 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_493 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
flatten_82 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_187 (Dense)            (None, 128)               2097280   
_________________________________________________________________
activation_494 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_494 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_188 (Dense)            (None, 512)               66048     
_________________________________________________________________
batch_normalization_317 (Bat (None, 512)               2048      
_________________________________________________________________
activation_495 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_495 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_189 (Dense)            (None, 10)                5130      
=================================================================
Total params: 2,239,026
Trainable params: 2,237,346
Non-trainable params: 1,680
_________________________________________________________________
