Model: "sequential_161"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1123 (Conv2D)         (None, 32, 32, 1024)      28672     
_________________________________________________________________
activation_1437 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1437 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_1124 (Conv2D)         (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_1438 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1438 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_353 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_1125 (Conv2D)         (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_686 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1439 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1439 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_354 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_1126 (Conv2D)         (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_1440 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1440 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1127 (Conv2D)         (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_687 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1441 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1441 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_1128 (Conv2D)         (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_1442 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1442 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_1129 (Conv2D)         (None, 8, 8, 1024)        9438208   
_________________________________________________________________
batch_normalization_688 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1443 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1443 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_161 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_475 (Dense)            (None, 64)                4194368   
_________________________________________________________________
batch_normalization_689 (Bat (None, 64)                256       
_________________________________________________________________
activation_1444 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_1444 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_476 (Dense)            (None, 256)               16640     
_________________________________________________________________
batch_normalization_690 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1445 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1445 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_477 (Dense)            (None, 10)                2570      
=================================================================
Total params: 24,121,002
Trainable params: 24,118,122
Non-trainable params: 2,880
_________________________________________________________________
