Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_105 (Conv2D)          (None, 32, 32, 512)       14336     
_________________________________________________________________
batch_normalization_69 (Batc (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_144 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_144 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_106 (Conv2D)          (None, 32, 32, 256)       1179904   
_________________________________________________________________
batch_normalization_70 (Batc (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_145 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_145 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_107 (Conv2D)          (None, 32, 32, 128)       295040    
_________________________________________________________________
activation_146 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_146 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_108 (Conv2D)          (None, 32, 32, 256)       295168    
_________________________________________________________________
batch_normalization_71 (Batc (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_147 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_147 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_109 (Conv2D)          (None, 32, 32, 512)       1180160   
_________________________________________________________________
activation_148 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_148 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_110 (Conv2D)          (None, 32, 32, 32)        147488    
_________________________________________________________________
activation_149 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_149 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_53 (Dense)             (None, 256)               2097408   
_________________________________________________________________
batch_normalization_72 (Batc (None, 256)               1024      
_________________________________________________________________
activation_150 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_150 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_54 (Dense)             (None, 16)                4112      
_________________________________________________________________
batch_normalization_73 (Batc (None, 16)                64        
_________________________________________________________________
activation_151 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_151 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_55 (Dense)             (None, 10)                170       
=================================================================
Total params: 5,218,970
Trainable params: 5,216,378
Non-trainable params: 2,592
_________________________________________________________________
