Model: "sequential_37"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_258 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
activation_352 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_352 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_259 (Conv2D)          (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_353 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_353 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_81 (MaxPooling (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_260 (Conv2D)          (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_161 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_354 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_354 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_82 (MaxPooling (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_261 (Conv2D)          (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_355 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_355 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_262 (Conv2D)          (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_162 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_356 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_356 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_263 (Conv2D)          (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_357 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_357 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_264 (Conv2D)          (None, 8, 8, 1024)        9438208   
_________________________________________________________________
batch_normalization_163 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_358 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_358 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_37 (Flatten)         (None, 65536)             0         
_________________________________________________________________
dense_131 (Dense)            (None, 16)                1048592   
_________________________________________________________________
batch_normalization_164 (Bat (None, 16)                64        
_________________________________________________________________
activation_359 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_359 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_132 (Dense)            (None, 256)               4352      
_________________________________________________________________
activation_360 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_360 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_133 (Dense)            (None, 16)                4112      
_________________________________________________________________
activation_361 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_361 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_134 (Dense)            (None, 10)                170       
=================================================================
Total params: 20,963,434
Trainable params: 20,961,162
Non-trainable params: 2,272
_________________________________________________________________
