Model: "sequential_168"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1173 (Conv2D)         (None, 32, 32, 1024)      28672     
_________________________________________________________________
batch_normalization_718 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1501 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1501 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_1174 (Conv2D)         (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_1502 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1502 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_369 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_1175 (Conv2D)         (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_719 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1503 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1503 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_370 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_1176 (Conv2D)         (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_1504 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1504 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1177 (Conv2D)         (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_720 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1505 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1505 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_1178 (Conv2D)         (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_1506 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1506 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_1179 (Conv2D)         (None, 8, 8, 1024)        9438208   
_________________________________________________________________
batch_normalization_721 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1507 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1507 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_168 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_496 (Dense)            (None, 64)                4194368   
_________________________________________________________________
batch_normalization_722 (Bat (None, 64)                256       
_________________________________________________________________
activation_1508 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_1508 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_497 (Dense)            (None, 256)               16640     
_________________________________________________________________
batch_normalization_723 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1509 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1509 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_498 (Dense)            (None, 10)                2570      
=================================================================
Total params: 24,125,098
Trainable params: 24,120,170
Non-trainable params: 4,928
_________________________________________________________________
