Model: "sequential_52"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_362 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
activation_486 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_486 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_363 (Conv2D)          (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_487 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_487 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_111 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_364 (Conv2D)          (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_220 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_488 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_488 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_112 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_365 (Conv2D)          (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_489 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_489 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_366 (Conv2D)          (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_221 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_490 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_490 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_367 (Conv2D)          (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_491 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_491 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_368 (Conv2D)          (None, 8, 8, 1024)        9438208   
_________________________________________________________________
batch_normalization_222 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_492 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_492 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_52 (Flatten)         (None, 65536)             0         
_________________________________________________________________
dense_176 (Dense)            (None, 64)                4194368   
_________________________________________________________________
batch_normalization_223 (Bat (None, 64)                256       
_________________________________________________________________
activation_493 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_493 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_177 (Dense)            (None, 10)                650       
=================================================================
Total params: 24,101,418
Trainable params: 24,099,050
Non-trainable params: 2,368
_________________________________________________________________
