Model: "sequential_140"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_976 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
batch_normalization_596 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1248 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1248 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_977 (Conv2D)          (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_1249 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1249 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_302 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_978 (Conv2D)          (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_597 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1250 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1250 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_303 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_979 (Conv2D)          (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_1251 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1251 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_980 (Conv2D)          (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_598 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1252 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1252 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_981 (Conv2D)          (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_1253 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1253 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_982 (Conv2D)          (None, 8, 8, 1024)        9438208   
_________________________________________________________________
batch_normalization_599 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1254 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1254 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_140 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_412 (Dense)            (None, 64)                4194368   
_________________________________________________________________
batch_normalization_600 (Bat (None, 64)                256       
_________________________________________________________________
activation_1255 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_1255 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_413 (Dense)            (None, 256)               16640     
_________________________________________________________________
activation_1256 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1256 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_414 (Dense)            (None, 10)                2570      
=================================================================
Total params: 24,124,074
Trainable params: 24,119,658
Non-trainable params: 4,416
_________________________________________________________________
