Model: "sequential_115"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_801 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
batch_normalization_484 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1028 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1028 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_802 (Conv2D)          (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_1029 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1029 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_242 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_803 (Conv2D)          (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_485 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1030 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1030 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_243 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_804 (Conv2D)          (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_1031 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1031 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_805 (Conv2D)          (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_486 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1032 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1032 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_806 (Conv2D)          (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_1033 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1033 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
max_pooling2d_244 (MaxPoolin (None, 4, 4, 1024)        0         
_________________________________________________________________
conv2d_807 (Conv2D)          (None, 4, 4, 1024)        9438208   
_________________________________________________________________
batch_normalization_487 (Bat (None, 4, 4, 1024)        4096      
_________________________________________________________________
activation_1034 (Activation) (None, 4, 4, 1024)        0         
_________________________________________________________________
dropout_1034 (Dropout)       (None, 4, 4, 1024)        0         
_________________________________________________________________
flatten_115 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_342 (Dense)            (None, 64)                1048640   
_________________________________________________________________
batch_normalization_488 (Bat (None, 64)                256       
_________________________________________________________________
activation_1035 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_1035 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_343 (Dense)            (None, 256)               16640     
_________________________________________________________________
activation_1036 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1036 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_344 (Dense)            (None, 10)                2570      
=================================================================
Total params: 20,978,346
Trainable params: 20,973,930
Non-trainable params: 4,416
_________________________________________________________________
