Model: "sequential_147"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1025 (Conv2D)         (None, 32, 32, 1024)      28672     
_________________________________________________________________
activation_1311 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1311 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_1026 (Conv2D)         (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_1312 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1312 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_319 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_1027 (Conv2D)         (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_624 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1313 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1313 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_320 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_1028 (Conv2D)         (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_1314 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1314 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1029 (Conv2D)         (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_625 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1315 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1315 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_1030 (Conv2D)         (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_1316 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1316 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
max_pooling2d_321 (MaxPoolin (None, 4, 4, 1024)        0         
_________________________________________________________________
conv2d_1031 (Conv2D)         (None, 4, 4, 1024)        9438208   
_________________________________________________________________
batch_normalization_626 (Bat (None, 4, 4, 1024)        4096      
_________________________________________________________________
activation_1317 (Activation) (None, 4, 4, 1024)        0         
_________________________________________________________________
dropout_1317 (Dropout)       (None, 4, 4, 1024)        0         
_________________________________________________________________
flatten_147 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_433 (Dense)            (None, 64)                1048640   
_________________________________________________________________
batch_normalization_627 (Bat (None, 64)                256       
_________________________________________________________________
activation_1318 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_1318 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_434 (Dense)            (None, 256)               16640     
_________________________________________________________________
activation_1319 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1319 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_435 (Dense)            (None, 10)                2570      
=================================================================
Total params: 20,974,250
Trainable params: 20,971,882
Non-trainable params: 2,368
_________________________________________________________________
