Model: "sequential_73"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_508 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
batch_normalization_307 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_668 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_668 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_509 (Conv2D)          (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_669 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_669 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_153 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_510 (Conv2D)          (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_308 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_670 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_670 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_154 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_511 (Conv2D)          (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_671 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_671 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_512 (Conv2D)          (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_309 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_672 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_672 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_513 (Conv2D)          (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_673 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_673 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_514 (Conv2D)          (None, 8, 8, 1024)        9438208   
_________________________________________________________________
batch_normalization_310 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_674 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_674 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_73 (Flatten)         (None, 65536)             0         
_________________________________________________________________
dense_233 (Dense)            (None, 64)                4194368   
_________________________________________________________________
batch_normalization_311 (Bat (None, 64)                256       
_________________________________________________________________
activation_675 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_675 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_234 (Dense)            (None, 10)                650       
=================================================================
Total params: 24,105,514
Trainable params: 24,101,098
Non-trainable params: 4,416
_________________________________________________________________
