Model: "sequential_149"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1039 (Conv2D)         (None, 32, 32, 1024)      28672     
_________________________________________________________________
batch_normalization_633 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1329 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1329 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_1040 (Conv2D)         (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_1330 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1330 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_324 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_1041 (Conv2D)         (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_634 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1331 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1331 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_325 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_1042 (Conv2D)         (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_1332 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1332 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1043 (Conv2D)         (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_635 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1333 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1333 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_1044 (Conv2D)         (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_1334 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1334 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_1045 (Conv2D)         (None, 8, 8, 1024)        9438208   
_________________________________________________________________
batch_normalization_636 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1335 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1335 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_149 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_439 (Dense)            (None, 64)                4194368   
_________________________________________________________________
batch_normalization_637 (Bat (None, 64)                256       
_________________________________________________________________
activation_1336 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_1336 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_440 (Dense)            (None, 256)               16640     
_________________________________________________________________
activation_1337 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1337 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_441 (Dense)            (None, 10)                2570      
=================================================================
Total params: 24,124,074
Trainable params: 24,119,658
Non-trainable params: 4,416
_________________________________________________________________
