Model: "sequential_34"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_237 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
activation_325 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_325 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_238 (Conv2D)          (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_326 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_326 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_75 (MaxPooling (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_239 (Conv2D)          (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_149 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_327 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_327 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_76 (MaxPooling (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_240 (Conv2D)          (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_328 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_328 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_241 (Conv2D)          (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_150 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_329 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_329 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_242 (Conv2D)          (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_330 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_330 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_243 (Conv2D)          (None, 8, 8, 1024)        9438208   
_________________________________________________________________
batch_normalization_151 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_331 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_331 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_34 (Flatten)         (None, 65536)             0         
_________________________________________________________________
dense_122 (Dense)            (None, 64)                4194368   
_________________________________________________________________
batch_normalization_152 (Bat (None, 64)                256       
_________________________________________________________________
activation_332 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_332 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_123 (Dense)            (None, 256)               16640     
_________________________________________________________________
activation_333 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_333 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_124 (Dense)            (None, 16)                4112      
_________________________________________________________________
activation_334 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_334 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_125 (Dense)            (None, 10)                170       
=================================================================
Total params: 24,121,690
Trainable params: 24,119,322
Non-trainable params: 2,368
_________________________________________________________________
