Model: "sequential_197"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1387 (Conv2D)         (None, 32, 32, 1024)      28672     
_________________________________________________________________
activation_1773 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1773 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_1388 (Conv2D)         (None, 32, 32, 1024)      9438208   
_________________________________________________________________
activation_1774 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1774 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_430 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_1389 (Conv2D)         (None, 16, 16, 64)        589888    
_________________________________________________________________
batch_normalization_871 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1775 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1775 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_431 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_1390 (Conv2D)         (None, 8, 8, 128)         73856     
_________________________________________________________________
activation_1776 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1776 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1391 (Conv2D)         (None, 8, 8, 32)          36896     
_________________________________________________________________
batch_normalization_872 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1777 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1777 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_1392 (Conv2D)         (None, 8, 8, 1024)        295936    
_________________________________________________________________
activation_1778 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1778 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
conv2d_1393 (Conv2D)         (None, 8, 8, 256)         2359552   
_________________________________________________________________
batch_normalization_873 (Bat (None, 8, 8, 256)         1024      
_________________________________________________________________
activation_1779 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1779 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_1394 (Conv2D)         (None, 8, 8, 1024)        2360320   
_________________________________________________________________
batch_normalization_874 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1780 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1780 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_197 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_583 (Dense)            (None, 64)                4194368   
_________________________________________________________________
batch_normalization_875 (Bat (None, 64)                256       
_________________________________________________________________
activation_1781 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_1781 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_584 (Dense)            (None, 256)               16640     
_________________________________________________________________
batch_normalization_876 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1782 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1782 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_585 (Dense)            (None, 10)                2570      
=================================================================
Total params: 19,403,690
Trainable params: 19,400,298
Non-trainable params: 3,392
_________________________________________________________________
