Model: "sequential_260"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_549 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_785 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_785 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_221 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_260 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_496 (Dense)            (None, 128)               1048704   
_________________________________________________________________
activation_786 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_786 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_497 (Dense)            (None, 100)               12900     
=================================================================
Total params: 1,061,759
Trainable params: 1,061,759
Non-trainable params: 0
_________________________________________________________________
