Model: "sequential_116"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_297 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_397 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_397 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_100 (MaxPoolin (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_298 (Separa (None, 16, 16, 64)        1232      
_________________________________________________________________
batch_normalization_118 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_398 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_398 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_299 (Separa (None, 16, 16, 512)       33856     
_________________________________________________________________
activation_399 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_399 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
flatten_116 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_216 (Dense)            (None, 256)               33554688  
_________________________________________________________________
activation_400 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_400 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_217 (Dense)            (None, 100)               25700     
=================================================================
Total params: 33,615,823
Trainable params: 33,615,695
Non-trainable params: 128
_________________________________________________________________
