Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_31 (Separab (None, 32, 32, 16)        91        
_________________________________________________________________
activation_40 (Activation)   (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_40 (Dropout)         (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_32 (Separab (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_41 (Activation)   (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_41 (Dropout)         (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 8, 8, 64)          0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_24 (Dense)             (None, 64)                262208    
_________________________________________________________________
activation_42 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_42 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_25 (Dense)             (None, 100)               6500      
=================================================================
Total params: 270,031
Trainable params: 270,031
Non-trainable params: 0
_________________________________________________________________
