Model: "sequential_485"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_848 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1303 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1303 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_849 (Separa (None, 32, 32, 128)       4512      
_________________________________________________________________
activation_1304 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1304 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_485 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_940 (Dense)            (None, 1024)              134218752 
_________________________________________________________________
activation_1305 (Activation) (None, 1024)              0         
_________________________________________________________________
dropout_1305 (Dropout)       (None, 1024)              0         
_________________________________________________________________
dense_941 (Dense)            (None, 100)               102500    
=================================================================
Total params: 134,325,919
Trainable params: 134,325,919
Non-trainable params: 0
_________________________________________________________________
