Model: "sequential_407"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_719 (Separa (None, 32, 32, 128)       539       
_________________________________________________________________
batch_normalization_194 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1098 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1098 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_407 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_786 (Dense)            (None, 128)               16777344  
_________________________________________________________________
activation_1099 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1099 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_787 (Dense)            (None, 100)               12900     
=================================================================
Total params: 16,791,295
Trainable params: 16,791,039
Non-trainable params: 256
_________________________________________________________________
