Model: "sequential_458"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_802 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1232 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1232 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_803 (Separa (None, 32, 32, 16)        816       
_________________________________________________________________
activation_1233 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1233 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
flatten_458 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_888 (Dense)            (None, 32)                524320    
_________________________________________________________________
activation_1234 (Activation) (None, 32)                0         
_________________________________________________________________
dropout_1234 (Dropout)       (None, 32)                0         
_________________________________________________________________
dense_889 (Dense)            (None, 100)               3300      
=================================================================
Total params: 528,591
Trainable params: 528,591
Non-trainable params: 0
_________________________________________________________________
