Model: "sequential_88"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_227 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_301 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_301 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_73 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_228 (Separa (None, 16, 16, 256)       8736      
_________________________________________________________________
activation_302 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_302 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
flatten_88 (Flatten)         (None, 65536)             0         
_________________________________________________________________
dense_162 (Dense)            (None, 256)               16777472  
_________________________________________________________________
activation_303 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_303 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_163 (Dense)            (None, 100)               25700     
=================================================================
Total params: 16,812,063
Trainable params: 16,812,063
Non-trainable params: 0
_________________________________________________________________
