Model: "sequential_51"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_117 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_154 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_154 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_118 (Separa (None, 32, 32, 512)       8848      
_________________________________________________________________
activation_155 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_155 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
flatten_51 (Flatten)         (None, 524288)            0         
_________________________________________________________________
dense_88 (Dense)             (None, 256)               134217984 
_________________________________________________________________
activation_156 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_156 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_89 (Dense)             (None, 100)               25700     
=================================================================
Total params: 134,252,623
Trainable params: 134,252,623
Non-trainable params: 0
_________________________________________________________________
