Model: "sequential_442"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_775 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1189 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1189 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_776 (Separa (None, 32, 32, 128)       4512      
_________________________________________________________________
activation_1190 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1190 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_442 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_856 (Dense)            (None, 32)                4194336   
_________________________________________________________________
activation_1191 (Activation) (None, 32)                0         
_________________________________________________________________
dropout_1191 (Dropout)       (None, 32)                0         
_________________________________________________________________
dense_857 (Dense)            (None, 100)               3300      
=================================================================
Total params: 4,202,303
Trainable params: 4,202,303
Non-trainable params: 0
_________________________________________________________________
