Model: "sequential_58"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_137 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
batch_normalization_59 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
activation_181 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_181 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_46 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_138 (Separa (None, 16, 16, 256)       8736      
_________________________________________________________________
activation_182 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_182 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
flatten_58 (Flatten)         (None, 65536)             0         
_________________________________________________________________
dense_102 (Dense)            (None, 256)               16777472  
_________________________________________________________________
activation_183 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_183 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_103 (Dense)            (None, 100)               25700     
=================================================================
Total params: 16,812,191
Trainable params: 16,812,127
Non-trainable params: 64
_________________________________________________________________
