Model: "sequential_195"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_458 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_636 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_636 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_459 (Separa (None, 32, 32, 512)       8848      
_________________________________________________________________
activation_637 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_637 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
flatten_195 (Flatten)        (None, 524288)            0         
_________________________________________________________________
dense_373 (Dense)            (None, 1024)              536871936 
_________________________________________________________________
activation_638 (Activation)  (None, 1024)              0         
_________________________________________________________________
dropout_638 (Dropout)        (None, 1024)              0         
_________________________________________________________________
dense_374 (Dense)            (None, 100)               102500    
=================================================================
Total params: 536,983,375
Trainable params: 536,983,375
Non-trainable params: 0
_________________________________________________________________
