Model: "sequential_72"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_177 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_70 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
activation_235 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_235 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_178 (Separa (None, 32, 32, 512)       33856     
_________________________________________________________________
activation_236 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_236 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
flatten_72 (Flatten)         (None, 524288)            0         
_________________________________________________________________
dense_130 (Dense)            (None, 256)               134217984 
_________________________________________________________________
activation_237 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_237 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_131 (Dense)            (None, 100)               25700     
=================================================================
Total params: 134,278,079
Trainable params: 134,277,951
Non-trainable params: 128
_________________________________________________________________
