Model: "sequential_42"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_91 (Separab (None, 32, 32, 32)        155       
_________________________________________________________________
batch_normalization_43 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
activation_119 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_119 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_92 (Separab (None, 16, 16, 256)       8736      
_________________________________________________________________
activation_120 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_120 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_93 (Separab (None, 16, 16, 128)       35200     
_________________________________________________________________
activation_121 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_121 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 32768)             0         
_________________________________________________________________
dense_70 (Dense)             (None, 256)               8388864   
_________________________________________________________________
activation_122 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_122 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_71 (Dense)             (None, 100)               25700     
=================================================================
Total params: 8,458,783
Trainable params: 8,458,719
Non-trainable params: 64
_________________________________________________________________
