Model: "sequential_174"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_417 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_150 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_575 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_575 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_156 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_418 (Separa (None, 16, 16, 256)       17216     
_________________________________________________________________
activation_576 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_576 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
flatten_174 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_332 (Dense)            (None, 128)               8388736   
_________________________________________________________________
activation_577 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_577 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_333 (Dense)            (None, 100)               12900     
=================================================================
Total params: 8,419,391
Trainable params: 8,419,263
Non-trainable params: 128
_________________________________________________________________
