Model: "sequential_56"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_131 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_57 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
activation_173 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_173 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_44 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_132 (Separa (None, 16, 16, 64)        4736      
_________________________________________________________________
activation_174 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_174 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_133 (Separa (None, 16, 16, 32)        2656      
_________________________________________________________________
activation_175 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_175 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_56 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_98 (Dense)             (None, 256)               2097408   
_________________________________________________________________
activation_176 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_176 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_99 (Dense)             (None, 100)               25700     
=================================================================
Total params: 2,131,039
Trainable params: 2,130,911
Non-trainable params: 128
_________________________________________________________________
