Model: "sequential_360"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_653 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_985 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_985 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
flatten_360 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_692 (Dense)            (None, 128)               4194432   
_________________________________________________________________
activation_986 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_986 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_693 (Dense)            (None, 100)               12900     
=================================================================
Total params: 4,207,487
Trainable params: 4,207,487
Non-trainable params: 0
_________________________________________________________________
