Model: "sequential_335"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_625 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
activation_933 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_933 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
flatten_335 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_643 (Dense)            (None, 1024)              268436480 
_________________________________________________________________
activation_934 (Activation)  (None, 1024)              0         
_________________________________________________________________
dropout_934 (Dropout)        (None, 1024)              0         
_________________________________________________________________
dense_644 (Dense)            (None, 100)               102500    
=================================================================
Total params: 268,540,031
Trainable params: 268,540,031
Non-trainable params: 0
_________________________________________________________________
