Model: "sequential_295"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_584 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
activation_853 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_853 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
flatten_295 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_564 (Dense)            (None, 1024)              268436480 
_________________________________________________________________
activation_854 (Activation)  (None, 1024)              0         
_________________________________________________________________
dropout_854 (Dropout)        (None, 1024)              0         
_________________________________________________________________
dense_565 (Dense)            (None, 100)               102500    
=================================================================
Total params: 268,540,031
Trainable params: 268,540,031
Non-trainable params: 0
_________________________________________________________________
