Model: "sequential_50"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_113 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
batch_normalization_52 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
activation_149 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_149 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_114 (Separa (None, 16, 16, 256)       8736      
_________________________________________________________________
activation_150 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_150 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_115 (Separa (None, 16, 16, 32)        10528     
_________________________________________________________________
activation_151 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_151 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_116 (Separa (None, 16, 16, 128)       4512      
_________________________________________________________________
activation_152 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_152 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_50 (Flatten)         (None, 32768)             0         
_________________________________________________________________
dense_86 (Dense)             (None, 256)               8388864   
_________________________________________________________________
activation_153 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_153 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_87 (Dense)             (None, 100)               25700     
=================================================================
Total params: 8,438,623
Trainable params: 8,438,559
Non-trainable params: 64
_________________________________________________________________
