Model: "sequential_284"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_573 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
activation_831 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_831 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
flatten_284 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_542 (Dense)            (None, 1024)              268436480 
_________________________________________________________________
activation_832 (Activation)  (None, 1024)              0         
_________________________________________________________________
dropout_832 (Dropout)        (None, 1024)              0         
_________________________________________________________________
dense_543 (Dense)            (None, 100)               102500    
=================================================================
Total params: 268,540,031
Trainable params: 268,540,031
Non-trainable params: 0
_________________________________________________________________
