Model: "sequential_486"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_850 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1306 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1306 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_851 (Separa (None, 32, 32, 128)       4512      
_________________________________________________________________
batch_normalization_230 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1307 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1307 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_486 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_942 (Dense)            (None, 1024)              134218752 
_________________________________________________________________
activation_1308 (Activation) (None, 1024)              0         
_________________________________________________________________
dropout_1308 (Dropout)       (None, 1024)              0         
_________________________________________________________________
dense_943 (Dense)            (None, 100)               102500    
=================================================================
Total params: 134,326,431
Trainable params: 134,326,175
Non-trainable params: 256
_________________________________________________________________
