Model: "sequential_356"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_647 (Separa (None, 32, 32, 8)         59        
_________________________________________________________________
activation_976 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_976 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_648 (Separa (None, 32, 32, 128)       1224      
_________________________________________________________________
activation_977 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_977 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_356 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_685 (Dense)            (None, 1024)              134218752 
_________________________________________________________________
activation_978 (Activation)  (None, 1024)              0         
_________________________________________________________________
dropout_978 (Dropout)        (None, 1024)              0         
_________________________________________________________________
dense_686 (Dense)            (None, 100)               102500    
=================================================================
Total params: 134,322,535
Trainable params: 134,322,535
Non-trainable params: 0
_________________________________________________________________
