Model: "sequential_104"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_269 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_358 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_358 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_89 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_270 (Separa (None, 16, 16, 256)       4496      
_________________________________________________________________
activation_359 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_359 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
flatten_104 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_193 (Dense)            (None, 1024)              67109888  
_________________________________________________________________
activation_360 (Activation)  (None, 1024)              0         
_________________________________________________________________
dropout_360 (Dropout)        (None, 1024)              0         
_________________________________________________________________
dense_194 (Dense)            (None, 100)               102500    
=================================================================
Total params: 67,216,975
Trainable params: 67,216,975
Non-trainable params: 0
_________________________________________________________________
