Model: "sequential_231"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_515 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_728 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_728 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_196 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_231 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_444 (Dense)            (None, 1024)              8389632   
_________________________________________________________________
activation_729 (Activation)  (None, 1024)              0         
_________________________________________________________________
dropout_729 (Dropout)        (None, 1024)              0         
_________________________________________________________________
dense_445 (Dense)            (None, 100)               102500    
=================================================================
Total params: 8,492,287
Trainable params: 8,492,287
Non-trainable params: 0
_________________________________________________________________
