Model: "sequential_319"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_608 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
activation_901 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_901 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
flatten_319 (Flatten)        (None, 524288)            0         
_________________________________________________________________
dense_612 (Dense)            (None, 64)                33554496  
_________________________________________________________________
activation_902 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_902 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_613 (Dense)            (None, 100)               6500      
=================================================================
Total params: 33,563,071
Trainable params: 33,563,071
Non-trainable params: 0
_________________________________________________________________
