Model: "sequential_328"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_617 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
activation_918 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_918 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
flatten_328 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_629 (Dense)            (None, 1024)              268436480 
_________________________________________________________________
activation_919 (Activation)  (None, 1024)              0         
_________________________________________________________________
dropout_919 (Dropout)        (None, 1024)              0         
_________________________________________________________________
dense_630 (Dense)            (None, 100)               102500    
=================================================================
Total params: 268,540,031
Trainable params: 268,540,031
Non-trainable params: 0
_________________________________________________________________
