Model: "sequential_447"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_783 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
batch_normalization_209 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1202 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1202 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
flatten_447 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_866 (Dense)            (None, 128)               4194432   
_________________________________________________________________
activation_1203 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1203 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_867 (Dense)            (None, 100)               12900     
=================================================================
Total params: 4,207,615
Trainable params: 4,207,551
Non-trainable params: 64
_________________________________________________________________
