Model: "sequential_230"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_514 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_726 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_726 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_195 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_230 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_442 (Dense)            (None, 128)               1048704   
_________________________________________________________________
activation_727 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_727 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_443 (Dense)            (None, 100)               12900     
=================================================================
Total params: 1,061,759
Trainable params: 1,061,759
Non-trainable params: 0
_________________________________________________________________
