Model: "sequential_462"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_809 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1243 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1243 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_810 (Separa (None, 32, 32, 32)        1344      
_________________________________________________________________
batch_normalization_217 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1244 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1244 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
flatten_462 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_896 (Dense)            (None, 100)               3276900   
=================================================================
Total params: 3,278,527
Trainable params: 3,278,463
Non-trainable params: 64
_________________________________________________________________
