Model: "sequential_400"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_707 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1079 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1079 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
flatten_400 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_772 (Dense)            (None, 128)               4194432   
_________________________________________________________________
activation_1080 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1080 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_773 (Dense)            (None, 100)               12900     
=================================================================
Total params: 4,207,487
Trainable params: 4,207,487
Non-trainable params: 0
_________________________________________________________________
