Model: "sequential_393"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_698 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
activation_1063 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1063 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
flatten_393 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_758 (Dense)            (None, 512)               134218240 
_________________________________________________________________
batch_normalization_192 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1064 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1064 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_759 (Dense)            (None, 100)               51300     
=================================================================
Total params: 134,272,639
Trainable params: 134,271,615
Non-trainable params: 1,024
_________________________________________________________________
