Model: "sequential_24"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_55 (Separab (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_45 (Batc (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_74 (Activation)   (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_74 (Dropout)         (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_56 (Separab (None, 32, 32, 32)        21024     
_________________________________________________________________
activation_75 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_75 (Dropout)         (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_24 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_43 (Dense)             (None, 256)               2097408   
_________________________________________________________________
batch_normalization_46 (Batc (None, 256)               1024      
_________________________________________________________________
activation_76 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_76 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_44 (Dense)             (None, 10)                2570      
=================================================================
Total params: 2,126,149
Trainable params: 2,124,613
Non-trainable params: 1,536
_________________________________________________________________
