Model: "sequential_164"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_324 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_321 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_479 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_479 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_325 (Separa (None, 32, 32, 128)       70272     
_________________________________________________________________
activation_480 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_480 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_143 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_164 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_319 (Dense)            (None, 32)                1048608   
_________________________________________________________________
batch_normalization_322 (Bat (None, 32)                128       
_________________________________________________________________
activation_481 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_481 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_320 (Dense)            (None, 10)                330       
=================================================================
Total params: 1,123,461
Trainable params: 1,122,373
Non-trainable params: 1,088
_________________________________________________________________
