Model: "sequential_74"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_147 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
activation_214 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_214 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_148 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
activation_215 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_215 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_59 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_74 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_141 (Dense)            (None, 256)               2097408   
_________________________________________________________________
batch_normalization_141 (Bat (None, 256)               1024      
_________________________________________________________________
activation_216 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_216 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_142 (Dense)            (None, 10)                2570      
=================================================================
Total params: 2,124,101
Trainable params: 2,123,589
Non-trainable params: 512
_________________________________________________________________
