Model: "sequential_362"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_688 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1019 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1019 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_689 (Separa (None, 32, 32, 128)       4512      
_________________________________________________________________
activation_1020 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1020 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_362 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_693 (Dense)            (None, 512)               67109376  
_________________________________________________________________
batch_normalization_679 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1021 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1021 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_694 (Dense)            (None, 10)                5130      
=================================================================
Total params: 67,121,221
Trainable params: 67,120,197
Non-trainable params: 1,024
_________________________________________________________________
