Model: "sequential_165"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_326 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_323 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_482 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_482 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_327 (Separa (None, 32, 32, 128)       70272     
_________________________________________________________________
activation_483 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_483 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_144 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_165 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_321 (Dense)            (None, 128)               4194432   
_________________________________________________________________
batch_normalization_324 (Bat (None, 128)               512       
_________________________________________________________________
activation_484 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_484 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_322 (Dense)            (None, 10)                1290      
=================================================================
Total params: 4,270,629
Trainable params: 4,269,349
Non-trainable params: 1,280
_________________________________________________________________
