Model: "sequential_117"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_230 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_222 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_339 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_339 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_231 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
activation_340 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_340 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_97 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_117 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_226 (Dense)            (None, 64)                524352    
_________________________________________________________________
batch_normalization_223 (Bat (None, 64)                256       
_________________________________________________________________
activation_341 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_341 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_227 (Dense)            (None, 10)                650       
=================================================================
Total params: 550,405
Trainable params: 549,253
Non-trainable params: 1,152
_________________________________________________________________
