Model: "sequential_221"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_438 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_432 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_650 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_650 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_202 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_439 (Separa (None, 16, 16, 128)       70272     
_________________________________________________________________
activation_651 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_651 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_203 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_221 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_433 (Dense)            (None, 128)               1048704   
_________________________________________________________________
batch_normalization_433 (Bat (None, 128)               512       
_________________________________________________________________
activation_652 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_652 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_434 (Dense)            (None, 10)                1290      
=================================================================
Total params: 1,124,901
Trainable params: 1,123,621
Non-trainable params: 1,280
_________________________________________________________________
