Model: "sequential_194"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_384 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_381 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_569 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_569 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_385 (Separa (None, 32, 32, 128)       70272     
_________________________________________________________________
activation_570 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_570 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_176 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_194 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_379 (Dense)            (None, 32)                1048608   
_________________________________________________________________
batch_normalization_382 (Bat (None, 32)                128       
_________________________________________________________________
activation_571 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_571 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_380 (Dense)            (None, 10)                330       
=================================================================
Total params: 1,123,461
Trainable params: 1,122,373
Non-trainable params: 1,088
_________________________________________________________________
