Model: "sequential_210"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_416 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
batch_normalization_411 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_617 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_617 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_417 (Separa (None, 32, 32, 128)       2320      
_________________________________________________________________
activation_618 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_618 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_192 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_210 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_411 (Dense)            (None, 128)               4194432   
_________________________________________________________________
batch_normalization_412 (Bat (None, 128)               512       
_________________________________________________________________
activation_619 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_619 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_412 (Dense)            (None, 10)                1290      
=================================================================
Total params: 4,198,709
Trainable params: 4,198,421
Non-trainable params: 288
_________________________________________________________________
