Model: "sequential_40"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_84 (Separab (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_77 (Batc (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_119 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_119 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_85 (Separab (None, 32, 32, 32)        21024     
_________________________________________________________________
activation_120 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_120 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_31 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_40 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_75 (Dense)             (None, 256)               2097408   
_________________________________________________________________
batch_normalization_78 (Batc (None, 256)               1024      
_________________________________________________________________
activation_121 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_121 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_76 (Dense)             (None, 10)                2570      
=================================================================
Total params: 2,126,149
Trainable params: 2,124,613
Non-trainable params: 1,536
_________________________________________________________________
