Model: "sequential_299"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_581 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_570 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_862 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_862 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
flatten_299 (Flatten)        (None, 524288)            0         
_________________________________________________________________
dense_580 (Dense)            (None, 128)               67108992  
_________________________________________________________________
batch_normalization_571 (Bat (None, 128)               512       
_________________________________________________________________
activation_863 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_863 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_581 (Dense)            (None, 10)                1290      
=================================================================
Total params: 67,114,917
Trainable params: 67,113,637
Non-trainable params: 1,280
_________________________________________________________________
