Model: "sequential_238"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_472 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_464 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_700 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_700 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_473 (Separa (None, 32, 32, 512)       267264    
_________________________________________________________________
activation_701 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_701 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_219 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
flatten_238 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_466 (Dense)            (None, 128)               16777344  
_________________________________________________________________
batch_normalization_465 (Bat (None, 128)               512       
_________________________________________________________________
activation_702 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_702 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_467 (Dense)            (None, 10)                1290      
=================================================================
Total params: 17,050,533
Trainable params: 17,049,253
Non-trainable params: 1,280
_________________________________________________________________
