Model: "sequential_333"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_640 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_632 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_951 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_951 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_641 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
activation_952 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_952 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
flatten_333 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_644 (Dense)            (None, 10)                327690    
=================================================================
Total params: 352,837
Trainable params: 351,813
Non-trainable params: 1,024
_________________________________________________________________
