Model: "sequential_298"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_580 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
batch_normalization_568 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_860 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_860 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
flatten_298 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_578 (Dense)            (None, 128)               2097280   
_________________________________________________________________
batch_normalization_569 (Bat (None, 128)               512       
_________________________________________________________________
activation_861 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_861 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_579 (Dense)            (None, 10)                1290      
=================================================================
Total params: 2,099,237
Trainable params: 2,098,949
Non-trainable params: 288
_________________________________________________________________
