Model: "sequential_371"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_705 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_694 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_1043 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1043 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_706 (Separa (None, 32, 32, 8)         1096      
_________________________________________________________________
activation_1044 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_1044 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
max_pooling2d_272 (MaxPoolin (None, 16, 16, 8)         0         
_________________________________________________________________
flatten_371 (Flatten)        (None, 2048)              0         
_________________________________________________________________
dense_709 (Dense)            (None, 64)                131136    
_________________________________________________________________
batch_normalization_695 (Bat (None, 64)                256       
_________________________________________________________________
activation_1045 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_1045 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_710 (Dense)            (None, 10)                650       
=================================================================
Total params: 133,677
Trainable params: 133,421
Non-trainable params: 256
_________________________________________________________________
