Model: "sequential_185"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_366 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_363 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_542 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_542 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_367 (Separa (None, 32, 32, 128)       70272     
_________________________________________________________________
activation_543 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_543 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_167 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_185 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_361 (Dense)            (None, 256)               8388864   
_________________________________________________________________
batch_normalization_364 (Bat (None, 256)               1024      
_________________________________________________________________
activation_544 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_544 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_362 (Dense)            (None, 10)                2570      
=================================================================
Total params: 8,466,853
Trainable params: 8,465,317
Non-trainable params: 1,536
_________________________________________________________________
