Model: "sequential_387"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_736 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_725 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_1089 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1089 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_737 (Separa (None, 32, 32, 128)       8896      
_________________________________________________________________
activation_1090 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1090 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_387 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_740 (Dense)            (None, 512)               67109376  
_________________________________________________________________
batch_normalization_726 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1091 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1091 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_741 (Dense)            (None, 10)                5130      
=================================================================
Total params: 67,125,989
Trainable params: 67,124,837
Non-trainable params: 1,152
_________________________________________________________________
