Model: "sequential_99"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_194 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_185 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_285 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_285 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_195 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
activation_286 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_286 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_79 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_99 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_190 (Dense)            (None, 256)               2097408   
_________________________________________________________________
batch_normalization_186 (Bat (None, 256)               1024      
_________________________________________________________________
activation_287 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_287 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_191 (Dense)            (None, 10)                2570      
=================================================================
Total params: 2,126,149
Trainable params: 2,124,613
Non-trainable params: 1,536
_________________________________________________________________
