Model: "sequential_304"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_588 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_581 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_874 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_874 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_589 (Separa (None, 32, 32, 256)       135936    
_________________________________________________________________
activation_875 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_875 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
flatten_304 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_590 (Dense)            (None, 128)               33554560  
_________________________________________________________________
batch_normalization_582 (Bat (None, 128)               512       
_________________________________________________________________
activation_876 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_876 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_591 (Dense)            (None, 10)                1290      
=================================================================
Total params: 33,696,421
Trainable params: 33,695,141
Non-trainable params: 1,280
_________________________________________________________________
