Model: "sequential_44"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_90 (Separab (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_85 (Batc (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_129 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_129 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_91 (Separab (None, 32, 32, 32)        21024     
_________________________________________________________________
activation_130 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_130 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_44 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_83 (Dense)             (None, 256)               2097408   
_________________________________________________________________
batch_normalization_86 (Batc (None, 256)               1024      
_________________________________________________________________
activation_131 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_131 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_84 (Dense)             (None, 10)                2570      
=================================================================
Total params: 2,126,149
Trainable params: 2,124,613
Non-trainable params: 1,536
_________________________________________________________________
