Model: "sequential_282"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_551 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_540 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_818 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_818 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_245 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_552 (Separa (None, 16, 16, 512)       267264    
_________________________________________________________________
activation_819 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_819 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
flatten_282 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_549 (Dense)            (None, 128)               16777344  
_________________________________________________________________
batch_normalization_541 (Bat (None, 128)               512       
_________________________________________________________________
activation_820 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_820 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_550 (Dense)            (None, 10)                1290      
=================================================================
Total params: 17,050,533
Trainable params: 17,049,253
Non-trainable params: 1,280
_________________________________________________________________
