Model: "sequential_135"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_266 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_260 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_392 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_392 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_267 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
activation_393 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_393 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_115 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_135 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_261 (Dense)            (None, 256)               2097408   
_________________________________________________________________
batch_normalization_261 (Bat (None, 256)               1024      
_________________________________________________________________
activation_394 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_394 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_262 (Dense)            (None, 10)                2570      
=================================================================
Total params: 2,126,149
Trainable params: 2,124,613
Non-trainable params: 1,536
_________________________________________________________________
