Model: "sequential_65"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_129 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
activation_188 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_188 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_130 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
activation_189 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_189 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_50 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_65 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_124 (Dense)            (None, 10)                81930     
=================================================================
Total params: 105,029
Trainable params: 105,029
Non-trainable params: 0
_________________________________________________________________
