Model: "sequential_349"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_664 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_658 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_986 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_986 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_665 (Separa (None, 32, 32, 128)       70272     
_________________________________________________________________
activation_987 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_987 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_349 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_671 (Dense)            (None, 10)                1310730   
=================================================================
Total params: 1,385,125
Trainable params: 1,384,101
Non-trainable params: 1,024
_________________________________________________________________
