Model: "sequential_294"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_572 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_560 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_849 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_849 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_573 (Separa (None, 32, 32, 128)       70272     
_________________________________________________________________
activation_850 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_850 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_294 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_571 (Dense)            (None, 128)               16777344  
_________________________________________________________________
batch_normalization_561 (Bat (None, 128)               512       
_________________________________________________________________
activation_851 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_851 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_572 (Dense)            (None, 10)                1290      
=================================================================
Total params: 16,853,541
Trainable params: 16,852,261
Non-trainable params: 1,280
_________________________________________________________________
