Model: "sequential_182"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_360 (Separa (None, 32, 32, 8)         59        
_________________________________________________________________
batch_normalization_357 (Bat (None, 32, 32, 8)         32        
_________________________________________________________________
activation_533 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_533 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_361 (Separa (None, 32, 32, 128)       1224      
_________________________________________________________________
activation_534 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_534 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_163 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_182 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_355 (Dense)            (None, 32)                1048608   
_________________________________________________________________
batch_normalization_358 (Bat (None, 32)                128       
_________________________________________________________________
activation_535 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_535 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_356 (Dense)            (None, 10)                330       
=================================================================
Total params: 1,050,381
Trainable params: 1,050,301
Non-trainable params: 80
_________________________________________________________________
