Model: "sequential_293"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1358 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1997 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1997 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1359 (Conv2D)         (None, 32, 32, 8)         1160      
_________________________________________________________________
batch_normalization_1000 (Ba (None, 32, 32, 8)         32        
_________________________________________________________________
activation_1998 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_1998 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
max_pooling2d_264 (MaxPoolin (None, 16, 16, 8)         0         
_________________________________________________________________
conv2d_1360 (Conv2D)         (None, 16, 16, 32)        2336      
_________________________________________________________________
activation_1999 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1999 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_1361 (Conv2D)         (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_1001 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2000 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2000 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_293 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_932 (Dense)            (None, 256)               67109120  
_________________________________________________________________
activation_2001 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_2001 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_933 (Dense)            (None, 10)                2570      
=================================================================
Total params: 67,415,698
Trainable params: 67,413,634
Non-trainable params: 2,064
_________________________________________________________________
