Model: "sequential_395"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1759 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_2561 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2561 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1760 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
activation_2562 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2562 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_1761 (Conv2D)         (None, 32, 32, 1024)      1180672   
_________________________________________________________________
batch_normalization_1268 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2563 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2563 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
flatten_395 (Flatten)        (None, 1048576)           0         
_________________________________________________________________
dense_1197 (Dense)           (None, 64)                67108928  
_________________________________________________________________
batch_normalization_1269 (Ba (None, 64)                256       
_________________________________________________________________
activation_2564 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_2564 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_1198 (Dense)           (None, 32)                2080      
_________________________________________________________________
activation_2565 (Activation) (None, 32)                0         
_________________________________________________________________
dropout_2565 (Dropout)       (None, 32)                0         
_________________________________________________________________
dense_1199 (Dense)           (None, 10)                330       
=================================================================
Total params: 68,315,370
Trainable params: 68,313,194
Non-trainable params: 2,176
_________________________________________________________________
