Model: "sequential_396"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1762 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_2566 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2566 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1763 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
activation_2567 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2567 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_1764 (Conv2D)         (None, 32, 32, 1024)      1180672   
_________________________________________________________________
activation_2568 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2568 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_368 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_1765 (Conv2D)         (None, 16, 16, 1024)      9438208   
_________________________________________________________________
batch_normalization_1270 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2569 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2569 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_396 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_1200 (Dense)           (None, 64)                16777280  
_________________________________________________________________
batch_normalization_1271 (Ba (None, 64)                256       
_________________________________________________________________
activation_2570 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_2570 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_1201 (Dense)           (None, 32)                2080      
_________________________________________________________________
activation_2571 (Activation) (None, 32)                0         
_________________________________________________________________
dropout_2571 (Dropout)       (None, 32)                0         
_________________________________________________________________
dense_1202 (Dense)           (None, 10)                330       
=================================================================
Total params: 27,421,930
Trainable params: 27,419,754
Non-trainable params: 2,176
_________________________________________________________________
