Model: "sequential_350"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1583 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_2306 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2306 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1584 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
activation_2307 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2307 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_1585 (Conv2D)         (None, 32, 32, 1024)      1180672   
_________________________________________________________________
activation_2308 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2308 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_325 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
conv2d_1586 (Conv2D)         (None, 16, 16, 1024)      9438208   
_________________________________________________________________
batch_normalization_1165 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2309 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2309 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_350 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_1073 (Dense)           (None, 64)                16777280  
_________________________________________________________________
batch_normalization_1166 (Ba (None, 64)                256       
_________________________________________________________________
activation_2310 (Activation) (None, 64)                0         
_________________________________________________________________
dropout_2310 (Dropout)       (None, 64)                0         
_________________________________________________________________
dense_1074 (Dense)           (None, 32)                2080      
_________________________________________________________________
batch_normalization_1167 (Ba (None, 32)                128       
_________________________________________________________________
activation_2311 (Activation) (None, 32)                0         
_________________________________________________________________
dropout_2311 (Dropout)       (None, 32)                0         
_________________________________________________________________
dense_1075 (Dense)           (None, 10)                330       
=================================================================
Total params: 27,422,058
Trainable params: 27,419,818
Non-trainable params: 2,240
_________________________________________________________________
