Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_116 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
activation_162 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_162 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_117 (Conv2D)          (None, 32, 32, 16)        36880     
_________________________________________________________________
batch_normalization_84 (Batc (None, 32, 32, 16)        64        
_________________________________________________________________
activation_163 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_163 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_118 (Conv2D)          (None, 32, 32, 256)       37120     
_________________________________________________________________
activation_164 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_164 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 16, 16, 32)        73760     
_________________________________________________________________
batch_normalization_85 (Batc (None, 16, 16, 32)        128       
_________________________________________________________________
activation_165 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_165 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_120 (Conv2D)          (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_86 (Batc (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_166 (Activation)  (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_166 (Dropout)        (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 262144)            0         
_________________________________________________________________
dense_62 (Dense)             (None, 256)               67109120  
_________________________________________________________________
activation_167 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_167 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_63 (Dense)             (None, 512)               131584    
_________________________________________________________________
batch_normalization_87 (Batc (None, 512)               2048      
_________________________________________________________________
activation_168 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_168 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_64 (Dense)             (None, 32)                16416     
_________________________________________________________________
batch_normalization_88 (Batc (None, 32)                128       
_________________________________________________________________
activation_169 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_169 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_65 (Dense)             (None, 10)                330       
=================================================================
Total params: 67,714,778
Trainable params: 67,711,546
Non-trainable params: 3,232
_________________________________________________________________
