Model: "sequential_184"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_940 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1379 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1379 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_941 (Conv2D)          (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_669 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1380 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1380 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_161 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_942 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_1381 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1381 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_943 (Conv2D)          (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_670 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1382 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1382 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_184 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_623 (Dense)            (None, 256)               67109120  
_________________________________________________________________
activation_1383 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1383 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_624 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_671 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1384 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1384 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_625 (Dense)            (None, 10)                5130      
=================================================================
Total params: 67,604,330
Trainable params: 67,601,002
Non-trainable params: 3,328
_________________________________________________________________
