Model: "sequential_262"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1246 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1829 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1829 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1247 (Conv2D)         (None, 32, 32, 32)        4640      
_________________________________________________________________
batch_normalization_911 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1830 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1830 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_1248 (Conv2D)         (None, 32, 32, 1024)      295936    
_________________________________________________________________
batch_normalization_912 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1831 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1831 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
flatten_262 (Flatten)        (None, 1048576)           0         
_________________________________________________________________
dense_845 (Dense)            (None, 256)               268435712 
_________________________________________________________________
batch_normalization_913 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1832 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1832 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_846 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_914 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1833 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1833 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_847 (Dense)            (None, 10)                5130      
=================================================================
Total params: 268,880,746
Trainable params: 268,877,098
Non-trainable params: 3,648
_________________________________________________________________
