Model: "sequential_56"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_359 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_499 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_499 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_360 (Conv2D)          (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_248 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_500 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_500 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_69 (MaxPooling (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_361 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
batch_normalization_249 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_501 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_501 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_362 (Conv2D)          (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_250 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_502 (Activation)  (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_502 (Dropout)        (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_56 (Flatten)         (None, 262144)            0         
_________________________________________________________________
dense_196 (Dense)            (None, 256)               67109120  
_________________________________________________________________
activation_503 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_503 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_197 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_251 (Bat (None, 512)               2048      
_________________________________________________________________
activation_504 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_504 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_198 (Dense)            (None, 32)                16416     
_________________________________________________________________
batch_normalization_252 (Bat (None, 32)                128       
_________________________________________________________________
activation_505 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_505 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_199 (Dense)            (None, 10)                330       
=================================================================
Total params: 67,616,202
Trainable params: 67,612,746
Non-trainable params: 3,456
_________________________________________________________________
