Model: "sequential_111"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_642 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
activation_928 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_928 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_643 (Conv2D)          (None, 32, 32, 16)        147472    
_________________________________________________________________
batch_normalization_443 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_929 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_929 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_644 (Conv2D)          (None, 32, 32, 32)        4640      
_________________________________________________________________
activation_930 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_930 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_645 (Conv2D)          (None, 32, 32, 16)        4624      
_________________________________________________________________
activation_931 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_931 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_646 (Conv2D)          (None, 32, 32, 1024)      148480    
_________________________________________________________________
batch_normalization_444 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_932 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_932 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
flatten_111 (Flatten)        (None, 1048576)           0         
_________________________________________________________________
dense_397 (Dense)            (None, 256)               268435712 
_________________________________________________________________
activation_933 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_933 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_398 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_445 (Bat (None, 512)               2048      
_________________________________________________________________
activation_934 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_934 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_399 (Dense)            (None, 32)                16416     
_________________________________________________________________
batch_normalization_446 (Bat (None, 32)                128       
_________________________________________________________________
activation_935 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_935 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_400 (Dense)            (None, 10)                330       
=================================================================
Total params: 268,924,266
Trainable params: 268,921,098
Non-trainable params: 3,168
_________________________________________________________________
