Model: "sequential_227"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1109 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1627 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1627 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1110 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_792 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1628 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1628 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_204 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1111 (Conv2D)         (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_1629 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1629 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_1112 (Conv2D)         (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_793 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1630 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1630 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_227 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_745 (Dense)            (None, 512)               134218240 
_________________________________________________________________
batch_normalization_794 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1631 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1631 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_746 (Dense)            (None, 10)                5130      
=================================================================
Total params: 134,581,866
Trainable params: 134,578,538
Non-trainable params: 3,328
_________________________________________________________________
