Model: "sequential_103"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_605 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_869 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_869 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_606 (Conv2D)          (None, 32, 32, 16)        2320      
_________________________________________________________________
batch_normalization_414 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_870 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_870 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_607 (Conv2D)          (None, 32, 32, 32)        4640      
_________________________________________________________________
activation_871 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_871 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_608 (Conv2D)          (None, 32, 32, 16)        4624      
_________________________________________________________________
activation_872 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_872 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
flatten_103 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_367 (Dense)            (None, 256)               4194560   
_________________________________________________________________
activation_873 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_873 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_368 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_415 (Bat (None, 512)               2048      
_________________________________________________________________
activation_874 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_874 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_369 (Dense)            (None, 10)                5130      
=================================================================
Total params: 4,345,418
Trainable params: 4,344,362
Non-trainable params: 1,056
_________________________________________________________________
