Model: "sequential_269"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1271 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1868 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1868 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1272 (Conv2D)         (None, 32, 32, 32)        4640      
_________________________________________________________________
activation_1869 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1869 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_1273 (Conv2D)         (None, 32, 32, 1024)      295936    
_________________________________________________________________
batch_normalization_934 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1870 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1870 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
flatten_269 (Flatten)        (None, 1048576)           0         
_________________________________________________________________
dense_866 (Dense)            (None, 256)               268435712 
_________________________________________________________________
batch_normalization_935 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1871 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1871 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_867 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_936 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1872 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1872 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_868 (Dense)            (None, 10)                5130      
=================================================================
Total params: 268,880,618
Trainable params: 268,877,034
Non-trainable params: 3,584
_________________________________________________________________
