Model: "sequential_247"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1189 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1743 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1743 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1190 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_857 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1744 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1744 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_225 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1191 (Conv2D)         (None, 16, 16, 32)        36896     
_________________________________________________________________
batch_normalization_858 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_1745 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1745 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_247 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_801 (Dense)            (None, 256)               2097408   
_________________________________________________________________
batch_normalization_859 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1746 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1746 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_802 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_860 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1747 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1747 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_803 (Dense)            (None, 10)                5130      
=================================================================
Total params: 2,293,738
Trainable params: 2,291,882
Non-trainable params: 1,856
_________________________________________________________________
