Model: "sequential_127"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_710 (Conv2D)          (None, 32, 32, 1024)      28672     
_________________________________________________________________
activation_1031 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1031 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
conv2d_711 (Conv2D)          (None, 32, 32, 16)        147472    
_________________________________________________________________
batch_normalization_493 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1032 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1032 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_712 (Conv2D)          (None, 32, 32, 32)        4640      
_________________________________________________________________
activation_1033 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1033 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_713 (Conv2D)          (None, 32, 32, 16)        4624      
_________________________________________________________________
activation_1034 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1034 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_714 (Conv2D)          (None, 32, 32, 1024)      148480    
_________________________________________________________________
batch_normalization_494 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1035 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1035 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
flatten_127 (Flatten)        (None, 1048576)           0         
_________________________________________________________________
dense_448 (Dense)            (None, 256)               268435712 
_________________________________________________________________
activation_1036 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1036 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_449 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_495 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1037 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1037 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_450 (Dense)            (None, 10)                5130      
=================================================================
Total params: 268,912,522
Trainable params: 268,909,418
Non-trainable params: 3,104
_________________________________________________________________
