Model: "sequential_130"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_723 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1051 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1051 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_724 (Conv2D)          (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_503 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1052 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1052 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_110 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_725 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_1053 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1053 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_726 (Conv2D)          (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_504 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1054 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1054 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_130 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_458 (Dense)            (None, 256)               67109120  
_________________________________________________________________
activation_1055 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1055 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_459 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_505 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1056 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1056 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_460 (Dense)            (None, 10)                5130      
=================================================================
Total params: 67,604,330
Trainable params: 67,601,002
Non-trainable params: 3,328
_________________________________________________________________
