Model: "sequential_208"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1034 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1519 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1519 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1035 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_738 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1520 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1520 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_185 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1036 (Conv2D)         (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_1521 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1521 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_1037 (Conv2D)         (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_739 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1522 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1522 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_208 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_693 (Dense)            (None, 256)               67109120  
_________________________________________________________________
activation_1523 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1523 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_694 (Dense)            (None, 512)               131584    
_________________________________________________________________
activation_1524 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1524 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_695 (Dense)            (None, 10)                5130      
=================================================================
Total params: 67,602,282
Trainable params: 67,599,978
Non-trainable params: 2,304
_________________________________________________________________
