Model: "sequential_193"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_975 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1432 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1432 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_976 (Conv2D)          (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_695 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1433 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1433 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_170 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_977 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_1434 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1434 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_978 (Conv2D)          (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_696 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1435 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1435 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_193 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_650 (Dense)            (None, 256)               67109120  
_________________________________________________________________
activation_1436 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1436 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_651 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_697 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1437 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1437 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_652 (Dense)            (None, 10)                5130      
=================================================================
Total params: 67,604,330
Trainable params: 67,601,002
Non-trainable params: 3,328
_________________________________________________________________
