Model: "sequential_115"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_660 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_955 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_955 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_661 (Conv2D)          (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_456 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_956 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_956 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_101 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_662 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_957 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_957 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_663 (Conv2D)          (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_457 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_958 (Activation)  (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_958 (Dropout)        (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_115 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_410 (Dense)            (None, 256)               67109120  
_________________________________________________________________
activation_959 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_959 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_411 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_458 (Bat (None, 512)               2048      
_________________________________________________________________
activation_960 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_960 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_412 (Dense)            (None, 10)                5130      
=================================================================
Total params: 67,604,330
Trainable params: 67,601,002
Non-trainable params: 3,328
_________________________________________________________________
