Model: "sequential_35"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_229 (Conv2D)          (None, 32, 32, 256)       7168      
_________________________________________________________________
activation_317 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_317 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_230 (Conv2D)          (None, 32, 32, 16)        36880     
_________________________________________________________________
batch_normalization_162 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_318 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_318 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_231 (Conv2D)          (None, 32, 32, 256)       37120     
_________________________________________________________________
activation_319 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_319 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_45 (MaxPooling (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_232 (Conv2D)          (None, 16, 16, 32)        73760     
_________________________________________________________________
batch_normalization_163 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_320 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_320 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_233 (Conv2D)          (None, 16, 16, 512)       147968    
_________________________________________________________________
batch_normalization_164 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_321 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_321 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_234 (Conv2D)          (None, 16, 16, 64)        294976    
_________________________________________________________________
activation_322 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_322 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_235 (Conv2D)          (None, 16, 16, 128)       73856     
_________________________________________________________________
batch_normalization_165 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_323 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_323 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_236 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
batch_normalization_166 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_324 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_324 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_35 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_123 (Dense)            (None, 32)                262176    
_________________________________________________________________
batch_normalization_167 (Bat (None, 32)                128       
_________________________________________________________________
activation_325 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_325 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_124 (Dense)            (None, 128)               4224      
_________________________________________________________________
activation_326 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_326 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_125 (Dense)            (None, 64)                8256      
_________________________________________________________________
batch_normalization_168 (Bat (None, 64)                256       
_________________________________________________________________
activation_327 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_327 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_126 (Dense)            (None, 10)                650       
=================================================================
Total params: 987,194
Trainable params: 985,562
Non-trainable params: 1,632
_________________________________________________________________
