Model: "sequential_104"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_609 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_875 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_875 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_610 (Conv2D)          (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_416 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_876 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_876 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_95 (MaxPooling (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_611 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_877 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_877 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_612 (Conv2D)          (None, 16, 16, 128)       36992     
_________________________________________________________________
batch_normalization_417 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_878 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_878 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_104 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_370 (Dense)            (None, 32)                1048608   
_________________________________________________________________
batch_normalization_418 (Bat (None, 32)                128       
_________________________________________________________________
activation_879 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_879 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_371 (Dense)            (None, 256)               8448      
_________________________________________________________________
activation_880 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_880 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_372 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_419 (Bat (None, 512)               2048      
_________________________________________________________________
activation_881 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_881 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_373 (Dense)            (None, 10)                5130      
=================================================================
Total params: 1,289,866
Trainable params: 1,288,266
Non-trainable params: 1,600
_________________________________________________________________
