Model: "sequential_153"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_816 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1193 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1193 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_817 (Conv2D)          (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_576 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1194 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1194 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_130 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_818 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_1195 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1195 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_819 (Conv2D)          (None, 16, 16, 128)       36992     
_________________________________________________________________
batch_normalization_577 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1196 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1196 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_153 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_530 (Dense)            (None, 16)                524304    
_________________________________________________________________
activation_1197 (Activation) (None, 16)                0         
_________________________________________________________________
dropout_1197 (Dropout)       (None, 16)                0         
_________________________________________________________________
dense_531 (Dense)            (None, 512)               8704      
_________________________________________________________________
batch_normalization_578 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1198 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1198 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_532 (Dense)            (None, 10)                5130      
=================================================================
Total params: 634,106
Trainable params: 632,570
Non-trainable params: 1,536
_________________________________________________________________
