Model: "sequential_45"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_292 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_401 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_401 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_293 (Conv2D)          (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_202 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_402 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_402 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_57 (MaxPooling (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_294 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_403 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_403 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_295 (Conv2D)          (None, 16, 16, 16)        4624      
_________________________________________________________________
activation_404 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_404 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_296 (Conv2D)          (None, 16, 16, 64)        9280      
_________________________________________________________________
activation_405 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_405 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_297 (Conv2D)          (None, 16, 16, 32)        18464     
_________________________________________________________________
batch_normalization_203 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_406 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_406 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_45 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_154 (Dense)            (None, 32)                262176    
_________________________________________________________________
batch_normalization_204 (Bat (None, 32)                128       
_________________________________________________________________
activation_407 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_407 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_155 (Dense)            (None, 128)               4224      
_________________________________________________________________
activation_408 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_408 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_156 (Dense)            (None, 64)                8256      
_________________________________________________________________
batch_normalization_205 (Bat (None, 64)                256       
_________________________________________________________________
activation_409 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_409 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_157 (Dense)            (None, 10)                650       
=================================================================
Total params: 364,602
Trainable params: 364,090
Non-trainable params: 512
_________________________________________________________________
