Model: "sequential_164"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_860 (Conv2D)          (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1259 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1259 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_861 (Conv2D)          (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_609 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1260 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1260 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_141 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_862 (Conv2D)          (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_1261 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1261 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_863 (Conv2D)          (None, 16, 16, 128)       36992     
_________________________________________________________________
batch_normalization_610 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1262 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1262 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_164 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_563 (Dense)            (None, 16)                524304    
_________________________________________________________________
activation_1263 (Activation) (None, 16)                0         
_________________________________________________________________
dropout_1263 (Dropout)       (None, 16)                0         
_________________________________________________________________
dense_564 (Dense)            (None, 512)               8704      
_________________________________________________________________
batch_normalization_611 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1264 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1264 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_565 (Dense)            (None, 10)                5130      
=================================================================
Total params: 634,106
Trainable params: 632,570
Non-trainable params: 1,536
_________________________________________________________________
