Model: "sequential_211"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1045 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1536 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1536 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1046 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_745 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1537 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1537 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_188 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1047 (Conv2D)         (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_1538 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1538 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_1048 (Conv2D)         (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_746 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1539 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1539 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_211 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_702 (Dense)            (None, 256)               67109120  
_________________________________________________________________
activation_1540 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1540 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_703 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_747 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1541 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1541 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_704 (Dense)            (None, 10)                5130      
=================================================================
Total params: 67,604,330
Trainable params: 67,601,002
Non-trainable params: 3,328
_________________________________________________________________
