Model: "sequential_226"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1105 (Conv2D)         (None, 32, 32, 16)        448       
_________________________________________________________________
activation_1622 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1622 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_1106 (Conv2D)         (None, 32, 32, 128)       18560     
_________________________________________________________________
batch_normalization_789 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1623 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1623 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_203 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_1107 (Conv2D)         (None, 16, 16, 32)        36896     
_________________________________________________________________
activation_1624 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1624 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_1108 (Conv2D)         (None, 16, 16, 1024)      295936    
_________________________________________________________________
batch_normalization_790 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1625 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1625 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
flatten_226 (Flatten)        (None, 262144)            0         
_________________________________________________________________
dense_743 (Dense)            (None, 512)               134218240 
_________________________________________________________________
batch_normalization_791 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1626 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1626 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_744 (Dense)            (None, 10)                5130      
=================================================================
Total params: 134,581,866
Trainable params: 134,578,538
Non-trainable params: 3,328
_________________________________________________________________
