Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d (SeparableC (None, 32, 32, 256)       1051      
_________________________________________________________________
activation (Activation)      (None, 32, 32, 256)       0         
_________________________________________________________________
dropout (Dropout)            (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 16, 16, 16)        6416      
_________________________________________________________________
batch_normalization (BatchNo (None, 16, 16, 16)        64        
_________________________________________________________________
activation_1 (Activation)    (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 16, 16)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 8, 8, 8)           280       
_________________________________________________________________
activation_2 (Activation)    (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 8, 8, 8)           0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 4, 8)           0         
_________________________________________________________________
separable_conv2d_3 (Separabl (None, 4, 4, 16)          216       
_________________________________________________________________
activation_3 (Activation)    (None, 4, 4, 16)          0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 4, 4, 16)          0         
_________________________________________________________________
separable_conv2d_4 (Separabl (None, 4, 4, 256)         4496      
_________________________________________________________________
activation_4 (Activation)    (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 4, 4, 256)         0         
_________________________________________________________________
separable_conv2d_5 (Separabl (None, 4, 4, 128)         35200     
_________________________________________________________________
activation_5 (Activation)    (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 4, 4, 128)         0         
_________________________________________________________________
separable_conv2d_6 (Separabl (None, 4, 4, 256)         34176     
_________________________________________________________________
batch_normalization_1 (Batch (None, 4, 4, 256)         1024      
_________________________________________________________________
activation_6 (Activation)    (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 4, 4, 256)         0         
_________________________________________________________________
separable_conv2d_7 (Separabl (None, 4, 4, 1024)        265472    
_________________________________________________________________
batch_normalization_2 (Batch (None, 4, 4, 1024)        4096      
_________________________________________________________________
activation_7 (Activation)    (None, 4, 4, 1024)        0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 4, 4, 1024)        0         
_________________________________________________________________
separable_conv2d_8 (Separabl (None, 4, 4, 8)           17416     
_________________________________________________________________
activation_8 (Activation)    (None, 4, 4, 8)           0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 4, 4, 8)           0         
_________________________________________________________________
separable_conv2d_9 (Separabl (None, 4, 4, 32)          360       
_________________________________________________________________
activation_9 (Activation)    (None, 4, 4, 32)          0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_10 (Separab (None, 4, 4, 64)          2400      
_________________________________________________________________
activation_10 (Activation)   (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 4, 4, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 4096)              4198400   
_________________________________________________________________
activation_11 (Activation)   (None, 4096)              0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               409700    
=================================================================
Total params: 4,980,767
Trainable params: 4,978,175
Non-trainable params: 2,592
_________________________________________________________________
