Model: "sequential_260"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2898 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_3161 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3161 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_2899 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_1850 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_3162 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_3162 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_2900 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_3163 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_3163 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_2901 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_3164 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_3164 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_757 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2902 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_3165 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3165 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2903 (Separ (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_1851 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_3166 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_3166 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_2904 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_1852 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3167 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3167 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2905 (Separ (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_1853 (Ba (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_3168 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_3168 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_758 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_2906 (Separ (None, 8, 8, 128)         70272     
_________________________________________________________________
activation_3169 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_3169 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_2907 (Separ (None, 8, 8, 32)          5280      
_________________________________________________________________
batch_normalization_1854 (Ba (None, 8, 8, 32)          128       
_________________________________________________________________
activation_3170 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_3170 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_2908 (Separ (None, 8, 8, 256)         8736      
_________________________________________________________________
batch_normalization_1855 (Ba (None, 8, 8, 256)         1024      
_________________________________________________________________
activation_3171 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_3171 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
max_pooling2d_759 (MaxPoolin (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_260 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_523 (Dense)            (None, 2048)              8390656   
_________________________________________________________________
batch_normalization_1856 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_3172 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_3172 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_524 (Dense)            (None, 100)               204900    
=================================================================
Total params: 8,754,127
Trainable params: 8,747,535
Non-trainable params: 6,592
_________________________________________________________________
