Model: "sequential_132"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1519 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1654 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1654 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1520 (Separ (None, 32, 32, 128)       4512      
_________________________________________________________________
batch_normalization_985 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1655 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1655 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1521 (Separ (None, 32, 32, 8)         2184      
_________________________________________________________________
activation_1656 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_1656 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_1522 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_1657 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1657 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_385 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1523 (Separ (None, 16, 16, 8)         1096      
_________________________________________________________________
activation_1658 (Activation) (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_1658 (Dropout)       (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_1524 (Separ (None, 16, 16, 128)       1224      
_________________________________________________________________
batch_normalization_986 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1659 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1659 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1525 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_987 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1660 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1660 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1526 (Separ (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_988 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_1661 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1661 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_386 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1527 (Separ (None, 8, 8, 32)          21024     
_________________________________________________________________
batch_normalization_989 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1662 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1662 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
max_pooling2d_387 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_1528 (Separ (None, 4, 4, 32)          1344      
_________________________________________________________________
batch_normalization_990 (Bat (None, 4, 4, 32)          128       
_________________________________________________________________
activation_1663 (Activation) (None, 4, 4, 32)          0         
_________________________________________________________________
dropout_1663 (Dropout)       (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_1529 (Separ (None, 4, 4, 256)         8736      
_________________________________________________________________
batch_normalization_991 (Bat (None, 4, 4, 256)         1024      
_________________________________________________________________
activation_1664 (Activation) (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_1664 (Dropout)       (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_132 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_267 (Dense)            (None, 2048)              8390656   
_________________________________________________________________
batch_normalization_992 (Bat (None, 2048)              8192      
_________________________________________________________________
activation_1665 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_1665 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_268 (Dense)            (None, 100)               204900    
=================================================================
Total params: 8,692,543
Trainable params: 8,686,143
Non-trainable params: 6,400
_________________________________________________________________
