Model: "sequential_105"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1217 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1325 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1325 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1218 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_783 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1326 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1326 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_1219 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_1327 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_1327 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_1220 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_1328 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1328 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_304 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1221 (Separ (None, 16, 16, 8)         1096      
_________________________________________________________________
activation_1329 (Activation) (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_1329 (Dropout)       (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_1222 (Separ (None, 16, 16, 128)       1224      
_________________________________________________________________
batch_normalization_784 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1330 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1330 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1223 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_785 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1331 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1331 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1224 (Separ (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_786 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_1332 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1332 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_305 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1225 (Separ (None, 8, 8, 128)         70272     
_________________________________________________________________
activation_1333 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1333 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_1226 (Separ (None, 8, 8, 32)          5280      
_________________________________________________________________
batch_normalization_787 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1334 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1334 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1227 (Separ (None, 8, 8, 256)         8736      
_________________________________________________________________
batch_normalization_788 (Bat (None, 8, 8, 256)         1024      
_________________________________________________________________
activation_1335 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1335 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
max_pooling2d_306 (MaxPoolin (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_105 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_213 (Dense)            (None, 2048)              8390656   
_________________________________________________________________
batch_normalization_789 (Bat (None, 2048)              8192      
_________________________________________________________________
activation_1336 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_1336 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_214 (Dense)            (None, 100)               204900    
=================================================================
Total params: 8,752,511
Trainable params: 8,745,919
Non-trainable params: 6,592
_________________________________________________________________
