Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_191 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_104 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_211 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_211 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_192 (Separa (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_212 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_212 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_193 (Separa (None, 16, 16, 64)        648       
_________________________________________________________________
activation_213 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_213 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_194 (Separa (None, 16, 16, 32)        2656      
_________________________________________________________________
activation_214 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_214 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_195 (Separa (None, 16, 16, 8)         552       
_________________________________________________________________
batch_normalization_105 (Bat (None, 16, 16, 8)         32        
_________________________________________________________________
activation_215 (Activation)  (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_215 (Dropout)        (None, 16, 16, 8)         0         
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 8, 8, 8)           0         
_________________________________________________________________
separable_conv2d_196 (Separa (None, 8, 8, 32)          360       
_________________________________________________________________
batch_normalization_106 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_216 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_216 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_197 (Separa (None, 8, 8, 128)         4512      
_________________________________________________________________
batch_normalization_107 (Bat (None, 8, 8, 128)         512       
_________________________________________________________________
activation_217 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_217 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 4, 4, 128)         0         
_________________________________________________________________
separable_conv2d_198 (Separa (None, 4, 4, 256)         34176     
_________________________________________________________________
batch_normalization_108 (Bat (None, 4, 4, 256)         1024      
_________________________________________________________________
activation_218 (Activation)  (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_218 (Dropout)        (None, 4, 4, 256)         0         
_________________________________________________________________
separable_conv2d_199 (Separa (None, 4, 4, 32)          10528     
_________________________________________________________________
batch_normalization_109 (Bat (None, 4, 4, 32)          128       
_________________________________________________________________
activation_219 (Activation)  (None, 4, 4, 32)          0         
_________________________________________________________________
dropout_219 (Dropout)        (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_200 (Separa (None, 4, 4, 64)          2400      
_________________________________________________________________
batch_normalization_110 (Bat (None, 4, 4, 64)          256       
_________________________________________________________________
activation_220 (Activation)  (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_220 (Dropout)        (None, 4, 4, 64)          0         
_________________________________________________________________
separable_conv2d_201 (Separa (None, 4, 4, 32)          2656      
_________________________________________________________________
activation_221 (Activation)  (None, 4, 4, 32)          0         
_________________________________________________________________
dropout_221 (Dropout)        (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_202 (Separa (None, 4, 4, 8)           552       
_________________________________________________________________
batch_normalization_111 (Bat (None, 4, 4, 8)           32        
_________________________________________________________________
activation_222 (Activation)  (None, 4, 4, 8)           0         
_________________________________________________________________
dropout_222 (Dropout)        (None, 4, 4, 8)           0         
_________________________________________________________________
separable_conv2d_203 (Separa (None, 4, 4, 1024)        9288      
_________________________________________________________________
batch_normalization_112 (Bat (None, 4, 4, 1024)        4096      
_________________________________________________________________
activation_223 (Activation)  (None, 4, 4, 1024)        0         
_________________________________________________________________
dropout_223 (Dropout)        (None, 4, 4, 1024)        0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_37 (Dense)             (None, 100)               1638500   
=================================================================
Total params: 1,719,471
Trainable params: 1,715,855
Non-trainable params: 3,616
_________________________________________________________________
