Model: "sequential_46"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_528 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_577 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_577 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_529 (Separa (None, 32, 32, 128)       4512      
_________________________________________________________________
batch_normalization_322 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_578 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_578 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_530 (Separa (None, 32, 32, 8)         2184      
_________________________________________________________________
activation_579 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_579 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_531 (Separa (None, 32, 32, 64)        648       
_________________________________________________________________
activation_580 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_580 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_127 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_532 (Separa (None, 16, 16, 8)         1096      
_________________________________________________________________
activation_581 (Activation)  (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_581 (Dropout)        (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_533 (Separa (None, 16, 16, 128)       1224      
_________________________________________________________________
batch_normalization_323 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_582 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_582 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_534 (Separa (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_324 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_583 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_583 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_535 (Separa (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_325 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_584 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_584 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_128 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_536 (Separa (None, 8, 8, 128)         70272     
_________________________________________________________________
activation_585 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_585 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_537 (Separa (None, 8, 8, 32)          5280      
_________________________________________________________________
batch_normalization_326 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_586 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_586 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_538 (Separa (None, 8, 8, 512)         17184     
_________________________________________________________________
batch_normalization_327 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_587 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_587 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
max_pooling2d_129 (MaxPoolin (None, 4, 4, 512)         0         
_________________________________________________________________
flatten_46 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_95 (Dense)             (None, 2048)              16779264  
_________________________________________________________________
batch_normalization_328 (Bat (None, 2048)              8192      
_________________________________________________________________
activation_588 (Activation)  (None, 2048)              0         
_________________________________________________________________
dropout_588 (Dropout)        (None, 2048)              0         
_________________________________________________________________
dense_96 (Dense)             (None, 100)               204900    
=================================================================
Total params: 17,143,679
Trainable params: 17,136,831
Non-trainable params: 6,848
_________________________________________________________________
