Model: "sequential_207"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2335 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_2545 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2545 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_2336 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_1500 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2546 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2546 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_2337 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_2547 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_2547 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_2338 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_2548 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_2548 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_607 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2339 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_2549 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2549 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2340 (Separ (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_1501 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2550 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2550 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_2341 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_1502 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_2551 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2551 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2342 (Separ (None, 16, 16, 32)        2656      
_________________________________________________________________
batch_normalization_1503 (Ba (None, 16, 16, 32)        128       
_________________________________________________________________
activation_2552 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_2552 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_2343 (Separ (None, 16, 16, 256)       8736      
_________________________________________________________________
batch_normalization_1504 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_2553 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_2553 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_608 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_207 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_417 (Dense)            (None, 2048)              33556480  
_________________________________________________________________
batch_normalization_1505 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_2554 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_2554 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_418 (Dense)            (None, 100)               204900    
=================================================================
Total params: 33,811,151
Trainable params: 33,805,583
Non-trainable params: 5,568
_________________________________________________________________
