Model: "sequential_197"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2229 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_2429 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2429 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_2230 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_1436 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2430 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2430 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_2231 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_2431 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_2431 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
max_pooling2d_578 (MaxPoolin (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_2232 (Separ (None, 16, 16, 64)        648       
_________________________________________________________________
activation_2432 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2432 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_579 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_2233 (Separ (None, 8, 8, 8)           1096      
_________________________________________________________________
activation_2433 (Activation) (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_2433 (Dropout)       (None, 8, 8, 8)           0         
_________________________________________________________________
separable_conv2d_2234 (Separ (None, 8, 8, 128)         1224      
_________________________________________________________________
batch_normalization_1437 (Ba (None, 8, 8, 128)         512       
_________________________________________________________________
activation_2434 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_2434 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_2235 (Separ (None, 8, 8, 64)          9408      
_________________________________________________________________
batch_normalization_1438 (Ba (None, 8, 8, 64)          256       
_________________________________________________________________
activation_2435 (Activation) (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_2435 (Dropout)       (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_2236 (Separ (None, 8, 8, 512)         33856     
_________________________________________________________________
batch_normalization_1439 (Ba (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_2436 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_2436 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
max_pooling2d_580 (MaxPoolin (None, 4, 4, 512)         0         
_________________________________________________________________
separable_conv2d_2237 (Separ (None, 4, 4, 128)         70272     
_________________________________________________________________
activation_2437 (Activation) (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_2437 (Dropout)       (None, 4, 4, 128)         0         
_________________________________________________________________
separable_conv2d_2238 (Separ (None, 4, 4, 32)          5280      
_________________________________________________________________
batch_normalization_1440 (Ba (None, 4, 4, 32)          128       
_________________________________________________________________
activation_2438 (Activation) (None, 4, 4, 32)          0         
_________________________________________________________________
dropout_2438 (Dropout)       (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_2239 (Separ (None, 4, 4, 256)         8736      
_________________________________________________________________
batch_normalization_1441 (Ba (None, 4, 4, 256)         1024      
_________________________________________________________________
activation_2439 (Activation) (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_2439 (Dropout)       (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_197 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_397 (Dense)            (None, 2048)              8390656   
_________________________________________________________________
batch_normalization_1442 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_2440 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_2440 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_398 (Dense)            (None, 100)               204900    
=================================================================
Total params: 8,752,511
Trainable params: 8,745,919
Non-trainable params: 6,592
_________________________________________________________________
