Model: "sequential_67"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_774 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_844 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_844 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_775 (Separa (None, 32, 32, 128)       4512      
_________________________________________________________________
batch_normalization_486 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_845 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_845 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_776 (Separa (None, 32, 32, 8)         2184      
_________________________________________________________________
activation_846 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_846 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_777 (Separa (None, 32, 32, 64)        648       
_________________________________________________________________
activation_847 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_847 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_190 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_778 (Separa (None, 16, 16, 8)         1096      
_________________________________________________________________
activation_848 (Activation)  (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_848 (Dropout)        (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_779 (Separa (None, 16, 16, 128)       1224      
_________________________________________________________________
batch_normalization_487 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_849 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_849 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_780 (Separa (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_488 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_850 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_850 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_781 (Separa (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_489 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_851 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_851 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_191 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_782 (Separa (None, 8, 8, 32)          21024     
_________________________________________________________________
batch_normalization_490 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_852 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_852 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
max_pooling2d_192 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_783 (Separa (None, 4, 4, 128)         4512      
_________________________________________________________________
activation_853 (Activation)  (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_853 (Dropout)        (None, 4, 4, 128)         0         
_________________________________________________________________
separable_conv2d_784 (Separa (None, 4, 4, 32)          5280      
_________________________________________________________________
batch_normalization_491 (Bat (None, 4, 4, 32)          128       
_________________________________________________________________
activation_854 (Activation)  (None, 4, 4, 32)          0         
_________________________________________________________________
dropout_854 (Dropout)        (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_785 (Separa (None, 4, 4, 256)         8736      
_________________________________________________________________
batch_normalization_492 (Bat (None, 4, 4, 256)         1024      
_________________________________________________________________
activation_855 (Activation)  (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_855 (Dropout)        (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_67 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_137 (Dense)            (None, 2048)              8390656   
_________________________________________________________________
batch_normalization_493 (Bat (None, 2048)              8192      
_________________________________________________________________
activation_856 (Activation)  (None, 2048)              0         
_________________________________________________________________
dropout_856 (Dropout)        (None, 2048)              0         
_________________________________________________________________
dense_138 (Dense)            (None, 100)               204900    
=================================================================
Total params: 8,700,991
Trainable params: 8,694,591
Non-trainable params: 6,400
_________________________________________________________________
