Model: "sequential_397"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_4205 (Separ (None, 32, 32, 128)       539       
_________________________________________________________________
activation_4605 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_4605 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_4206 (Separ (None, 32, 32, 256)       34176     
_________________________________________________________________
batch_normalization_2613 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_4606 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_4606 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_4207 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_4607 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_4607 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_4208 (Separ (None, 32, 32, 512)       4680      
_________________________________________________________________
activation_4608 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_4608 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_1081 (MaxPooli (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_4209 (Separ (None, 16, 16, 16)        12816     
_________________________________________________________________
activation_4609 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_4609 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_4210 (Separ (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_2614 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_4610 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_4610 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_4211 (Separ (None, 16, 16, 256)       34176     
_________________________________________________________________
batch_normalization_2615 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_4611 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_4611 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_4212 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
activation_4612 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_4612 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_4213 (Separ (None, 16, 16, 32)        5280      
_________________________________________________________________
activation_4613 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_4613 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_4214 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
batch_normalization_2616 (Ba (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_4614 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_4614 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_1082 (MaxPooli (None, 8, 8, 512)         0         
_________________________________________________________________
flatten_397 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_797 (Dense)            (None, 2048)              67110912  
_________________________________________________________________
batch_normalization_2617 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_4615 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_4615 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_798 (Dense)            (None, 100)               204900    
=================================================================
Total params: 67,479,343
Trainable params: 67,472,943
Non-trainable params: 6,400
_________________________________________________________________
