Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_157 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
batch_normalization_83 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
activation_173 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_173 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_158 (Separa (None, 32, 32, 1024)      34080     
_________________________________________________________________
batch_normalization_84 (Batc (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_174 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_174 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_159 (Separa (None, 32, 32, 256)       271616    
_________________________________________________________________
activation_175 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_175 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_160 (Separa (None, 32, 32, 16)        6416      
_________________________________________________________________
activation_176 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_176 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_161 (Separa (None, 32, 32, 256)       4496      
_________________________________________________________________
activation_177 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_177 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_162 (Separa (None, 16, 16, 16)        6416      
_________________________________________________________________
activation_178 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_178 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_163 (Separa (None, 16, 16, 64)        1232      
_________________________________________________________________
batch_normalization_85 (Batc (None, 16, 16, 64)        256       
_________________________________________________________________
activation_179 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_179 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_164 (Separa (None, 8, 8, 16)          1616      
_________________________________________________________________
activation_180 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_180 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 4, 4, 16)          0         
_________________________________________________________________
separable_conv2d_165 (Separa (None, 4, 4, 16)          416       
_________________________________________________________________
activation_181 (Activation)  (None, 4, 4, 16)          0         
_________________________________________________________________
dropout_181 (Dropout)        (None, 4, 4, 16)          0         
_________________________________________________________________
separable_conv2d_166 (Separa (None, 4, 4, 32)          688       
_________________________________________________________________
batch_normalization_86 (Batc (None, 4, 4, 32)          128       
_________________________________________________________________
activation_182 (Activation)  (None, 4, 4, 32)          0         
_________________________________________________________________
dropout_182 (Dropout)        (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_167 (Separa (None, 4, 4, 256)         8736      
_________________________________________________________________
batch_normalization_87 (Batc (None, 4, 4, 256)         1024      
_________________________________________________________________
activation_183 (Activation)  (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_183 (Dropout)        (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_30 (Dense)             (None, 16)                65552     
_________________________________________________________________
activation_184 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_184 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_31 (Dense)             (None, 100)               1700      
=================================================================
Total params: 408,751
Trainable params: 405,935
Non-trainable params: 2,816
_________________________________________________________________
