Model: "sequential_284"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_3144 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_3431 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3431 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_3145 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_2004 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_3432 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_3432 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_3146 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_3433 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_3433 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_3147 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_3434 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_3434 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_823 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3148 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_3435 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3435 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_3149 (Separ (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_2005 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_3436 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_3436 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_3150 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_2006 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3437 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3437 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3151 (Separ (None, 16, 16, 64)        4736      
_________________________________________________________________
batch_normalization_2007 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3438 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3438 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3152 (Separ (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_2008 (Ba (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_3439 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_3439 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_824 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
flatten_284 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_571 (Dense)            (None, 2048)              67110912  
_________________________________________________________________
batch_normalization_2009 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_3440 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_3440 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_572 (Dense)            (None, 100)               204900    
=================================================================
Total params: 67,393,935
Trainable params: 67,387,791
Non-trainable params: 6,144
_________________________________________________________________
