Model: "sequential_272"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_3022 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_3297 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3297 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_3023 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_1927 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_3298 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_3298 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_3024 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_3299 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_3299 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_3025 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_3300 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_3300 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_790 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3026 (Separ (None, 16, 16, 256)       17216     
_________________________________________________________________
batch_normalization_1928 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_3301 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_3301 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_3027 (Separ (None, 16, 16, 64)        18752     
_________________________________________________________________
batch_normalization_1929 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3302 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3302 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3028 (Separ (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_1930 (Ba (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_3303 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_3303 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_791 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_3029 (Separ (None, 8, 8, 128)         70272     
_________________________________________________________________
activation_3304 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_3304 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_3030 (Separ (None, 8, 8, 256)         34176     
_________________________________________________________________
batch_normalization_1931 (Ba (None, 8, 8, 256)         1024      
_________________________________________________________________
activation_3305 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_3305 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
max_pooling2d_792 (MaxPoolin (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_272 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_547 (Dense)            (None, 2048)              8390656   
_________________________________________________________________
batch_normalization_1932 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_3306 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_3306 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_548 (Dense)            (None, 100)               204900    
=================================================================
Total params: 8,797,295
Trainable params: 8,790,511
Non-trainable params: 6,784
_________________________________________________________________
