Model: "sequential_125"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1442 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1570 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1570 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1443 (Separ (None, 32, 32, 128)       4512      
_________________________________________________________________
batch_normalization_936 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1571 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1571 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1444 (Separ (None, 32, 32, 8)         2184      
_________________________________________________________________
activation_1572 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_1572 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_1445 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_1573 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1573 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_364 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1446 (Separ (None, 16, 16, 8)         1096      
_________________________________________________________________
activation_1574 (Activation) (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_1574 (Dropout)       (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_1447 (Separ (None, 16, 16, 128)       1224      
_________________________________________________________________
batch_normalization_937 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1575 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1575 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1448 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_938 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1576 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1576 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1449 (Separ (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_939 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_1577 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1577 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_365 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1450 (Separ (None, 8, 8, 128)         70272     
_________________________________________________________________
activation_1578 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_1578 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_1451 (Separ (None, 8, 8, 32)          5280      
_________________________________________________________________
batch_normalization_940 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1579 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1579 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1452 (Separ (None, 8, 8, 256)         8736      
_________________________________________________________________
batch_normalization_941 (Bat (None, 8, 8, 256)         1024      
_________________________________________________________________
activation_1580 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1580 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
max_pooling2d_366 (MaxPoolin (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_125 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_253 (Dense)            (None, 2048)              8390656   
_________________________________________________________________
batch_normalization_942 (Bat (None, 2048)              8192      
_________________________________________________________________
activation_1581 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_1581 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_254 (Dense)            (None, 100)               204900    
=================================================================
Total params: 8,745,599
Trainable params: 8,739,263
Non-trainable params: 6,336
_________________________________________________________________
