Model: "sequential_333"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_3617 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_3953 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3953 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_3618 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_2283 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_3954 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_3954 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_3619 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_3955 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_3955 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_3620 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_3956 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_3956 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_938 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3621 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_3957 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3957 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_3622 (Separ (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_2284 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_3958 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_3958 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_3623 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_2285 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3959 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3959 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3624 (Separ (None, 16, 16, 128)       8896      
_________________________________________________________________
activation_3960 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_3960 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_3625 (Separ (None, 16, 16, 32)        5280      
_________________________________________________________________
activation_3961 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_3961 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_3626 (Separ (None, 16, 16, 256)       8736      
_________________________________________________________________
batch_normalization_2286 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_3962 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_3962 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_939 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_333 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_669 (Dense)            (None, 2048)              33556480  
_________________________________________________________________
batch_normalization_2287 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_3963 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_3963 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_670 (Dense)            (None, 100)               204900    
=================================================================
Total params: 33,822,543
Trainable params: 33,817,039
Non-trainable params: 5,504
_________________________________________________________________
