Model: "sequential_109"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1263 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_1375 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1375 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1264 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_814 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1376 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1376 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_1265 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_1377 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_1377 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_1266 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_1378 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1378 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_316 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1267 (Separ (None, 16, 16, 8)         1096      
_________________________________________________________________
activation_1379 (Activation) (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_1379 (Dropout)       (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_1268 (Separ (None, 16, 16, 128)       1224      
_________________________________________________________________
batch_normalization_815 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1380 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1380 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1269 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_816 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1381 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1381 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1270 (Separ (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_817 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_1382 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1382 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_317 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1271 (Separ (None, 8, 8, 32)          21024     
_________________________________________________________________
batch_normalization_818 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1383 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1383 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1272 (Separ (None, 8, 8, 32)          1344      
_________________________________________________________________
batch_normalization_819 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1384 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1384 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1273 (Separ (None, 8, 8, 512)         17184     
_________________________________________________________________
batch_normalization_820 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_1385 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1385 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
max_pooling2d_318 (MaxPoolin (None, 4, 4, 512)         0         
_________________________________________________________________
flatten_109 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_221 (Dense)            (None, 2048)              16779264  
_________________________________________________________________
batch_normalization_821 (Bat (None, 2048)              8192      
_________________________________________________________________
activation_1386 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_1386 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_222 (Dense)            (None, 100)               204900    
=================================================================
Total params: 17,097,535
Trainable params: 17,090,367
Non-trainable params: 7,168
_________________________________________________________________
