Model: "sequential_43"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_495 (Separa (None, 32, 32, 32)        155       
_________________________________________________________________
activation_541 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_541 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_496 (Separa (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_301 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_542 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_542 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_497 (Separa (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_543 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_543 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_498 (Separa (None, 32, 32, 64)        648       
_________________________________________________________________
activation_544 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_544 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_118 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_499 (Separa (None, 16, 16, 8)         1096      
_________________________________________________________________
activation_545 (Activation)  (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_545 (Dropout)        (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_500 (Separa (None, 16, 16, 128)       1224      
_________________________________________________________________
batch_normalization_302 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_546 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_546 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_501 (Separa (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_303 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_547 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_547 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_502 (Separa (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_304 (Bat (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_548 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_548 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_119 (MaxPoolin (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_503 (Separa (None, 8, 8, 32)          21024     
_________________________________________________________________
batch_normalization_305 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_549 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_549 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
max_pooling2d_120 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_504 (Separa (None, 4, 4, 32)          1344      
_________________________________________________________________
batch_normalization_306 (Bat (None, 4, 4, 32)          128       
_________________________________________________________________
activation_550 (Activation)  (None, 4, 4, 32)          0         
_________________________________________________________________
dropout_550 (Dropout)        (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_505 (Separa (None, 4, 4, 256)         8736      
_________________________________________________________________
batch_normalization_307 (Bat (None, 4, 4, 256)         1024      
_________________________________________________________________
activation_551 (Activation)  (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_551 (Dropout)        (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_43 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_89 (Dense)             (None, 2048)              8390656   
_________________________________________________________________
batch_normalization_308 (Bat (None, 2048)              8192      
_________________________________________________________________
activation_552 (Activation)  (None, 2048)              0         
_________________________________________________________________
dropout_552 (Dropout)        (None, 2048)              0         
_________________________________________________________________
dense_90 (Dense)             (None, 100)               204900    
=================================================================
Total params: 8,699,455
Trainable params: 8,692,799
Non-trainable params: 6,656
_________________________________________________________________
