Model: "sequential_311"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_3406 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_3720 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3720 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_3407 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_2162 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_3721 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_3721 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_3408 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_3722 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_3722 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_3409 (Separ (None, 32, 32, 32)        360       
_________________________________________________________________
activation_3723 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3723 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_888 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_3410 (Separ (None, 16, 16, 16)        816       
_________________________________________________________________
activation_3724 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3724 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_3411 (Separ (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_2163 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_3725 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_3725 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_3412 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_2164 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3726 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3726 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3413 (Separ (None, 16, 16, 128)       8896      
_________________________________________________________________
activation_3727 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_3727 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_3414 (Separ (None, 16, 16, 32)        5280      
_________________________________________________________________
activation_3728 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_3728 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_3415 (Separ (None, 16, 16, 256)       8736      
_________________________________________________________________
batch_normalization_2165 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_3729 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_3729 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_889 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_311 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_625 (Dense)            (None, 2048)              33556480  
_________________________________________________________________
batch_normalization_2166 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_3730 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_3730 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_626 (Dense)            (None, 100)               204900    
=================================================================
Total params: 33,821,455
Trainable params: 33,815,951
Non-trainable params: 5,504
_________________________________________________________________
