Model: "sequential_375"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_4008 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_4386 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_4386 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_4009 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_2503 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_4387 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_4387 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_4010 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
batch_normalization_2504 (Ba (None, 32, 32, 8)         32        
_________________________________________________________________
activation_4388 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_4388 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_4011 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_4389 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_4389 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_1034 (MaxPooli (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_4012 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_4390 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_4390 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_4013 (Separ (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_2505 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_4391 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_4391 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_4014 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_2506 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_4392 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_4392 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_4015 (Separ (None, 16, 16, 32)        2656      
_________________________________________________________________
activation_4393 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_4393 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_4016 (Separ (None, 16, 16, 256)       8736      
_________________________________________________________________
batch_normalization_2507 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_4394 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_4394 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_1035 (MaxPooli (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_375 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_753 (Dense)            (None, 2048)              33556480  
_________________________________________________________________
batch_normalization_2508 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_4395 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_4395 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_754 (Dense)            (None, 100)               204900    
=================================================================
Total params: 33,811,055
Trainable params: 33,805,535
Non-trainable params: 5,520
_________________________________________________________________
