Model: "sequential_273"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_3031 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_3307 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3307 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_3032 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_1933 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_3308 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_3308 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_3033 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_3309 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_3309 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_3034 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_3310 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_3310 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_793 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3035 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_3311 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3311 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_3036 (Separ (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_1934 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_3312 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_3312 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_3037 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_1935 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3313 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3313 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3038 (Separ (None, 16, 16, 128)       8896      
_________________________________________________________________
activation_3314 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_3314 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_3039 (Separ (None, 16, 16, 32)        5280      
_________________________________________________________________
batch_normalization_1936 (Ba (None, 16, 16, 32)        128       
_________________________________________________________________
activation_3315 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_3315 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_3040 (Separ (None, 16, 16, 8)         552       
_________________________________________________________________
batch_normalization_1937 (Ba (None, 16, 16, 8)         32        
_________________________________________________________________
activation_3316 (Activation) (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_3316 (Dropout)       (None, 16, 16, 8)         0         
_________________________________________________________________
max_pooling2d_794 (MaxPoolin (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_273 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_549 (Dense)            (None, 2048)              1050624   
_________________________________________________________________
batch_normalization_1938 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_3317 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_3317 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_550 (Dense)            (None, 100)               204900    
=================================================================
Total params: 1,307,639
Trainable params: 1,302,567
Non-trainable params: 5,072
_________________________________________________________________
