Model: "sequential_342"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_3703 (Separ (None, 32, 32, 32)        155       
_________________________________________________________________
activation_4048 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_4048 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_3704 (Separ (None, 32, 32, 256)       8736      
_________________________________________________________________
batch_normalization_2329 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_4049 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_4049 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_3705 (Separ (None, 32, 32, 8)         4360      
_________________________________________________________________
activation_4050 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_4050 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_3706 (Separ (None, 32, 32, 64)        648       
_________________________________________________________________
activation_4051 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_4051 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_959 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3707 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_4052 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_4052 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_3708 (Separ (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_2330 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_4053 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_4053 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_3709 (Separ (None, 16, 16, 128)       17664     
_________________________________________________________________
batch_normalization_2331 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_4054 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_4054 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_3710 (Separ (None, 16, 16, 32)        5280      
_________________________________________________________________
activation_4055 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_4055 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_3711 (Separ (None, 16, 16, 256)       8736      
_________________________________________________________________
batch_normalization_2332 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_4056 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_4056 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_960 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_342 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_687 (Dense)            (None, 2048)              33556480  
_________________________________________________________________
batch_normalization_2333 (Ba (None, 2048)              8192      
_________________________________________________________________
activation_4057 (Activation) (None, 2048)              0         
_________________________________________________________________
dropout_4057 (Dropout)       (None, 2048)              0         
_________________________________________________________________
dense_688 (Dense)            (None, 100)               204900    
=================================================================
Total params: 33,822,159
Trainable params: 33,816,527
Non-trainable params: 5,632
_________________________________________________________________
