Model: "sequential_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_53 (Separab (None, 32, 32, 64)        283       
_________________________________________________________________
activation_70 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_70 (Dropout)         (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_54 (Separab (None, 32, 32, 32)        2656      
_________________________________________________________________
activation_71 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_71 (Dropout)         (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_55 (Separab (None, 32, 32, 32)        1344      
_________________________________________________________________
batch_normalization_38 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
activation_72 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_72 (Dropout)         (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_56 (Separab (None, 16, 16, 64)        2400      
_________________________________________________________________
activation_73 (Activation)   (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_73 (Dropout)         (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_57 (Separab (None, 16, 16, 256)       17216     
_________________________________________________________________
batch_normalization_39 (Batc (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_74 (Activation)   (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_74 (Dropout)         (None, 16, 16, 256)       0         
_________________________________________________________________
flatten_19 (Flatten)         (None, 65536)             0         
_________________________________________________________________
dense_36 (Dense)             (None, 2048)              134219776 
_________________________________________________________________
batch_normalization_40 (Batc (None, 2048)              8192      
_________________________________________________________________
activation_75 (Activation)   (None, 2048)              0         
_________________________________________________________________
dropout_75 (Dropout)         (None, 2048)              0         
_________________________________________________________________
dense_37 (Dense)             (None, 100)               204900    
=================================================================
Total params: 134,457,919
Trainable params: 134,453,247
Non-trainable params: 4,672
_________________________________________________________________
