Model: "sequential_550"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1495 (Separ (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_1584 (Ba (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_2161 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_2161 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_1496 (Separ (None, 32, 32, 32)        21024     
_________________________________________________________________
batch_normalization_1585 (Ba (None, 32, 32, 32)        128       
_________________________________________________________________
activation_2162 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2162 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1497 (Separ (None, 32, 32, 16)        816       
_________________________________________________________________
activation_2163 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2163 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
flatten_550 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_1216 (Dense)           (None, 512)               8389120   
_________________________________________________________________
batch_normalization_1586 (Ba (None, 512)               2048      
_________________________________________________________________
activation_2164 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_2164 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_1217 (Dense)           (None, 256)               131328    
_________________________________________________________________
batch_normalization_1587 (Ba (None, 256)               1024      
_________________________________________________________________
activation_2165 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_2165 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_1218 (Dense)           (None, 100)               25700     
=================================================================
Total params: 8,575,311
Trainable params: 8,572,687
Non-trainable params: 2,624
_________________________________________________________________
