Model: "sequential_184"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_452 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_469 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_625 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_625 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_164 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_453 (Separa (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_470 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_626 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_626 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_184 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_357 (Dense)            (None, 128)               4194432   
_________________________________________________________________
batch_normalization_471 (Bat (None, 128)               512       
_________________________________________________________________
activation_627 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_627 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_358 (Dense)            (None, 100)               12900     
=================================================================
Total params: 4,245,631
Trainable params: 4,244,607
Non-trainable params: 1,024
_________________________________________________________________
