Model: "sequential_370"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_969 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
activation_1349 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1349 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_388 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_970 (Separa (None, 16, 16, 128)       35200     
_________________________________________________________________
activation_1350 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1350 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_971 (Separa (None, 16, 16, 64)        9408      
_________________________________________________________________
activation_1351 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1351 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
flatten_370 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_750 (Dense)            (None, 100)               1638500   
=================================================================
Total params: 1,684,159
Trainable params: 1,684,159
Non-trainable params: 0
_________________________________________________________________
