Model: "sequential_537"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1456 (Separ (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_1540 (Ba (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_2099 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_2099 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_572 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1457 (Separ (None, 16, 16, 64)        37440     
_________________________________________________________________
batch_normalization_1541 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_2100 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2100 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_573 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1458 (Separ (None, 8, 8, 16)          1616      
_________________________________________________________________
activation_2101 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_2101 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_537 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_1180 (Dense)           (None, 32)                32800     
_________________________________________________________________
batch_normalization_1542 (Ba (None, 32)                128       
_________________________________________________________________
activation_2102 (Activation) (None, 32)                0         
_________________________________________________________________
dropout_2102 (Dropout)       (None, 32)                0         
_________________________________________________________________
dense_1181 (Dense)           (None, 128)               4224      
_________________________________________________________________
batch_normalization_1543 (Ba (None, 128)               512       
_________________________________________________________________
activation_2103 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_2103 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_1182 (Dense)           (None, 100)               12900     
=================================================================
Total params: 93,999
Trainable params: 92,527
Non-trainable params: 1,472
_________________________________________________________________
