Model: "sequential_456"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1220 (Separ (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_1277 (Ba (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1728 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1728 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_487 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1221 (Separ (None, 16, 16, 64)        37440     
_________________________________________________________________
activation_1729 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1729 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1222 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_1730 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1730 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_456 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_964 (Dense)            (None, 512)               2097664   
_________________________________________________________________
batch_normalization_1278 (Ba (None, 512)               2048      
_________________________________________________________________
activation_1731 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1731 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_965 (Dense)            (None, 256)               131328    
_________________________________________________________________
batch_normalization_1279 (Ba (None, 256)               1024      
_________________________________________________________________
activation_1732 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1732 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_966 (Dense)            (None, 100)               25700     
=================================================================
Total params: 2,300,943
Trainable params: 2,298,383
Non-trainable params: 2,560
_________________________________________________________________
