Model: "sequential_343"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_894 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_952 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1246 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1246 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_356 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_895 (Separa (None, 16, 16, 64)        37440     
_________________________________________________________________
activation_1247 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1247 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_357 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_896 (Separa (None, 8, 8, 16)          1616      
_________________________________________________________________
activation_1248 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1248 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_343 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_695 (Dense)            (None, 512)               524800    
_________________________________________________________________
batch_normalization_953 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1249 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1249 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_696 (Dense)            (None, 256)               131328    
_________________________________________________________________
batch_normalization_954 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1250 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1250 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_697 (Dense)            (None, 100)               25700     
=================================================================
Total params: 728,079
Trainable params: 725,519
Non-trainable params: 2,560
_________________________________________________________________
