Model: "sequential_502"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1353 (Separ (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_1427 (Ba (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1941 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1941 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_537 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1354 (Separ (None, 16, 16, 64)        37440     
_________________________________________________________________
batch_normalization_1428 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1942 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1942 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_538 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1355 (Separ (None, 8, 8, 16)          1616      
_________________________________________________________________
activation_1943 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1943 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_502 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_1090 (Dense)           (None, 512)               524800    
_________________________________________________________________
batch_normalization_1429 (Ba (None, 512)               2048      
_________________________________________________________________
activation_1944 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1944 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_1091 (Dense)           (None, 256)               131328    
_________________________________________________________________
activation_1945 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1945 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_1092 (Dense)           (None, 100)               25700     
=================================================================
Total params: 727,311
Trainable params: 725,135
Non-trainable params: 2,176
_________________________________________________________________
