Model: "sequential_493"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1326 (Separ (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_1391 (Ba (None, 32, 32, 64)        256       
_________________________________________________________________
activation_1898 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1898 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_1327 (Separ (None, 32, 32, 128)       8896      
_________________________________________________________________
batch_normalization_1392 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1899 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1899 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_525 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1328 (Separ (None, 16, 16, 1024)      133248    
_________________________________________________________________
activation_1900 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1900 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
max_pooling2d_526 (MaxPoolin (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_493 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_1065 (Dense)           (None, 512)               33554944  
_________________________________________________________________
batch_normalization_1393 (Ba (None, 512)               2048      
_________________________________________________________________
activation_1901 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1901 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_1066 (Dense)           (None, 16)                8208      
_________________________________________________________________
batch_normalization_1394 (Ba (None, 16)                64        
_________________________________________________________________
activation_1902 (Activation) (None, 16)                0         
_________________________________________________________________
dropout_1902 (Dropout)       (None, 16)                0         
_________________________________________________________________
dense_1067 (Dense)           (None, 100)               1700      
=================================================================
Total params: 33,710,159
Trainable params: 33,708,719
Non-trainable params: 1,440
_________________________________________________________________
