Model: "sequential_298"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_765 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_825 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1071 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1071 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_299 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_766 (Separa (None, 16, 16, 128)       70272     
_________________________________________________________________
batch_normalization_826 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1072 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1072 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_298 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_604 (Dense)            (None, 128)               4194432   
_________________________________________________________________
batch_normalization_827 (Bat (None, 128)               512       
_________________________________________________________________
activation_1073 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1073 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_605 (Dense)            (None, 256)               33024     
_________________________________________________________________
batch_normalization_828 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1074 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1074 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_606 (Dense)            (None, 100)               25700     
=================================================================
Total params: 4,329,599
Trainable params: 4,327,551
Non-trainable params: 2,048
_________________________________________________________________
