Model: "sequential_293"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_750 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_810 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1050 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1050 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_751 (Separa (None, 32, 32, 64)        18752     
_________________________________________________________________
batch_normalization_811 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_1051 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1051 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_293 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_752 (Separa (None, 16, 16, 64)        4736      
_________________________________________________________________
activation_1052 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1052 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
flatten_293 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_593 (Dense)            (None, 512)               8389120   
_________________________________________________________________
activation_1053 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1053 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_594 (Dense)            (None, 100)               51300     
=================================================================
Total params: 8,466,239
Trainable params: 8,465,599
Non-trainable params: 640
_________________________________________________________________
