Model: "sequential_352"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_920 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_980 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1284 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1284 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_365 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_921 (Separa (None, 16, 16, 128)       70272     
_________________________________________________________________
batch_normalization_981 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1285 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1285 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_352 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_716 (Dense)            (None, 100)               3276900   
=================================================================
Total params: 3,351,807
Trainable params: 3,350,527
Non-trainable params: 1,280
_________________________________________________________________
