Model: "sequential_469"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1259 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_1321 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1792 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1792 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_501 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_1260 (Separ (None, 16, 16, 64)        18752     
_________________________________________________________________
activation_1793 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1793 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_502 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1261 (Separ (None, 8, 8, 256)         17216     
_________________________________________________________________
activation_1794 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1794 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_469 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_1002 (Dense)           (None, 256)               4194560   
_________________________________________________________________
batch_normalization_1322 (Ba (None, 256)               1024      
_________________________________________________________________
activation_1795 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1795 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_1003 (Dense)           (None, 100)               25700     
=================================================================
Total params: 4,259,327
Trainable params: 4,258,303
Non-trainable params: 1,024
_________________________________________________________________
