Model: "sequential_312"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_806 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_862 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1124 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1124 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_807 (Separa (None, 32, 32, 64)        37440     
_________________________________________________________________
batch_normalization_863 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_1125 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1125 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_317 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_808 (Separa (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_1126 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1126 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_312 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_630 (Dense)            (None, 512)               2097664   
_________________________________________________________________
batch_normalization_864 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1127 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1127 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_631 (Dense)            (None, 100)               51300     
=================================================================
Total params: 2,194,447
Trainable params: 2,192,271
Non-trainable params: 2,176
_________________________________________________________________
