Model: "sequential_323"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_837 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_895 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1166 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1166 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_329 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_838 (Separa (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_896 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1167 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1167 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_839 (Separa (None, 16, 16, 16)        3216      
_________________________________________________________________
activation_1168 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1168 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_323 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_652 (Dense)            (None, 100)               409700    
=================================================================
Total params: 450,703
Trainable params: 449,935
Non-trainable params: 768
_________________________________________________________________
