Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_19 (Separab (None, 32, 32, 512)       2075      
_________________________________________________________________
activation_27 (Activation)   (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_20 (Separab (None, 32, 32, 512)       267264    
_________________________________________________________________
batch_normalization_20 (Batc (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_28 (Activation)   (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 16, 16, 512)       0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 131072)            0         
_________________________________________________________________
dense_16 (Dense)             (None, 128)               16777344  
_________________________________________________________________
batch_normalization_21 (Batc (None, 128)               512       
_________________________________________________________________
activation_29 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 512)               66048     
_________________________________________________________________
batch_normalization_22 (Batc (None, 512)               2048      
_________________________________________________________________
activation_30 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_30 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 100)               51300     
=================================================================
Total params: 17,168,639
Trainable params: 17,166,335
Non-trainable params: 2,304
_________________________________________________________________
