Model: "sequential_140"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_332 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_337 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_456 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_456 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_333 (Separa (None, 32, 32, 64)        18752     
_________________________________________________________________
activation_457 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_457 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_114 (MaxPoolin (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_334 (Separa (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_458 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_458 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_140 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_264 (Dense)            (None, 100)               409700    
=================================================================
Total params: 432,143
Trainable params: 431,631
Non-trainable params: 512
_________________________________________________________________
