Model: "sequential_191"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_467 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_490 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_648 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_648 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_171 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_468 (Separa (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_491 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_649 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_649 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_191 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_372 (Dense)            (None, 128)               4194432   
_________________________________________________________________
batch_normalization_492 (Bat (None, 128)               512       
_________________________________________________________________
activation_650 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_650 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_373 (Dense)            (None, 100)               12900     
=================================================================
Total params: 4,245,631
Trainable params: 4,244,607
Non-trainable params: 1,024
_________________________________________________________________
