Model: "sequential_417"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1105 (Separ (None, 32, 32, 512)       2075      
_________________________________________________________________
activation_1550 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1550 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_445 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1106 (Separ (None, 16, 16, 128)       70272     
_________________________________________________________________
batch_normalization_1159 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1551 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1551 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1107 (Separ (None, 16, 16, 16)        3216      
_________________________________________________________________
activation_1552 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1552 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_417 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_862 (Dense)            (None, 512)               2097664   
_________________________________________________________________
batch_normalization_1160 (Ba (None, 512)               2048      
_________________________________________________________________
activation_1553 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1553 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_863 (Dense)            (None, 16)                8208      
_________________________________________________________________
batch_normalization_1161 (Ba (None, 16)                64        
_________________________________________________________________
activation_1554 (Activation) (None, 16)                0         
_________________________________________________________________
dropout_1554 (Dropout)       (None, 16)                0         
_________________________________________________________________
dense_864 (Dense)            (None, 100)               1700      
=================================================================
Total params: 2,185,759
Trainable params: 2,184,447
Non-trainable params: 1,312
_________________________________________________________________
