Model: "sequential_78"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_181 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_165 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_247 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_247 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_182 (Separa (None, 32, 32, 128)       35200     
_________________________________________________________________
batch_normalization_166 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_248 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_248 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_183 (Separa (None, 32, 32, 64)        9408      
_________________________________________________________________
batch_normalization_167 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_249 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_249 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
flatten_78 (Flatten)         (None, 65536)             0         
_________________________________________________________________
dense_144 (Dense)            (None, 100)               6553700   
=================================================================
Total params: 6,601,151
Trainable params: 6,600,255
Non-trainable params: 896
_________________________________________________________________
