Model: "sequential_376"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_987 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_1036 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1372 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1372 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_396 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_988 (Separa (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1037 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1373 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1373 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_989 (Separa (None, 16, 16, 64)        9408      
_________________________________________________________________
activation_1374 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1374 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
flatten_376 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_761 (Dense)            (None, 100)               1638500   
=================================================================
Total params: 1,685,695
Trainable params: 1,684,927
Non-trainable params: 768
_________________________________________________________________
