Model: "sequential_440"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1173 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_1227 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1656 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1656 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_471 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_1174 (Separ (None, 16, 16, 64)        18752     
_________________________________________________________________
activation_1657 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1657 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_472 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1175 (Separ (None, 8, 8, 256)         17216     
_________________________________________________________________
activation_1658 (Activation) (None, 8, 8, 256)         0         
_________________________________________________________________
dropout_1658 (Dropout)       (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_440 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_923 (Dense)            (None, 512)               8389120   
_________________________________________________________________
batch_normalization_1228 (Ba (None, 512)               2048      
_________________________________________________________________
activation_1659 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1659 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_924 (Dense)            (None, 16)                8208      
_________________________________________________________________
batch_normalization_1229 (Ba (None, 16)                64        
_________________________________________________________________
activation_1660 (Activation) (None, 16)                0         
_________________________________________________________________
dropout_1660 (Dropout)       (None, 16)                0         
_________________________________________________________________
dense_925 (Dense)            (None, 100)               1700      
=================================================================
Total params: 8,439,183
Trainable params: 8,437,615
Non-trainable params: 1,568
_________________________________________________________________
