Model: "sequential_452"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1208 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_1266 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1711 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1711 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_1209 (Separ (None, 32, 32, 32)        10528     
_________________________________________________________________
batch_normalization_1267 (Ba (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1712 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1712 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1210 (Separ (None, 32, 32, 16)        816       
_________________________________________________________________
activation_1713 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1713 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
flatten_452 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_955 (Dense)            (None, 256)               4194560   
_________________________________________________________________
batch_normalization_1268 (Ba (None, 256)               1024      
_________________________________________________________________
activation_1714 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1714 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_956 (Dense)            (None, 100)               25700     
=================================================================
Total params: 4,234,831
Trainable params: 4,233,743
Non-trainable params: 1,088
_________________________________________________________________
