Model: "sequential_233"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_584 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_622 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_814 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_814 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_222 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_585 (Separa (None, 16, 16, 128)       70272     
_________________________________________________________________
batch_normalization_623 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_815 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_815 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_233 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_463 (Dense)            (None, 128)               4194432   
_________________________________________________________________
batch_normalization_624 (Bat (None, 128)               512       
_________________________________________________________________
activation_816 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_816 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_464 (Dense)            (None, 100)               12900     
=================================================================
Total params: 4,282,751
Trainable params: 4,281,215
Non-trainable params: 1,536
_________________________________________________________________
