Model: "sequential_318"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_822 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_882 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1148 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1148 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_324 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_823 (Separa (None, 16, 16, 8)         4360      
_________________________________________________________________
batch_normalization_883 (Bat (None, 16, 16, 8)         32        
_________________________________________________________________
activation_1149 (Activation) (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_1149 (Dropout)       (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_824 (Separa (None, 16, 16, 16)        216       
_________________________________________________________________
activation_1150 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1150 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_318 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_644 (Dense)            (None, 100)               409700    
=================================================================
Total params: 416,383
Trainable params: 415,855
Non-trainable params: 528
_________________________________________________________________
