Model: "sequential_566"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1543 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_1641 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2234 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2234 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_596 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_1544 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1642 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2235 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2235 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1545 (Separ (None, 16, 16, 16)        3216      
_________________________________________________________________
activation_2236 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2236 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_566 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_1257 (Dense)           (None, 128)               524416    
_________________________________________________________________
batch_normalization_1643 (Ba (None, 128)               512       
_________________________________________________________________
activation_2237 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_2237 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_1258 (Dense)           (None, 100)               12900     
=================================================================
Total params: 578,831
Trainable params: 577,807
Non-trainable params: 1,024
_________________________________________________________________
