Model: "sequential_98"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_230 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_218 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_311 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_311 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_73 (MaxPooling (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_231 (Separa (None, 16, 16, 128)       35200     
_________________________________________________________________
activation_312 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_312 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_98 (Flatten)         (None, 32768)             0         
_________________________________________________________________
dense_179 (Dense)            (None, 100)               3276900   
=================================================================
Total params: 3,314,175
Trainable params: 3,313,663
Non-trainable params: 512
_________________________________________________________________
