Model: "sequential_360"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_942 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_997 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1312 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1312 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_375 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_943 (Separa (None, 16, 16, 64)        37440     
_________________________________________________________________
activation_1313 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1313 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_376 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_944 (Separa (None, 8, 8, 16)          1616      
_________________________________________________________________
activation_1314 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1314 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_360 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_730 (Dense)            (None, 512)               524800    
_________________________________________________________________
batch_normalization_998 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1315 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1315 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_731 (Dense)            (None, 256)               131328    
_________________________________________________________________
batch_normalization_999 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1316 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1316 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_732 (Dense)            (None, 100)               25700     
=================================================================
Total params: 728,079
Trainable params: 725,519
Non-trainable params: 2,560
_________________________________________________________________
