Model: "sequential_75"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_177 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_161 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_240 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_240 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_56 (MaxPooling (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_178 (Separa (None, 16, 16, 128)       35200     
_________________________________________________________________
activation_241 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_241 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_75 (Flatten)         (None, 32768)             0         
_________________________________________________________________
dense_138 (Dense)            (None, 256)               8388864   
_________________________________________________________________
batch_normalization_162 (Bat (None, 256)               1024      
_________________________________________________________________
activation_242 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_242 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_139 (Dense)            (None, 100)               25700     
=================================================================
Total params: 8,452,863
Trainable params: 8,451,839
Non-trainable params: 1,024
_________________________________________________________________
