Model: "sequential_432"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1150 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_1201 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1618 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1618 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_461 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_1151 (Separ (None, 16, 16, 64)        18752     
_________________________________________________________________
activation_1619 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1619 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_462 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1152 (Separ (None, 8, 8, 16)          1616      
_________________________________________________________________
activation_1620 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1620 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_432 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_900 (Dense)            (None, 512)               524800    
_________________________________________________________________
batch_normalization_1202 (Ba (None, 512)               2048      
_________________________________________________________________
activation_1621 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1621 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_901 (Dense)            (None, 16)                8208      
_________________________________________________________________
batch_normalization_1203 (Ba (None, 16)                64        
_________________________________________________________________
activation_1622 (Activation) (None, 16)                0         
_________________________________________________________________
dropout_1622 (Dropout)       (None, 16)                0         
_________________________________________________________________
dense_902 (Dense)            (None, 100)               1700      
=================================================================
Total params: 559,263
Trainable params: 557,695
Non-trainable params: 1,568
_________________________________________________________________
