Model: "sequential_284"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_724 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_785 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1015 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1015 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_282 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_725 (Separa (None, 16, 16, 8)         4360      
_________________________________________________________________
batch_normalization_786 (Bat (None, 16, 16, 8)         32        
_________________________________________________________________
activation_1016 (Activation) (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_1016 (Dropout)       (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_726 (Separa (None, 16, 16, 16)        216       
_________________________________________________________________
activation_1017 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1017 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_284 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_575 (Dense)            (None, 128)               524416    
_________________________________________________________________
batch_normalization_787 (Bat (None, 128)               512       
_________________________________________________________________
activation_1018 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1018 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_576 (Dense)            (None, 100)               12900     
=================================================================
Total params: 544,511
Trainable params: 543,727
Non-trainable params: 784
_________________________________________________________________
