Model: "sequential_151"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_362 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_368 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_497 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_497 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_363 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
batch_normalization_369 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_498 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_498 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_127 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_364 (Separa (None, 16, 16, 16)        816       
_________________________________________________________________
activation_499 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_499 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_151 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_286 (Dense)            (None, 128)               524416    
_________________________________________________________________
batch_normalization_370 (Bat (None, 128)               512       
_________________________________________________________________
activation_500 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_500 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_287 (Dense)            (None, 100)               12900     
=================================================================
Total params: 563,919
Trainable params: 562,575
Non-trainable params: 1,344
_________________________________________________________________
