Model: "sequential_46"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_114 (Separa (None, 32, 32, 8)         59        
_________________________________________________________________
batch_normalization_94 (Batc (None, 32, 32, 8)         32        
_________________________________________________________________
activation_156 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_156 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_115 (Separa (None, 32, 32, 64)        648       
_________________________________________________________________
batch_normalization_95 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
activation_157 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_157 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
flatten_46 (Flatten)         (None, 65536)             0         
_________________________________________________________________
dense_88 (Dense)             (None, 100)               6553700   
=================================================================
Total params: 6,554,695
Trainable params: 6,554,551
Non-trainable params: 144
_________________________________________________________________
