Model: "sequential_465"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1247 (Separ (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_1309 (Ba (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1772 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1772 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_496 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1248 (Separ (None, 16, 16, 64)        37440     
_________________________________________________________________
activation_1773 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1773 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1249 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_1774 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1774 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_465 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_990 (Dense)            (None, 128)               524416    
_________________________________________________________________
batch_normalization_1310 (Ba (None, 128)               512       
_________________________________________________________________
activation_1775 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1775 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_991 (Dense)            (None, 256)               33024     
_________________________________________________________________
batch_normalization_1311 (Ba (None, 256)               1024      
_________________________________________________________________
activation_1776 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1776 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_992 (Dense)            (None, 100)               25700     
=================================================================
Total params: 627,855
Trainable params: 626,063
Non-trainable params: 1,792
_________________________________________________________________
