Model: "sequential_319"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_825 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_884 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_1151 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1151 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_325 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_826 (Separa (None, 16, 16, 64)        37440     
_________________________________________________________________
batch_normalization_885 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1152 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1152 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_326 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_827 (Separa (None, 8, 8, 16)          1616      
_________________________________________________________________
activation_1153 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1153 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_319 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_645 (Dense)            (None, 100)               102500    
=================================================================
Total params: 145,935
Trainable params: 144,783
Non-trainable params: 1,152
_________________________________________________________________
