Model: "sequential_542"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1471 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_1559 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2123 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2123 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_576 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_1472 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1560 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2124 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2124 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1473 (Separ (None, 16, 16, 32)        5280      
_________________________________________________________________
activation_2125 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_2125 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_542 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_1194 (Dense)           (None, 128)               1048704   
_________________________________________________________________
batch_normalization_1561 (Ba (None, 128)               512       
_________________________________________________________________
activation_2126 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_2126 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_1195 (Dense)           (None, 100)               12900     
=================================================================
Total params: 1,105,183
Trainable params: 1,104,159
Non-trainable params: 1,024
_________________________________________________________________
