Model: "sequential_40"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_99 (Separab (None, 32, 32, 8)         59        
_________________________________________________________________
batch_normalization_81 (Batc (None, 32, 32, 8)         32        
_________________________________________________________________
activation_136 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_136 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_100 (Separa (None, 32, 32, 64)        648       
_________________________________________________________________
batch_normalization_82 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
activation_137 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_137 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_101 (Separa (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_138 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_138 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_40 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_77 (Dense)             (None, 100)               409700    
=================================================================
Total params: 412,311
Trainable params: 412,167
Non-trainable params: 144
_________________________________________________________________
