Model: "sequential_204"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_503 (Separa (None, 32, 32, 512)       2075      
_________________________________________________________________
batch_normalization_530 (Bat (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_698 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_698 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_186 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_504 (Separa (None, 16, 16, 128)       70272     
_________________________________________________________________
batch_normalization_531 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_699 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_699 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_204 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_399 (Dense)            (None, 128)               4194432   
_________________________________________________________________
batch_normalization_532 (Bat (None, 128)               512       
_________________________________________________________________
activation_700 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_700 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_400 (Dense)            (None, 100)               12900     
=================================================================
Total params: 4,282,751
Trainable params: 4,281,215
Non-trainable params: 1,536
_________________________________________________________________
