Model: "sequential_552"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1501 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_1591 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2170 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2170 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_584 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_1502 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1592 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2171 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2171 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1503 (Separ (None, 16, 16, 16)        3216      
_________________________________________________________________
activation_2172 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2172 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_552 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_1221 (Dense)           (None, 512)               2097664   
_________________________________________________________________
batch_normalization_1593 (Ba (None, 512)               2048      
_________________________________________________________________
activation_2173 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_2173 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_1222 (Dense)           (None, 256)               131328    
_________________________________________________________________
batch_normalization_1594 (Ba (None, 256)               1024      
_________________________________________________________________
activation_2174 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_2174 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_1223 (Dense)           (None, 100)               25700     
=================================================================
Total params: 2,298,767
Trainable params: 2,296,463
Non-trainable params: 2,304
_________________________________________________________________
