Model: "sequential_88"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_205 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_188 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_277 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_277 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_206 (Separa (None, 32, 32, 64)        18752     
_________________________________________________________________
batch_normalization_189 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_278 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_278 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_63 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_207 (Separa (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_279 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_279 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_88 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_160 (Dense)            (None, 100)               409700    
=================================================================
Total params: 432,399
Trainable params: 431,759
Non-trainable params: 640
_________________________________________________________________
