Model: "sequential_241"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_607 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_649 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_848 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_848 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_608 (Separa (None, 32, 32, 64)        18752     
_________________________________________________________________
batch_normalization_650 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_849 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_849 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
flatten_241 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_482 (Dense)            (None, 256)               16777472  
_________________________________________________________________
batch_normalization_651 (Bat (None, 256)               1024      
_________________________________________________________________
activation_850 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_850 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_483 (Dense)            (None, 100)               25700     
=================================================================
Total params: 16,825,279
Trainable params: 16,824,127
Non-trainable params: 1,152
_________________________________________________________________
