Model: "sequential_562"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1531 (Separ (None, 32, 32, 128)       539       
_________________________________________________________________
batch_normalization_1626 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2216 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2216 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_592 (MaxPoolin (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_1532 (Separ (None, 16, 16, 64)        9408      
_________________________________________________________________
batch_normalization_1627 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_2217 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2217 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1533 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_2218 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2218 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_562 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_1247 (Dense)           (None, 1024)              4195328   
_________________________________________________________________
batch_normalization_1628 (Ba (None, 1024)              4096      
_________________________________________________________________
activation_2219 (Activation) (None, 1024)              0         
_________________________________________________________________
dropout_2219 (Dropout)       (None, 1024)              0         
_________________________________________________________________
dense_1248 (Dense)           (None, 512)               524800    
_________________________________________________________________
batch_normalization_1629 (Ba (None, 512)               2048      
_________________________________________________________________
activation_2220 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_2220 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_1249 (Dense)           (None, 100)               51300     
=================================================================
Total params: 4,789,903
Trainable params: 4,786,447
Non-trainable params: 3,456
_________________________________________________________________
