Model: "sequential_165"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1504 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_843 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1694 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1694 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_338 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1505 (Separ (None, 16, 16, 128)       140416    
_________________________________________________________________
activation_1695 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1695 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_339 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_1506 (Separ (None, 8, 8, 512)         67200     
_________________________________________________________________
activation_1696 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1696 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1507 (Separ (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_844 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1697 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1697 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1508 (Separ (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_845 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1698 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1698 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1509 (Separ (None, 8, 8, 64)          74816     
_________________________________________________________________
batch_normalization_846 (Bat (None, 8, 8, 64)          256       
_________________________________________________________________
activation_1699 (Activation) (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_1699 (Dropout)       (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1510 (Separ (None, 8, 8, 16)          1616      
_________________________________________________________________
batch_normalization_847 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1700 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1700 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1511 (Separ (None, 8, 8, 512)         8848      
_________________________________________________________________
activation_1701 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1701 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1512 (Separ (None, 8, 8, 64)          37440     
_________________________________________________________________
activation_1702 (Activation) (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_1702 (Dropout)       (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1513 (Separ (None, 8, 8, 8)           1096      
_________________________________________________________________
activation_1703 (Activation) (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_1703 (Dropout)       (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_165 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_355 (Dense)            (None, 4096)              2101248   
_________________________________________________________________
activation_1704 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_1704 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_356 (Dense)            (None, 100)               409700    
=================================================================
Total params: 4,447,847
Trainable params: 4,441,543
Non-trainable params: 6,304
_________________________________________________________________
