Model: "sequential_89"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_860 (Separa (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_484 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_976 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_976 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_194 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_861 (Separa (None, 16, 16, 32)        42016     
_________________________________________________________________
activation_977 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_977 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_195 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_862 (Separa (None, 8, 8, 512)         17184     
_________________________________________________________________
activation_978 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_978 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_863 (Separa (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_485 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_979 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_979 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_864 (Separa (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_486 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_980 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_980 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_865 (Separa (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_487 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_981 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_981 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_866 (Separa (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_488 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_982 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_982 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_867 (Separa (None, 8, 8, 512)         8848      
_________________________________________________________________
batch_normalization_489 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_983 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_983 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_868 (Separa (None, 8, 8, 8)           8712      
_________________________________________________________________
activation_984 (Activation)  (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_984 (Dropout)        (None, 8, 8, 8)           0         
_________________________________________________________________
max_pooling2d_196 (MaxPoolin (None, 4, 4, 8)           0         
_________________________________________________________________
separable_conv2d_869 (Separa (None, 4, 4, 256)         2376      
_________________________________________________________________
batch_normalization_490 (Bat (None, 4, 4, 256)         1024      
_________________________________________________________________
activation_985 (Activation)  (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_985 (Dropout)        (None, 4, 4, 256)         0         
_________________________________________________________________
separable_conv2d_870 (Separa (None, 4, 4, 512)         133888    
_________________________________________________________________
activation_986 (Activation)  (None, 4, 4, 512)         0         
_________________________________________________________________
dropout_986 (Dropout)        (None, 4, 4, 512)         0         
_________________________________________________________________
flatten_89 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_205 (Dense)            (None, 32)                262176    
_________________________________________________________________
activation_987 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_987 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_206 (Dense)            (None, 100)               3300      
=================================================================
Total params: 2,112,879
Trainable params: 2,105,135
Non-trainable params: 7,744
_________________________________________________________________
