Model: "sequential_244"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2133 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_1174 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2375 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2375 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_2134 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_2376 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2376 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_429 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_2135 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_2377 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_2377 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_2136 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_1175 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2378 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2378 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2137 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_1176 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2379 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2379 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2138 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_1177 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_2380 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2380 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2139 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_2381 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2381 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2140 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_2382 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2382 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_244 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_486 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,102,575
Trainable params: 2,096,399
Non-trainable params: 6,176
_________________________________________________________________
