Model: "sequential_347"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2956 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_1578 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_3219 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_3219 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_2957 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_3220 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3220 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_542 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_2958 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_3221 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_3221 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_2959 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_1579 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_3222 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_3222 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2960 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_1580 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_3223 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_3223 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2961 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_1581 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_3224 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3224 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2962 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_3225 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3225 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2963 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_3226 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3226 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_347 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_610 (Dense)            (None, 4096)              16781312  
_________________________________________________________________
activation_3227 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_3227 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_611 (Dense)            (None, 100)               409700    
=================================================================
Total params: 18,883,887
Trainable params: 18,877,711
Non-trainable params: 6,176
_________________________________________________________________
