Model: "sequential_177"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1602 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_897 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_1802 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_1802 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_1603 (Separ (None, 32, 32, 32)        10528     
_________________________________________________________________
activation_1803 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1803 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_356 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_1604 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_1804 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1804 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1605 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_898 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1805 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1805 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1606 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_899 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1806 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1806 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1607 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_900 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_1807 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1807 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_1608 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_1808 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1808 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1609 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_1809 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1809 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_177 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_377 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,064,943
Trainable params: 2,060,303
Non-trainable params: 4,640
_________________________________________________________________
