Model: "sequential_106"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1015 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_569 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1148 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1148 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_229 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1016 (Separ (None, 16, 16, 128)       140416    
_________________________________________________________________
activation_1149 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1149 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_230 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_1017 (Separ (None, 8, 8, 512)         67200     
_________________________________________________________________
activation_1150 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1150 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1018 (Separ (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_570 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1151 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1151 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1019 (Separ (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_571 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1152 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1152 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1020 (Separ (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_572 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1153 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1153 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1021 (Separ (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_573 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1154 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1154 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1022 (Separ (None, 8, 8, 512)         8848      
_________________________________________________________________
activation_1155 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1155 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1023 (Separ (None, 8, 8, 64)          37440     
_________________________________________________________________
activation_1156 (Activation) (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_1156 (Dropout)       (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1024 (Separ (None, 8, 8, 8)           1096      
_________________________________________________________________
activation_1157 (Activation) (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_1157 (Dropout)       (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_106 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_239 (Dense)            (None, 4096)              2101248   
_________________________________________________________________
activation_1158 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_1158 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_240 (Dense)            (None, 100)               409700    
=================================================================
Total params: 4,397,255
Trainable params: 4,391,047
Non-trainable params: 6,208
_________________________________________________________________
