Model: "sequential_144"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1334 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_748 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1505 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1505 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_302 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1335 (Separ (None, 16, 16, 32)        42016     
_________________________________________________________________
activation_1506 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1506 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_303 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1336 (Separ (None, 8, 8, 512)         17184     
_________________________________________________________________
activation_1507 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1507 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1337 (Separ (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_749 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1508 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1508 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1338 (Separ (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_750 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1509 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1509 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1339 (Separ (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_751 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1510 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1510 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1340 (Separ (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_752 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1511 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1511 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1341 (Separ (None, 8, 8, 8)           280       
_________________________________________________________________
activation_1512 (Activation) (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_1512 (Dropout)       (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_144 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_315 (Dense)            (None, 4096)              2101248   
_________________________________________________________________
activation_1513 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_1513 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_316 (Dense)            (None, 100)               409700    
=================================================================
Total params: 4,201,735
Trainable params: 4,195,527
Non-trainable params: 6,208
_________________________________________________________________
