Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_177 (Separa (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_92 (Batc (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_201 (Activation)  (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_201 (Dropout)        (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_178 (Separa (None, 32, 32, 32)        10528     
_________________________________________________________________
batch_normalization_93 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
activation_202 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_202 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_179 (Separa (None, 32, 32, 16)        816       
_________________________________________________________________
batch_normalization_94 (Batc (None, 32, 32, 16)        64        
_________________________________________________________________
activation_203 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_203 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_180 (Separa (None, 16, 16, 128)       2320      
_________________________________________________________________
batch_normalization_95 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
activation_204 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_204 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_43 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_181 (Separa (None, 8, 8, 16)          3216      
_________________________________________________________________
batch_normalization_96 (Batc (None, 8, 8, 16)          64        
_________________________________________________________________
activation_205 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_205 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_182 (Separa (None, 8, 8, 8)           280       
_________________________________________________________________
activation_206 (Activation)  (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_206 (Dropout)        (None, 8, 8, 8)           0         
_________________________________________________________________
max_pooling2d_44 (MaxPooling (None, 4, 4, 8)           0         
_________________________________________________________________
separable_conv2d_183 (Separa (None, 4, 4, 64)          648       
_________________________________________________________________
batch_normalization_97 (Batc (None, 4, 4, 64)          256       
_________________________________________________________________
activation_207 (Activation)  (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_207 (Dropout)        (None, 4, 4, 64)          0         
_________________________________________________________________
separable_conv2d_184 (Separa (None, 4, 4, 128)         8896      
_________________________________________________________________
batch_normalization_98 (Batc (None, 4, 4, 128)         512       
_________________________________________________________________
activation_208 (Activation)  (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_208 (Dropout)        (None, 4, 4, 128)         0         
_________________________________________________________________
separable_conv2d_185 (Separa (None, 4, 4, 64)          9408      
_________________________________________________________________
activation_209 (Activation)  (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_209 (Dropout)        (None, 4, 4, 64)          0         
_________________________________________________________________
separable_conv2d_186 (Separa (None, 4, 4, 32)          2656      
_________________________________________________________________
batch_normalization_99 (Batc (None, 4, 4, 32)          128       
_________________________________________________________________
activation_210 (Activation)  (None, 4, 4, 32)          0         
_________________________________________________________________
dropout_210 (Dropout)        (None, 4, 4, 32)          0         
_________________________________________________________________
separable_conv2d_187 (Separa (None, 4, 4, 128)         4512      
_________________________________________________________________
activation_211 (Activation)  (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_211 (Dropout)        (None, 4, 4, 128)         0         
_________________________________________________________________
separable_conv2d_188 (Separa (None, 4, 4, 128)         17664     
_________________________________________________________________
batch_normalization_100 (Bat (None, 4, 4, 128)         512       
_________________________________________________________________
activation_212 (Activation)  (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_212 (Dropout)        (None, 4, 4, 128)         0         
_________________________________________________________________
separable_conv2d_189 (Separa (None, 4, 4, 128)         17664     
_________________________________________________________________
batch_normalization_101 (Bat (None, 4, 4, 128)         512       
_________________________________________________________________
activation_213 (Activation)  (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_213 (Dropout)        (None, 4, 4, 128)         0         
_________________________________________________________________
separable_conv2d_190 (Separa (None, 4, 4, 8)           2184      
_________________________________________________________________
activation_214 (Activation)  (None, 4, 4, 8)           0         
_________________________________________________________________
dropout_214 (Dropout)        (None, 4, 4, 8)           0         
_________________________________________________________________
separable_conv2d_191 (Separa (None, 4, 4, 8)           144       
_________________________________________________________________
batch_normalization_102 (Bat (None, 4, 4, 8)           32        
_________________________________________________________________
activation_215 (Activation)  (None, 4, 4, 8)           0         
_________________________________________________________________
dropout_215 (Dropout)        (None, 4, 4, 8)           0         
_________________________________________________________________
flatten_18 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_42 (Dense)             (None, 64)                8256      
_________________________________________________________________
batch_normalization_103 (Bat (None, 64)                256       
_________________________________________________________________
activation_216 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_216 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_43 (Dense)             (None, 100)               6500      
=================================================================
Total params: 100,743
Trainable params: 98,743
Non-trainable params: 2,000
_________________________________________________________________
