Model: "sequential_65"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_638 (Separa (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_360 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_728 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_728 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_145 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_639 (Separa (None, 16, 16, 32)        42016     
_________________________________________________________________
activation_729 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_729 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_146 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_640 (Separa (None, 8, 8, 512)         17184     
_________________________________________________________________
activation_730 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_730 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_641 (Separa (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_361 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_731 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_731 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_642 (Separa (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_362 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_732 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_732 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_643 (Separa (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_363 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_733 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_733 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_644 (Separa (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_364 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_734 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_734 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_645 (Separa (None, 8, 8, 512)         8848      
_________________________________________________________________
activation_735 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_735 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_646 (Separa (None, 8, 8, 64)          37440     
_________________________________________________________________
activation_736 (Activation)  (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_736 (Dropout)        (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_647 (Separa (None, 8, 8, 8)           1096      
_________________________________________________________________
activation_737 (Activation)  (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_737 (Dropout)        (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_65 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_155 (Dense)            (None, 4096)              2101248   
_________________________________________________________________
activation_738 (Activation)  (None, 4096)              0         
_________________________________________________________________
dropout_738 (Dropout)        (None, 4096)              0         
_________________________________________________________________
dense_156 (Dense)            (None, 100)               409700    
=================================================================
Total params: 4,248,839
Trainable params: 4,242,631
Non-trainable params: 6,208
_________________________________________________________________
