Model: "sequential_74"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_721 (Separa (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_405 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_821 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_821 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_163 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_722 (Separa (None, 16, 16, 32)        42016     
_________________________________________________________________
activation_822 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_822 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_164 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_723 (Separa (None, 8, 8, 512)         17184     
_________________________________________________________________
activation_823 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_823 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_724 (Separa (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_406 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_824 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_824 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_725 (Separa (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_407 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_825 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_825 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_726 (Separa (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_408 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_826 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_826 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_727 (Separa (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_409 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_827 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_827 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_728 (Separa (None, 8, 8, 512)         8848      
_________________________________________________________________
batch_normalization_410 (Bat (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_828 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_828 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_729 (Separa (None, 8, 8, 8)           8712      
_________________________________________________________________
activation_829 (Activation)  (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_829 (Dropout)        (None, 8, 8, 8)           0         
_________________________________________________________________
max_pooling2d_165 (MaxPoolin (None, 4, 4, 8)           0         
_________________________________________________________________
separable_conv2d_730 (Separa (None, 4, 4, 256)         2376      
_________________________________________________________________
batch_normalization_411 (Bat (None, 4, 4, 256)         1024      
_________________________________________________________________
activation_830 (Activation)  (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_830 (Dropout)        (None, 4, 4, 256)         0         
_________________________________________________________________
separable_conv2d_731 (Separa (None, 4, 4, 512)         133888    
_________________________________________________________________
activation_831 (Activation)  (None, 4, 4, 512)         0         
_________________________________________________________________
dropout_831 (Dropout)        (None, 4, 4, 512)         0         
_________________________________________________________________
flatten_74 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_174 (Dense)            (None, 256)               2097408   
_________________________________________________________________
activation_832 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_832 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_175 (Dense)            (None, 100)               25700     
=================================================================
Total params: 3,970,511
Trainable params: 3,962,767
Non-trainable params: 7,744
_________________________________________________________________
