Model: "sequential_147"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1359 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_761 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1532 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1532 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_308 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1360 (Separ (None, 16, 16, 128)       140416    
_________________________________________________________________
activation_1533 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1533 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_309 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_1361 (Separ (None, 8, 8, 512)         67200     
_________________________________________________________________
activation_1534 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1534 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1362 (Separ (None, 8, 8, 32)          21024     
_________________________________________________________________
batch_normalization_762 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1535 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1535 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1363 (Separ (None, 8, 8, 1024)        34080     
_________________________________________________________________
batch_normalization_763 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1536 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1536 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1364 (Separ (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_764 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1537 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1537 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1365 (Separ (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_765 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1538 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1538 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1366 (Separ (None, 8, 8, 8)           280       
_________________________________________________________________
activation_1539 (Activation) (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_1539 (Dropout)       (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_147 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_320 (Dense)            (None, 4096)              2101248   
_________________________________________________________________
activation_1540 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_1540 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_321 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,812,551
Trainable params: 2,808,327
Non-trainable params: 4,224
_________________________________________________________________
