Model: "sequential_195"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1745 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_973 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1958 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1958 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_377 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1746 (Separ (None, 16, 16, 128)       140416    
_________________________________________________________________
activation_1959 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1959 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_378 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_1747 (Separ (None, 8, 8, 512)         67200     
_________________________________________________________________
activation_1960 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1960 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1748 (Separ (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_974 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1961 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1961 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1749 (Separ (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_975 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1962 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1962 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1750 (Separ (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_976 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1963 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1963 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1751 (Separ (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_977 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1964 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1964 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1752 (Separ (None, 8, 8, 8)           280       
_________________________________________________________________
activation_1965 (Activation) (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_1965 (Dropout)       (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_195 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_408 (Dense)            (None, 4096)              2101248   
_________________________________________________________________
activation_1966 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_1966 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_409 (Dense)            (None, 100)               409700    
=================================================================
Total params: 4,350,151
Trainable params: 4,343,943
Non-trainable params: 6,208
_________________________________________________________________
