Model: "sequential_259"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2253 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_1233 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2498 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2498 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_2254 (Separ (None, 32, 32, 32)        10528     
_________________________________________________________________
activation_2499 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2499 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_445 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_2255 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_2500 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_2500 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_2256 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_1234 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2501 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2501 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2257 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
activation_2502 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2502 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2258 (Separ (None, 16, 16, 64)        74816     
_________________________________________________________________
batch_normalization_1235 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_2503 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2503 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2259 (Separ (None, 16, 16, 64)        4736      
_________________________________________________________________
activation_2504 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2504 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2260 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_2505 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2505 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_259 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_504 (Dense)            (None, 4096)              16781312  
_________________________________________________________________
activation_2506 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_2506 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_505 (Dense)            (None, 100)               409700    
=================================================================
Total params: 18,895,055
Trainable params: 18,892,367
Non-trainable params: 2,688
_________________________________________________________________
