Model: "sequential_61"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_601 (Separa (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_340 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_687 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_687 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_137 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_602 (Separa (None, 16, 16, 32)        42016     
_________________________________________________________________
activation_688 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_688 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_138 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_603 (Separa (None, 8, 8, 512)         17184     
_________________________________________________________________
activation_689 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_689 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_604 (Separa (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_341 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_690 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_690 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_605 (Separa (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_342 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_691 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_691 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_606 (Separa (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_343 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_692 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_692 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_607 (Separa (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_344 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_693 (Activation)  (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_693 (Dropout)        (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_608 (Separa (None, 8, 8, 8)           280       
_________________________________________________________________
activation_694 (Activation)  (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_694 (Dropout)        (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_61 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_147 (Dense)            (None, 4096)              2101248   
_________________________________________________________________
activation_695 (Activation)  (None, 4096)              0         
_________________________________________________________________
dropout_695 (Dropout)        (None, 4096)              0         
_________________________________________________________________
dense_148 (Dense)            (None, 100)               409700    
=================================================================
Total params: 4,201,735
Trainable params: 4,195,527
Non-trainable params: 6,208
_________________________________________________________________
