Model: "sequential_235"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2060 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_1137 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2297 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2297 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_2061 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_2298 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2298 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_420 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_2062 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_2299 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_2299 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_2063 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_1138 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2300 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2300 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2064 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_1139 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2301 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2301 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2065 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_1140 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_2302 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2302 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2066 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_2303 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2303 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2067 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_2304 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2304 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2068 (Separ (None, 16, 16, 16)        416       
_________________________________________________________________
batch_normalization_1141 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_2305 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2305 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_235 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_472 (Dense)            (None, 4096)              16781312  
_________________________________________________________________
activation_2306 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_2306 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_473 (Dense)            (None, 100)               409700    
=================================================================
Total params: 18,884,367
Trainable params: 18,878,159
Non-trainable params: 6,208
_________________________________________________________________
