Model: "sequential_363"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_3083 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_1649 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_3349 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_3349 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_3084 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
batch_normalization_1650 (Ba (None, 32, 32, 32)        128       
_________________________________________________________________
activation_3350 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3350 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_559 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_3085 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_3351 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_3351 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_3086 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_1651 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_3352 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_3352 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_3087 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_1652 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_3353 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_3353 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_3088 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_1653 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_3354 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3354 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_3089 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_3355 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3355 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3090 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_3356 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3356 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_363 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_629 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,102,703
Trainable params: 2,096,463
Non-trainable params: 6,240
_________________________________________________________________
