Model: "sequential_180"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1626 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_911 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1828 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1828 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_1627 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_1829 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1829 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_360 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_1628 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_1830 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1830 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1629 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_912 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1831 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1831 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1630 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_913 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1832 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1832 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1631 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_914 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_1833 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1833 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_1632 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_1834 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1834 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1633 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_1835 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1835 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_180 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_382 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,102,575
Trainable params: 2,096,399
Non-trainable params: 6,176
_________________________________________________________________
