Model: "sequential_142"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1316 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_738 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1485 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1485 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_1317 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_1486 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1486 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_299 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_1318 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_1487 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1487 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1319 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_739 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1488 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1488 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1320 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_740 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1489 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1489 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1321 (Separ (None, 16, 16, 64)        74816     
_________________________________________________________________
batch_normalization_741 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_1490 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1490 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1322 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
batch_normalization_742 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_1491 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1491 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_1323 (Separ (None, 16, 16, 512)       8848      
_________________________________________________________________
activation_1492 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1492 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1324 (Separ (None, 16, 16, 64)        37440     
_________________________________________________________________
activation_1493 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1493 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1325 (Separ (None, 16, 16, 8)         1096      
_________________________________________________________________
activation_1494 (Activation) (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_1494 (Dropout)       (None, 16, 16, 8)         0         
_________________________________________________________________
flatten_142 (Flatten)        (None, 2048)              0         
_________________________________________________________________
dense_311 (Dense)            (None, 4096)              8392704   
_________________________________________________________________
activation_1495 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_1495 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_312 (Dense)            (None, 100)               409700    
=================================================================
Total params: 10,590,887
Trainable params: 10,584,583
Non-trainable params: 6,304
_________________________________________________________________
