Model: "sequential_201"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1793 (Separ (None, 32, 32, 256)       1051      
_________________________________________________________________
batch_normalization_998 (Bat (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2010 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2010 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
separable_conv2d_1794 (Separ (None, 32, 32, 32)        10528     
_________________________________________________________________
activation_2011 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2011 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_385 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_1795 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_2012 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_2012 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1796 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_999 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2013 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2013 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1797 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
activation_2014 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2014 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1798 (Separ (None, 16, 16, 64)        74816     
_________________________________________________________________
batch_normalization_1000 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_2015 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2015 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1799 (Separ (None, 16, 16, 64)        4736      
_________________________________________________________________
activation_2016 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2016 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1800 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_2017 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2017 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_201 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_418 (Dense)            (None, 4096)              16781312  
_________________________________________________________________
activation_2018 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_2018 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_419 (Dense)            (None, 100)               409700    
=================================================================
Total params: 18,895,055
Trainable params: 18,892,367
Non-trainable params: 2,688
_________________________________________________________________
