Model: "sequential_173"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1569 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_880 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1767 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1767 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_351 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1570 (Separ (None, 16, 16, 32)        42016     
_________________________________________________________________
activation_1768 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1768 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_352 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1571 (Separ (None, 8, 8, 512)         17184     
_________________________________________________________________
activation_1769 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1769 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1572 (Separ (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_881 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1770 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1770 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1573 (Separ (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_882 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1771 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1771 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1574 (Separ (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_883 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1772 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1772 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1575 (Separ (None, 8, 8, 64)          1232      
_________________________________________________________________
activation_1773 (Activation) (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_1773 (Dropout)       (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1576 (Separ (None, 8, 8, 16)          1616      
_________________________________________________________________
activation_1774 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1774 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_173 (Flatten)        (None, 1024)              0         
_________________________________________________________________
dense_371 (Dense)            (None, 100)               102500    
=================================================================
Total params: 1,795,375
Trainable params: 1,789,199
Non-trainable params: 6,176
_________________________________________________________________
