Model: "sequential_161"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1472 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_826 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1658 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1658 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_1473 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_1659 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1659 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_334 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_1474 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_1660 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1660 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1475 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_827 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1661 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1661 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1476 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_828 (Bat (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_1662 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_1662 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1477 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_829 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_1663 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1663 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_1478 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_1664 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1664 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_1479 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_1665 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_1665 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_161 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_347 (Dense)            (None, 4096)              16781312  
_________________________________________________________________
activation_1666 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_1666 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_348 (Dense)            (None, 100)               409700    
=================================================================
Total params: 18,883,887
Trainable params: 18,877,711
Non-trainable params: 6,176
_________________________________________________________________
