Model: "sequential_119"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1125 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_630 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1271 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1271 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_255 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1126 (Separ (None, 16, 16, 32)        42016     
_________________________________________________________________
activation_1272 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1272 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_256 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1127 (Separ (None, 8, 8, 512)         17184     
_________________________________________________________________
activation_1273 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1273 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1128 (Separ (None, 8, 8, 1024)        529920    
_________________________________________________________________
batch_normalization_631 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1274 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1274 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1129 (Separ (None, 8, 8, 1024)        1058816   
_________________________________________________________________
batch_normalization_632 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1275 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1275 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1130 (Separ (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_633 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1276 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1276 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1131 (Separ (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_634 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1277 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1277 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1132 (Separ (None, 8, 8, 8)           280       
_________________________________________________________________
activation_1278 (Activation) (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_1278 (Dropout)       (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_119 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_265 (Dense)            (None, 4096)              2101248   
_________________________________________________________________
activation_1279 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_1279 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_266 (Dense)            (None, 100)               409700    
=================================================================
Total params: 4,201,735
Trainable params: 4,195,527
Non-trainable params: 6,208
_________________________________________________________________
