Model: "sequential_227"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1997 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_1104 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2231 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2231 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_1998 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_2232 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2232 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_412 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_1999 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_2233 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_2233 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_2000 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_1105 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2234 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2234 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2001 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_1106 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2235 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2235 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2002 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_1107 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_2236 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2236 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2003 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_2237 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2237 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2004 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_2238 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2238 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_227 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_461 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,102,575
Trainable params: 2,096,399
Non-trainable params: 6,176
_________________________________________________________________
