Model: "sequential_111"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1058 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_593 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1196 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1196 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
max_pooling2d_239 (MaxPoolin (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_1059 (Separ (None, 16, 16, 128)       140416    
_________________________________________________________________
activation_1197 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1197 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_240 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_1060 (Separ (None, 8, 8, 512)         67200     
_________________________________________________________________
activation_1198 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1198 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1061 (Separ (None, 8, 8, 32)          21024     
_________________________________________________________________
batch_normalization_594 (Bat (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1199 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1199 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1062 (Separ (None, 8, 8, 1024)        34080     
_________________________________________________________________
batch_normalization_595 (Bat (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_1200 (Activation) (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_1200 (Dropout)       (None, 8, 8, 1024)        0         
_________________________________________________________________
separable_conv2d_1063 (Separ (None, 8, 8, 16)          25616     
_________________________________________________________________
batch_normalization_596 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1201 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1201 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1064 (Separ (None, 8, 8, 16)          416       
_________________________________________________________________
batch_normalization_597 (Bat (None, 8, 8, 16)          64        
_________________________________________________________________
activation_1202 (Activation) (None, 8, 8, 16)          0         
_________________________________________________________________
dropout_1202 (Dropout)       (None, 8, 8, 16)          0         
_________________________________________________________________
separable_conv2d_1065 (Separ (None, 8, 8, 8)           280       
_________________________________________________________________
activation_1203 (Activation) (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_1203 (Dropout)       (None, 8, 8, 8)           0         
_________________________________________________________________
flatten_111 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_249 (Dense)            (None, 4096)              2101248   
_________________________________________________________________
activation_1204 (Activation) (None, 4096)              0         
_________________________________________________________________
dropout_1204 (Dropout)       (None, 4096)              0         
_________________________________________________________________
dense_250 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,812,551
Trainable params: 2,808,327
Non-trainable params: 4,224
_________________________________________________________________
