Model: "sequential_262"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2277 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_1243 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2523 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2523 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_2278 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_2524 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2524 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_448 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_2279 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_2525 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_2525 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_2280 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_1244 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2526 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2526 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2281 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_1245 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2527 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2527 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2282 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_1246 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_2528 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2528 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2283 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
activation_2529 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_2529 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2284 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_2530 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_2530 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_262 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_508 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,102,575
Trainable params: 2,096,399
Non-trainable params: 6,176
_________________________________________________________________
