Model: "sequential_366"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_3107 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_1663 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_3374 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_3374 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_3108 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_3375 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3375 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_562 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_3109 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_3376 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_3376 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_3110 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_1664 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_3377 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_3377 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_3111 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_1665 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_3378 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_3378 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_3112 (Separ (None, 16, 16, 32)        42016     
_________________________________________________________________
activation_3379 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_3379 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_3113 (Separ (None, 16, 16, 64)        2400      
_________________________________________________________________
activation_3380 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3380 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_3114 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_3381 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3381 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_366 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_633 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,120,079
Trainable params: 2,113,935
Non-trainable params: 6,144
_________________________________________________________________
