Model: "sequential_330"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2821 (Separ (None, 32, 32, 1024)      4123      
_________________________________________________________________
batch_normalization_1513 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_3082 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_3082 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_2822 (Separ (None, 32, 32, 32)        42016     
_________________________________________________________________
activation_3083 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_3083 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_522 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_2823 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_3084 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_3084 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_2824 (Separ (None, 16, 16, 1024)      529920    
_________________________________________________________________
batch_normalization_1514 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_3085 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_3085 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2825 (Separ (None, 16, 16, 1024)      1058816   
_________________________________________________________________
batch_normalization_1515 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_3086 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_3086 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
separable_conv2d_2826 (Separ (None, 16, 16, 16)        25616     
_________________________________________________________________
batch_normalization_1516 (Ba (None, 16, 16, 16)        64        
_________________________________________________________________
activation_3087 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3087 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2827 (Separ (None, 16, 16, 64)        1232      
_________________________________________________________________
batch_normalization_1517 (Ba (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3088 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3088 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_2828 (Separ (None, 16, 16, 16)        1616      
_________________________________________________________________
activation_3089 (Activation) (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_3089 (Dropout)       (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_330 (Flatten)        (None, 4096)              0         
_________________________________________________________________
dense_591 (Dense)            (None, 100)               409700    
=================================================================
Total params: 2,102,831
Trainable params: 2,096,527
Non-trainable params: 6,304
_________________________________________________________________
