Model: "sequential_384"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2242 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2700 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2700 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2243 (Separ (None, 32, 32, 512)       8848      
_________________________________________________________________
batch_normalization_1825 (Ba (None, 32, 32, 512)       2048      
_________________________________________________________________
activation_2701 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_2701 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_2244 (Separ (None, 32, 32, 1024)      529920    
_________________________________________________________________
batch_normalization_1826 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2702 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2702 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_2245 (Separ (None, 32, 32, 256)       271616    
_________________________________________________________________
batch_normalization_1827 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2703 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2703 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_660 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_2246 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1828 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2704 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2704 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_661 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_384 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_842 (Dense)            (None, 100)               819300    
=================================================================
Total params: 1,672,655
Trainable params: 1,668,815
Non-trainable params: 3,840
_________________________________________________________________
