Model: "sequential_167"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1078 (Separ (None, 32, 32, 64)        283       
_________________________________________________________________
activation_1407 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1407 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_1079 (Separ (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_876 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1408 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1408 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_1080 (Separ (None, 32, 32, 128)       140416    
_________________________________________________________________
batch_normalization_877 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1409 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1409 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1081 (Separ (None, 32, 32, 16)        3216      
_________________________________________________________________
activation_1410 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1410 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1082 (Separ (None, 32, 32, 32)        688       
_________________________________________________________________
batch_normalization_878 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1411 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1411 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1083 (Separ (None, 32, 32, 512)       17184     
_________________________________________________________________
activation_1412 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1412 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_1084 (Separ (None, 32, 32, 32)        21024     
_________________________________________________________________
batch_normalization_879 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1413 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1413 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_299 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_167 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_496 (Dense)            (None, 512)               4194816   
_________________________________________________________________
activation_1414 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1414 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_497 (Dense)            (None, 128)               65664     
_________________________________________________________________
batch_normalization_880 (Bat (None, 128)               512       
_________________________________________________________________
activation_1415 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1415 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_498 (Dense)            (None, 100)               12900     
=================================================================
Total params: 4,528,703
Trainable params: 4,526,015
Non-trainable params: 2,688
_________________________________________________________________
