Model: "sequential_206"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1320 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_1704 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1704 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1321 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1069 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1705 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1705 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1322 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
activation_1706 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1706 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1323 (Separ (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_1707 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1707 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_363 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1324 (Separ (None, 16, 16, 256)       135936    
_________________________________________________________________
batch_normalization_1070 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_1708 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_1708 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_364 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
separable_conv2d_1325 (Separ (None, 8, 8, 32)          10528     
_________________________________________________________________
batch_normalization_1071 (Ba (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1709 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1709 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_1326 (Separ (None, 8, 8, 512)         17184     
_________________________________________________________________
activation_1710 (Activation) (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1710 (Dropout)       (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_1327 (Separ (None, 8, 8, 32)          21024     
_________________________________________________________________
batch_normalization_1072 (Ba (None, 8, 8, 32)          128       
_________________________________________________________________
activation_1711 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1711 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
max_pooling2d_365 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_206 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_590 (Dense)            (None, 512)               262656    
_________________________________________________________________
batch_normalization_1073 (Ba (None, 512)               2048      
_________________________________________________________________
activation_1712 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1712 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_591 (Dense)            (None, 128)               65664     
_________________________________________________________________
batch_normalization_1074 (Ba (None, 128)               512       
_________________________________________________________________
activation_1713 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1713 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_592 (Dense)            (None, 100)               12900     
=================================================================
Total params: 599,823
Trainable params: 597,871
Non-trainable params: 1,952
_________________________________________________________________
