Model: "sequential_343"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2049 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2500 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2500 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2050 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1652 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2501 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2501 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2051 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1653 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2502 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2502 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_2052 (Separ (None, 32, 32, 256)       34176     
_________________________________________________________________
batch_normalization_1654 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2503 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2503 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_587 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_2053 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1655 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2504 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2504 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_588 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_343 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_794 (Dense)            (None, 100)               819300    
=================================================================
Total params: 893,615
Trainable params: 892,559
Non-trainable params: 1,056
_________________________________________________________________
