Model: "sequential_197"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1264 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_1637 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1637 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1265 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1023 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1638 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1638 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1266 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1024 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1639 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1639 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1267 (Separ (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_1640 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1640 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_348 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1268 (Separ (None, 16, 16, 128)       70272     
_________________________________________________________________
batch_normalization_1025 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1641 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_1641 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_197 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_570 (Dense)            (None, 100)               3276900   
=================================================================
Total params: 3,418,287
Trainable params: 3,417,743
Non-trainable params: 544
_________________________________________________________________
