Model: "sequential_148"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_962 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_1263 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1263 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_963 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_783 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1264 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1264 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_964 (Separa (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_784 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1265 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1265 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_965 (Separa (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_1266 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1266 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_266 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_966 (Separa (None, 16, 16, 256)       135936    
_________________________________________________________________
batch_normalization_785 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_1267 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_1267 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_267 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
separable_conv2d_967 (Separa (None, 8, 8, 64)          18752     
_________________________________________________________________
activation_1268 (Activation) (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_1268 (Dropout)       (None, 8, 8, 64)          0         
_________________________________________________________________
max_pooling2d_268 (MaxPoolin (None, 4, 4, 64)          0         
_________________________________________________________________
separable_conv2d_968 (Separa (None, 4, 4, 128)         8896      
_________________________________________________________________
batch_normalization_786 (Bat (None, 4, 4, 128)         512       
_________________________________________________________________
activation_1269 (Activation) (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_1269 (Dropout)       (None, 4, 4, 128)         0         
_________________________________________________________________
flatten_148 (Flatten)        (None, 2048)              0         
_________________________________________________________________
dense_449 (Dense)            (None, 256)               524544    
_________________________________________________________________
batch_normalization_787 (Bat (None, 256)               1024      
_________________________________________________________________
activation_1270 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_1270 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_450 (Dense)            (None, 100)               25700     
=================================================================
Total params: 786,991
Trainable params: 785,423
Non-trainable params: 1,568
_________________________________________________________________
