Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_99 (Separab (None, 32, 32, 1024)      4123      
_________________________________________________________________
activation_133 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_133 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_100 (Separa (None, 32, 32, 8)         17416     
_________________________________________________________________
batch_normalization_69 (Batc (None, 32, 32, 8)         32        
_________________________________________________________________
activation_134 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_134 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_101 (Separa (None, 32, 32, 512)       4680      
_________________________________________________________________
activation_135 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_135 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_102 (Separa (None, 16, 16, 128)       70272     
_________________________________________________________________
batch_normalization_70 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
activation_136 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_136 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 32768)             0         
_________________________________________________________________
dense_47 (Dense)             (None, 256)               8388864   
_________________________________________________________________
activation_137 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_137 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_48 (Dense)             (None, 128)               32896     
_________________________________________________________________
batch_normalization_71 (Batc (None, 128)               512       
_________________________________________________________________
activation_138 (Activation)  (None, 128)               0         
_________________________________________________________________
dropout_138 (Dropout)        (None, 128)               0         
_________________________________________________________________
dense_49 (Dense)             (None, 16)                2064      
_________________________________________________________________
batch_normalization_72 (Batc (None, 16)                64        
_________________________________________________________________
activation_139 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_139 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_50 (Dense)             (None, 100)               1700      
=================================================================
Total params: 8,523,135
Trainable params: 8,522,575
Non-trainable params: 560
_________________________________________________________________
