Model: "sequential_386"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2252 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2710 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2710 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2253 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1833 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2711 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2711 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2254 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1834 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2712 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2712 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_2255 (Separ (None, 32, 32, 256)       34176     
_________________________________________________________________
batch_normalization_1835 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2713 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2713 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_664 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_2256 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1836 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2714 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2714 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_665 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_386 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_844 (Dense)            (None, 100)               819300    
=================================================================
Total params: 893,615
Trainable params: 892,559
Non-trainable params: 1,056
_________________________________________________________________
