Model: "sequential_383"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2237 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2695 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2695 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2238 (Separ (None, 32, 32, 1024)      17552     
_________________________________________________________________
batch_normalization_1821 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2696 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2696 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_2239 (Separ (None, 32, 32, 128)       140416    
_________________________________________________________________
batch_normalization_1822 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2697 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2697 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_2240 (Separ (None, 32, 32, 256)       34176     
_________________________________________________________________
batch_normalization_1823 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2698 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2698 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_658 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_2241 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1824 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2699 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2699 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_659 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_383 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_841 (Dense)            (None, 100)               819300    
=================================================================
Total params: 1,052,879
Trainable params: 1,049,807
Non-trainable params: 3,072
_________________________________________________________________
