Model: "sequential_81"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_548 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
activation_711 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_711 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_549 (Separa (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_430 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_712 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_712 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_550 (Separa (None, 32, 32, 16)        25616     
_________________________________________________________________
activation_713 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_713 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_154 (MaxPoolin (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_551 (Separa (None, 16, 16, 64)        1232      
_________________________________________________________________
batch_normalization_431 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_714 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_714 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_552 (Separa (None, 16, 16, 256)       17216     
_________________________________________________________________
batch_normalization_432 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_715 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_715 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_155 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_81 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_244 (Dense)            (None, 256)               4194560   
_________________________________________________________________
batch_normalization_433 (Bat (None, 256)               1024      
_________________________________________________________________
activation_716 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_716 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_245 (Dense)            (None, 256)               65792     
_________________________________________________________________
batch_normalization_434 (Bat (None, 256)               1024      
_________________________________________________________________
activation_717 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_717 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_246 (Dense)            (None, 64)                16448     
_________________________________________________________________
batch_normalization_435 (Bat (None, 64)                256       
_________________________________________________________________
activation_718 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_718 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_247 (Dense)            (None, 100)               6500      
=================================================================
Total params: 4,402,463
Trainable params: 4,398,623
Non-trainable params: 3,840
_________________________________________________________________
