Model: "sequential_98"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_657 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_524 (Bat (None, 32, 32, 64)        256       
_________________________________________________________________
activation_857 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_857 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_658 (Separa (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_525 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_858 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_858 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_659 (Separa (None, 32, 32, 16)        25616     
_________________________________________________________________
activation_859 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_859 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_183 (MaxPoolin (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_660 (Separa (None, 16, 16, 64)        1232      
_________________________________________________________________
batch_normalization_526 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_860 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_860 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_661 (Separa (None, 16, 16, 256)       17216     
_________________________________________________________________
batch_normalization_527 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_861 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_861 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_184 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_98 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_298 (Dense)            (None, 32)                524320    
_________________________________________________________________
batch_normalization_528 (Bat (None, 32)                128       
_________________________________________________________________
activation_862 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_862 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_299 (Dense)            (None, 512)               16896     
_________________________________________________________________
activation_863 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_863 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_300 (Dense)            (None, 512)               262656    
_________________________________________________________________
batch_normalization_529 (Bat (None, 512)               2048      
_________________________________________________________________
activation_864 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_864 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_301 (Dense)            (None, 100)               51300     
=================================================================
Total params: 974,463
Trainable params: 970,559
Non-trainable params: 3,904
_________________________________________________________________
