Model: "sequential_223"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1430 (Separ (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_1153 (Ba (None, 32, 32, 64)        256       
_________________________________________________________________
activation_1830 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1830 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_1431 (Separ (None, 32, 32, 16)        1616      
_________________________________________________________________
batch_normalization_1154 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1831 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1831 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1432 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1155 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1832 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1832 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1433 (Separ (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_1833 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1833 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_393 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1434 (Separ (None, 16, 16, 64)        37440     
_________________________________________________________________
activation_1834 (Activation) (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1834 (Dropout)       (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_394 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
separable_conv2d_1435 (Separ (None, 8, 8, 8)           1096      
_________________________________________________________________
activation_1835 (Activation) (None, 8, 8, 8)           0         
_________________________________________________________________
dropout_1835 (Dropout)       (None, 8, 8, 8)           0         
_________________________________________________________________
max_pooling2d_395 (MaxPoolin (None, 4, 4, 8)           0         
_________________________________________________________________
flatten_223 (Flatten)        (None, 128)               0         
_________________________________________________________________
dense_623 (Dense)            (None, 100)               12900     
=================================================================
Total params: 123,687
Trainable params: 123,271
Non-trainable params: 416
_________________________________________________________________
