Model: "sequential_382"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2232 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2690 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2690 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2233 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1817 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2691 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2691 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2234 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1818 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2692 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2692 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_2235 (Separ (None, 32, 32, 256)       34176     
_________________________________________________________________
batch_normalization_1819 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2693 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2693 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_656 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_2236 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1820 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2694 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2694 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_657 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_382 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_840 (Dense)            (None, 100)               819300    
=================================================================
Total params: 893,615
Trainable params: 892,559
Non-trainable params: 1,056
_________________________________________________________________
