Model: "sequential_292"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1808 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2243 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2243 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1809 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1452 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2244 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2244 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1810 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1453 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2245 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2245 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1811 (Separ (None, 32, 32, 32)        5280      
_________________________________________________________________
activation_2246 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2246 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_503 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_292 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_727 (Dense)            (None, 100)               819300    
=================================================================
Total params: 827,983
Trainable params: 827,695
Non-trainable params: 288
_________________________________________________________________
