Model: "sequential_392"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2282 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2740 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2740 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2283 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1857 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2741 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2741 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2284 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1858 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2742 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2742 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_2285 (Separ (None, 32, 32, 16)        3216      
_________________________________________________________________
batch_normalization_1859 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2743 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2743 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_676 (MaxPoolin (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_2286 (Separ (None, 16, 16, 256)       4496      
_________________________________________________________________
batch_normalization_1860 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_2744 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_2744 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_677 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
separable_conv2d_2287 (Separ (None, 8, 8, 128)         35200     
_________________________________________________________________
batch_normalization_1861 (Ba (None, 8, 8, 128)         512       
_________________________________________________________________
activation_2745 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_2745 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
max_pooling2d_678 (MaxPoolin (None, 4, 4, 128)         0         
_________________________________________________________________
flatten_392 (Flatten)        (None, 2048)              0         
_________________________________________________________________
dense_850 (Dense)            (None, 100)               204900    
=================================================================
Total params: 252,815
Trainable params: 251,727
Non-trainable params: 1,088
_________________________________________________________________
