Model: "sequential_306"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1878 (Separ (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_1512 (Ba (None, 32, 32, 64)        256       
_________________________________________________________________
activation_2320 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_2320 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_1879 (Separ (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_1513 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2321 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2321 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_1880 (Separ (None, 32, 32, 256)       271616    
_________________________________________________________________
batch_normalization_1514 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2322 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2322 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_523 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_1881 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1515 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2323 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2323 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_524 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_306 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_748 (Dense)            (None, 512)               4194816   
_________________________________________________________________
batch_normalization_1516 (Ba (None, 512)               2048      
_________________________________________________________________
activation_2324 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_2324 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_749 (Dense)            (None, 100)               51300     
=================================================================
Total params: 4,628,287
Trainable params: 4,624,319
Non-trainable params: 3,968
_________________________________________________________________
