Model: "sequential_127"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_840 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_1095 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1095 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_841 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_674 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1096 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1096 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_842 (Separa (None, 32, 32, 8)         280       
_________________________________________________________________
activation_1097 (Activation) (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_1097 (Dropout)       (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_843 (Separa (None, 32, 32, 32)        360       
_________________________________________________________________
batch_normalization_675 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1098 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1098 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_844 (Separa (None, 32, 32, 128)       4512      
_________________________________________________________________
batch_normalization_676 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1099 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1099 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
flatten_127 (Flatten)        (None, 131072)            0         
_________________________________________________________________
dense_382 (Dense)            (None, 512)               67109376  
_________________________________________________________________
activation_1100 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1100 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_383 (Dense)            (None, 512)               262656    
_________________________________________________________________
batch_normalization_677 (Bat (None, 512)               2048      
_________________________________________________________________
activation_1101 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1101 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_384 (Dense)            (None, 100)               51300     
=================================================================
Total params: 67,431,743
Trainable params: 67,430,367
Non-trainable params: 1,376
_________________________________________________________________
