Model: "sequential_56"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_386 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_503 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_503 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_387 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_297 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_504 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_504 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_388 (Separa (None, 32, 32, 1024)      17552     
_________________________________________________________________
batch_normalization_298 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_505 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_505 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_389 (Separa (None, 32, 32, 8)         17416     
_________________________________________________________________
activation_506 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_506 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_390 (Separa (None, 32, 32, 16)        216       
_________________________________________________________________
batch_normalization_299 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_507 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_507 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_391 (Separa (None, 32, 32, 32)        688       
_________________________________________________________________
batch_normalization_300 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_508 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_508 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_392 (Separa (None, 32, 32, 512)       17184     
_________________________________________________________________
activation_509 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_509 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_393 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
batch_normalization_301 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_510 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_510 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_112 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_394 (Separa (None, 16, 16, 128)       4512      
_________________________________________________________________
batch_normalization_302 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_511 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_511 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_56 (Flatten)         (None, 32768)             0         
_________________________________________________________________
dense_173 (Dense)            (None, 512)               16777728  
_________________________________________________________________
activation_512 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_512 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_174 (Dense)            (None, 512)               262656    
_________________________________________________________________
batch_normalization_303 (Bat (None, 512)               2048      
_________________________________________________________________
activation_513 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_513 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_175 (Dense)            (None, 100)               51300     
=================================================================
Total params: 17,177,823
Trainable params: 17,174,303
Non-trainable params: 3,520
_________________________________________________________________
