Model: "sequential_261"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1647 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2067 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2067 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1648 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1321 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2068 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2068 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1649 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1322 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2069 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2069 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1650 (Separ (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_2070 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_2070 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_457 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1651 (Separ (None, 16, 16, 256)       135936    
_________________________________________________________________
batch_normalization_1323 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_2071 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_2071 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_458 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
separable_conv2d_1652 (Separ (None, 8, 8, 128)         35200     
_________________________________________________________________
batch_normalization_1324 (Ba (None, 8, 8, 128)         512       
_________________________________________________________________
activation_2072 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_2072 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_261 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_681 (Dense)            (None, 256)               2097408   
_________________________________________________________________
batch_normalization_1325 (Ba (None, 256)               1024      
_________________________________________________________________
activation_2073 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_2073 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_682 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_1326 (Ba (None, 512)               2048      
_________________________________________________________________
activation_2074 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_2074 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_683 (Dense)            (None, 100)               51300     
=================================================================
Total params: 2,526,639
Trainable params: 2,524,047
Non-trainable params: 2,592
_________________________________________________________________
