Model: "sequential_301"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1851 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2290 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2290 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1852 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1487 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2291 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2291 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1853 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1488 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2292 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2292 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1854 (Separ (None, 32, 32, 256)       34176     
_________________________________________________________________
batch_normalization_1489 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2293 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2293 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_514 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_1855 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1490 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2294 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2294 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_301 (Flatten)        (None, 32768)             0         
_________________________________________________________________
dense_740 (Dense)            (None, 256)               8388864   
_________________________________________________________________
batch_normalization_1491 (Ba (None, 256)               1024      
_________________________________________________________________
activation_2295 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_2295 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_741 (Dense)            (None, 512)               131584    
_________________________________________________________________
batch_normalization_1492 (Ba (None, 512)               2048      
_________________________________________________________________
activation_2296 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_2296 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_742 (Dense)            (None, 100)               51300     
=================================================================
Total params: 8,649,135
Trainable params: 8,646,543
Non-trainable params: 2,592
_________________________________________________________________
