Model: "sequential_73"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_499 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_644 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_644 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_500 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_385 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_645 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_645 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_501 (Separa (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_386 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_646 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_646 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_502 (Separa (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_647 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_647 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_140 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_503 (Separa (None, 16, 16, 256)       135936    
_________________________________________________________________
batch_normalization_387 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_648 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_648 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_504 (Separa (None, 16, 16, 64)        18752     
_________________________________________________________________
activation_649 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_649 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_141 (MaxPoolin (None, 8, 8, 64)          0         
_________________________________________________________________
flatten_73 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_218 (Dense)            (None, 256)               1048832   
_________________________________________________________________
batch_normalization_388 (Bat (None, 256)               1024      
_________________________________________________________________
activation_650 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_650 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_219 (Dense)            (None, 256)               65792     
_________________________________________________________________
batch_normalization_389 (Bat (None, 256)               1024      
_________________________________________________________________
activation_651 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_651 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_220 (Dense)            (None, 64)                16448     
_________________________________________________________________
batch_normalization_390 (Bat (None, 64)                256       
_________________________________________________________________
activation_652 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_652 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_221 (Dense)            (None, 100)               6500      
=================================================================
Total params: 1,366,191
Trainable params: 1,364,239
Non-trainable params: 1,952
_________________________________________________________________
