Model: "sequential_89"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_598 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_782 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_782 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_599 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_478 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_783 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_783 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_600 (Separa (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_479 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_784 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_784 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_601 (Separa (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_785 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_785 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_167 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_602 (Separa (None, 16, 16, 256)       135936    
_________________________________________________________________
batch_normalization_480 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_786 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_786 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_168 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
separable_conv2d_603 (Separa (None, 8, 8, 128)         35200     
_________________________________________________________________
batch_normalization_481 (Bat (None, 8, 8, 128)         512       
_________________________________________________________________
activation_787 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_787 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_89 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_273 (Dense)            (None, 512)               4194816   
_________________________________________________________________
activation_788 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_788 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_274 (Dense)            (None, 512)               262656    
_________________________________________________________________
batch_normalization_482 (Bat (None, 512)               2048      
_________________________________________________________________
activation_789 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_789 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_275 (Dense)            (None, 100)               51300     
=================================================================
Total params: 4,754,095
Trainable params: 4,752,015
Non-trainable params: 2,080
_________________________________________________________________
