Model: "sequential_43"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_302 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
activation_393 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_393 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_303 (Separa (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_227 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_394 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_394 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_304 (Separa (None, 32, 32, 128)       140416    
_________________________________________________________________
batch_normalization_228 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_395 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_395 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
max_pooling2d_85 (MaxPooling (None, 16, 16, 128)       0         
_________________________________________________________________
separable_conv2d_305 (Separa (None, 16, 16, 8)         2184      
_________________________________________________________________
activation_396 (Activation)  (None, 16, 16, 8)         0         
_________________________________________________________________
dropout_396 (Dropout)        (None, 16, 16, 8)         0         
_________________________________________________________________
separable_conv2d_306 (Separa (None, 16, 16, 16)        216       
_________________________________________________________________
batch_normalization_229 (Bat (None, 16, 16, 16)        64        
_________________________________________________________________
activation_397 (Activation)  (None, 16, 16, 16)        0         
_________________________________________________________________
dropout_397 (Dropout)        (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_307 (Separa (None, 16, 16, 32)        688       
_________________________________________________________________
batch_normalization_230 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_398 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_398 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_308 (Separa (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_399 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_399 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_309 (Separa (None, 16, 16, 32)        21024     
_________________________________________________________________
batch_normalization_231 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_400 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_400 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_86 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_310 (Separa (None, 8, 8, 128)         4512      
_________________________________________________________________
batch_normalization_232 (Bat (None, 8, 8, 128)         512       
_________________________________________________________________
activation_401 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_401 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_43 (Flatten)         (None, 8192)              0         
_________________________________________________________________
dense_134 (Dense)            (None, 512)               4194816   
_________________________________________________________________
activation_402 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_402 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_135 (Dense)            (None, 512)               262656    
_________________________________________________________________
batch_normalization_233 (Bat (None, 512)               2048      
_________________________________________________________________
activation_403 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_403 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_136 (Dense)            (None, 100)               51300     
=================================================================
Total params: 4,769,903
Trainable params: 4,766,159
Non-trainable params: 3,744
_________________________________________________________________
