Model: "sequential_274"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1711 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2136 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2136 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1712 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1372 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2137 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2137 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1713 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1373 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2138 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2138 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1714 (Separ (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_2139 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_2139 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_473 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1715 (Separ (None, 16, 16, 256)       135936    
_________________________________________________________________
activation_2140 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_2140 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_474 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
separable_conv2d_1716 (Separ (None, 8, 8, 32)          10528     
_________________________________________________________________
batch_normalization_1374 (Ba (None, 8, 8, 32)          128       
_________________________________________________________________
activation_2141 (Activation) (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_2141 (Dropout)       (None, 8, 8, 32)          0         
_________________________________________________________________
max_pooling2d_475 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_274 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_699 (Dense)            (None, 100)               51300     
=================================================================
Total params: 268,495
Trainable params: 268,143
Non-trainable params: 352
_________________________________________________________________
