Model: "sequential_357"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2114 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2570 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2570 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2115 (Separ (None, 32, 32, 1024)      17552     
_________________________________________________________________
batch_normalization_1714 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2571 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2571 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_2116 (Separ (None, 32, 32, 128)       140416    
_________________________________________________________________
batch_normalization_1715 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2572 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2572 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_2117 (Separ (None, 32, 32, 256)       34176     
_________________________________________________________________
batch_normalization_1716 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2573 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2573 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_611 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_2118 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1717 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2574 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2574 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_612 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_357 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_813 (Dense)            (None, 100)               819300    
=================================================================
Total params: 1,052,879
Trainable params: 1,049,807
Non-trainable params: 3,072
_________________________________________________________________
