Model: "sequential_188"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1208 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_1567 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1567 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1209 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_977 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1568 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1568 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1210 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_978 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1569 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1569 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1211 (Separ (None, 32, 32, 16)        3216      
_________________________________________________________________
activation_1570 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1570 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1212 (Separ (None, 32, 32, 32)        688       
_________________________________________________________________
batch_normalization_979 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1571 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1571 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1213 (Separ (None, 32, 32, 512)       17184     
_________________________________________________________________
activation_1572 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1572 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_1214 (Separ (None, 32, 32, 32)        21024     
_________________________________________________________________
batch_normalization_980 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1573 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1573 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_336 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_188 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_547 (Dense)            (None, 512)               4194816   
_________________________________________________________________
activation_1574 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_1574 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_548 (Dense)            (None, 128)               65664     
_________________________________________________________________
batch_normalization_981 (Bat (None, 128)               512       
_________________________________________________________________
activation_1575 (Activation) (None, 128)               0         
_________________________________________________________________
dropout_1575 (Dropout)       (None, 128)               0         
_________________________________________________________________
dense_549 (Dense)            (None, 100)               12900     
=================================================================
Total params: 4,319,663
Trainable params: 4,318,991
Non-trainable params: 672
_________________________________________________________________
