Model: "sequential_27"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_199 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_264 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_264 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_200 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_149 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_265 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_265 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_201 (Separa (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_150 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_266 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_266 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_202 (Separa (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_267 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_267 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_55 (MaxPooling (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_203 (Separa (None, 16, 16, 256)       135936    
_________________________________________________________________
batch_normalization_151 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_268 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_268 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_204 (Separa (None, 16, 16, 64)        18752     
_________________________________________________________________
activation_269 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_269 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_56 (MaxPooling (None, 8, 8, 64)          0         
_________________________________________________________________
flatten_27 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_92 (Dense)             (None, 256)               1048832   
_________________________________________________________________
batch_normalization_152 (Bat (None, 256)               1024      
_________________________________________________________________
activation_270 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_270 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_93 (Dense)             (None, 256)               65792     
_________________________________________________________________
batch_normalization_153 (Bat (None, 256)               1024      
_________________________________________________________________
activation_271 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_271 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_94 (Dense)             (None, 64)                16448     
_________________________________________________________________
batch_normalization_154 (Bat (None, 64)                256       
_________________________________________________________________
activation_272 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_272 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_95 (Dense)             (None, 100)               6500      
=================================================================
Total params: 1,366,191
Trainable params: 1,364,239
Non-trainable params: 1,952
_________________________________________________________________
