Model: "sequential_36"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_257 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_339 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_339 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_258 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_195 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_340 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_340 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_259 (Separa (None, 32, 32, 8)         280       
_________________________________________________________________
activation_341 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_341 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_260 (Separa (None, 32, 32, 16)        216       
_________________________________________________________________
batch_normalization_196 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_342 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_342 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_261 (Separa (None, 32, 32, 32)        688       
_________________________________________________________________
batch_normalization_197 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_343 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_343 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_262 (Separa (None, 32, 32, 512)       17184     
_________________________________________________________________
activation_344 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_344 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_263 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
batch_normalization_198 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_345 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_345 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_74 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_264 (Separa (None, 16, 16, 128)       4512      
_________________________________________________________________
batch_normalization_199 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_346 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_346 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_36 (Flatten)         (None, 32768)             0         
_________________________________________________________________
dense_118 (Dense)            (None, 100)               3276900   
=================================================================
Total params: 3,322,207
Trainable params: 3,321,759
Non-trainable params: 448
_________________________________________________________________
