Model: "sequential_252"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1596 (Separ (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_1282 (Ba (None, 32, 32, 64)        256       
_________________________________________________________________
activation_2015 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_2015 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_1597 (Separ (None, 32, 32, 16)        1616      
_________________________________________________________________
batch_normalization_1283 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2016 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2016 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1598 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1284 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2017 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2017 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1599 (Separ (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_2018 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_2018 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_443 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1600 (Separ (None, 16, 16, 256)       135936    
_________________________________________________________________
batch_normalization_1285 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_2019 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_2019 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_444 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
separable_conv2d_1601 (Separ (None, 8, 8, 128)         35200     
_________________________________________________________________
batch_normalization_1286 (Ba (None, 8, 8, 128)         512       
_________________________________________________________________
activation_2020 (Activation) (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_2020 (Dropout)       (None, 8, 8, 128)         0         
_________________________________________________________________
max_pooling2d_445 (MaxPoolin (None, 4, 4, 128)         0         
_________________________________________________________________
flatten_252 (Flatten)        (None, 2048)              0         
_________________________________________________________________
dense_671 (Dense)            (None, 100)               204900    
=================================================================
Total params: 449,823
Trainable params: 448,639
Non-trainable params: 1,184
_________________________________________________________________
