Model: "sequential_375"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2200 (Separ (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_1788 (Ba (None, 32, 32, 64)        256       
_________________________________________________________________
activation_2657 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_2657 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_2201 (Separ (None, 32, 32, 128)       8896      
_________________________________________________________________
batch_normalization_1789 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2658 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2658 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_2202 (Separ (None, 32, 32, 256)       34176     
_________________________________________________________________
batch_normalization_1790 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2659 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2659 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_644 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_2203 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1791 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2660 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2660 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_645 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_375 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_832 (Dense)            (None, 100)               819300    
=================================================================
Total params: 900,159
Trainable params: 899,007
Non-trainable params: 1,152
_________________________________________________________________
