Model: "sequential_220"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1411 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_1810 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1810 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1412 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1140 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1811 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1811 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1413 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1141 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1812 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1812 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1414 (Separ (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_1813 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1813 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_1415 (Separ (None, 32, 32, 16)        12816     
_________________________________________________________________
batch_normalization_1142 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_1814 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1814 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1416 (Separ (None, 32, 32, 32)        688       
_________________________________________________________________
batch_normalization_1143 (Ba (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1815 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1815 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1417 (Separ (None, 32, 32, 512)       17184     
_________________________________________________________________
activation_1816 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1816 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_1418 (Separ (None, 32, 32, 32)        21024     
_________________________________________________________________
batch_normalization_1144 (Ba (None, 32, 32, 32)        128       
_________________________________________________________________
activation_1817 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1817 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_389 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
flatten_220 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_619 (Dense)            (None, 100)               819300    
=================================================================
Total params: 941,935
Trainable params: 941,487
Non-trainable params: 448
_________________________________________________________________
