Model: "sequential_356"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2109 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2564 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2564 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2110 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1709 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2565 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2565 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_2111 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1710 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2566 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2566 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_2112 (Separ (None, 32, 32, 256)       34176     
_________________________________________________________________
batch_normalization_1711 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2567 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2567 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_609 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_2113 (Separ (None, 16, 16, 1024)      265472    
_________________________________________________________________
batch_normalization_1712 (Ba (None, 16, 16, 1024)      4096      
_________________________________________________________________
activation_2568 (Activation) (None, 16, 16, 1024)      0         
_________________________________________________________________
dropout_2568 (Dropout)       (None, 16, 16, 1024)      0         
_________________________________________________________________
max_pooling2d_610 (MaxPoolin (None, 8, 8, 1024)        0         
_________________________________________________________________
flatten_356 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_811 (Dense)            (None, 512)               33554944  
_________________________________________________________________
batch_normalization_1713 (Ba (None, 512)               2048      
_________________________________________________________________
activation_2569 (Activation) (None, 512)               0         
_________________________________________________________________
dropout_2569 (Dropout)       (None, 512)               0         
_________________________________________________________________
dense_812 (Dense)            (None, 100)               51300     
=================================================================
Total params: 33,916,463
Trainable params: 33,912,591
Non-trainable params: 3,872
_________________________________________________________________
