Model: "sequential_30"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_218 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_289 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_289 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_219 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_165 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_290 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_290 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_220 (Separa (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_166 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_291 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_291 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_221 (Separa (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_292 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_292 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_61 (MaxPooling (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_222 (Separa (None, 16, 16, 256)       135936    
_________________________________________________________________
batch_normalization_167 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_293 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_293 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_62 (MaxPooling (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_30 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_101 (Dense)            (None, 32)                524320    
_________________________________________________________________
batch_normalization_168 (Bat (None, 32)                128       
_________________________________________________________________
activation_294 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_294 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_102 (Dense)            (None, 512)               16896     
_________________________________________________________________
activation_295 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_295 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_103 (Dense)            (None, 512)               262656    
_________________________________________________________________
batch_normalization_169 (Bat (None, 512)               2048      
_________________________________________________________________
activation_296 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_296 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_104 (Dense)            (None, 100)               51300     
=================================================================
Total params: 1,064,911
Trainable params: 1,063,023
Non-trainable params: 1,888
_________________________________________________________________
