Model: "sequential_393"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_2288 (Separ (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_1862 (Ba (None, 32, 32, 64)        256       
_________________________________________________________________
activation_2746 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_2746 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_2289 (Separ (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_1863 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2747 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2747 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_2290 (Separ (None, 32, 32, 256)       271616    
_________________________________________________________________
batch_normalization_1864 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2748 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2748 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_679 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
separable_conv2d_2291 (Separ (None, 16, 16, 128)       35200     
_________________________________________________________________
batch_normalization_1865 (Ba (None, 16, 16, 128)       512       
_________________________________________________________________
activation_2749 (Activation) (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_2749 (Dropout)       (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_680 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_393 (Flatten)        (None, 8192)              0         
_________________________________________________________________
dense_851 (Dense)            (None, 100)               819300    
=================================================================
Total params: 1,199,423
Trainable params: 1,196,479
Non-trainable params: 2,944
_________________________________________________________________
