Model: "sequential_22"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_167 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_223 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_223 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_168 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_124 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_224 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_224 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_169 (Separa (None, 32, 32, 8)         280       
_________________________________________________________________
activation_225 (Activation)  (None, 32, 32, 8)         0         
_________________________________________________________________
dropout_225 (Dropout)        (None, 32, 32, 8)         0         
_________________________________________________________________
separable_conv2d_170 (Separa (None, 32, 32, 16)        216       
_________________________________________________________________
batch_normalization_125 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_226 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_226 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_171 (Separa (None, 32, 32, 32)        688       
_________________________________________________________________
batch_normalization_126 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_227 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_227 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_172 (Separa (None, 32, 32, 512)       17184     
_________________________________________________________________
activation_228 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_228 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_173 (Separa (None, 32, 32, 32)        21024     
_________________________________________________________________
batch_normalization_127 (Bat (None, 32, 32, 32)        128       
_________________________________________________________________
activation_229 (Activation)  (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_229 (Dropout)        (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_45 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_174 (Separa (None, 16, 16, 128)       4512      
_________________________________________________________________
batch_normalization_128 (Bat (None, 16, 16, 128)       512       
_________________________________________________________________
activation_230 (Activation)  (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_230 (Dropout)        (None, 16, 16, 128)       0         
_________________________________________________________________
flatten_22 (Flatten)         (None, 32768)             0         
_________________________________________________________________
dense_78 (Dense)             (None, 100)               3276900   
=================================================================
Total params: 3,322,207
Trainable params: 3,321,759
Non-trainable params: 448
_________________________________________________________________
