Model: "sequential_271"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1696 (Separ (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_1359 (Ba (None, 32, 32, 64)        256       
_________________________________________________________________
activation_2120 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_2120 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_1697 (Separ (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_1360 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_2121 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_2121 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_1698 (Separ (None, 32, 32, 128)       140416    
_________________________________________________________________
batch_normalization_1361 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2122 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2122 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1699 (Separ (None, 32, 32, 32)        5280      
_________________________________________________________________
batch_normalization_1362 (Ba (None, 32, 32, 32)        128       
_________________________________________________________________
activation_2123 (Activation) (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_2123 (Dropout)       (None, 32, 32, 32)        0         
_________________________________________________________________
separable_conv2d_1700 (Separ (None, 32, 32, 512)       17184     
_________________________________________________________________
activation_2124 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_2124 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
separable_conv2d_1701 (Separ (None, 32, 32, 256)       135936    
_________________________________________________________________
batch_normalization_1363 (Ba (None, 32, 32, 256)       1024      
_________________________________________________________________
activation_2125 (Activation) (None, 32, 32, 256)       0         
_________________________________________________________________
dropout_2125 (Dropout)       (None, 32, 32, 256)       0         
_________________________________________________________________
max_pooling2d_471 (MaxPoolin (None, 16, 16, 256)       0         
_________________________________________________________________
flatten_271 (Flatten)        (None, 65536)             0         
_________________________________________________________________
dense_695 (Dense)            (None, 100)               6553700   
=================================================================
Total params: 6,925,951
Trainable params: 6,922,943
Non-trainable params: 3,008
_________________________________________________________________
