Model: "sequential_49"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_340 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
activation_444 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_444 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_341 (Separa (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_257 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_445 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_445 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_342 (Separa (None, 32, 32, 16)        25616     
_________________________________________________________________
activation_446 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_446 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_97 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_343 (Separa (None, 16, 16, 64)        1232      
_________________________________________________________________
batch_normalization_258 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_447 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_447 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_344 (Separa (None, 16, 16, 256)       17216     
_________________________________________________________________
batch_normalization_259 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_448 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_448 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_98 (MaxPooling (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_49 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_153 (Dense)            (None, 32)                524320    
_________________________________________________________________
batch_normalization_260 (Bat (None, 32)                128       
_________________________________________________________________
activation_449 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_449 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_154 (Dense)            (None, 16)                528       
_________________________________________________________________
batch_normalization_261 (Bat (None, 16)                64        
_________________________________________________________________
activation_450 (Activation)  (None, 16)                0         
_________________________________________________________________
dropout_450 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_155 (Dense)            (None, 256)               4352      
_________________________________________________________________
batch_normalization_262 (Bat (None, 256)               1024      
_________________________________________________________________
activation_451 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_451 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_156 (Dense)            (None, 64)                16448     
_________________________________________________________________
batch_normalization_263 (Bat (None, 64)                256       
_________________________________________________________________
activation_452 (Activation)  (None, 64)                0         
_________________________________________________________________
dropout_452 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_157 (Dense)            (None, 100)               6500      
=================================================================
Total params: 670,479
Trainable params: 667,055
Non-trainable params: 3,424
_________________________________________________________________
