Model: "sequential_76"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_517 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
batch_normalization_404 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_671 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_671 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_518 (Separa (None, 32, 32, 1024)      17552     
_________________________________________________________________
batch_normalization_405 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_672 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_672 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_519 (Separa (None, 32, 32, 16)        25616     
_________________________________________________________________
activation_673 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_673 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_520 (Separa (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_406 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_674 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_674 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_521 (Separa (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_675 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_675 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_146 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_522 (Separa (None, 16, 16, 32)        21024     
_________________________________________________________________
batch_normalization_407 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_676 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_676 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_523 (Separa (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_677 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_677 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_524 (Separa (None, 16, 16, 32)        21024     
_________________________________________________________________
batch_normalization_408 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_678 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_678 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_147 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
flatten_76 (Flatten)         (None, 2048)              0         
_________________________________________________________________
dense_230 (Dense)            (None, 100)               204900    
=================================================================
Total params: 381,839
Trainable params: 379,375
Non-trainable params: 2,464
_________________________________________________________________
