Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_119 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_87 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
activation_161 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_161 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_120 (Separa (None, 16, 16, 512)       33856     
_________________________________________________________________
batch_normalization_88 (Batc (None, 16, 16, 512)       2048      
_________________________________________________________________
activation_162 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_162 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_121 (Separa (None, 8, 8, 128)         70272     
_________________________________________________________________
activation_163 (Activation)  (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_163 (Dropout)        (None, 8, 8, 128)         0         
_________________________________________________________________
separable_conv2d_122 (Separa (None, 8, 8, 512)         67200     
_________________________________________________________________
batch_normalization_89 (Batc (None, 8, 8, 512)         2048      
_________________________________________________________________
activation_164 (Activation)  (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_164 (Dropout)        (None, 8, 8, 512)         0         
_________________________________________________________________
separable_conv2d_123 (Separa (None, 8, 8, 32)          21024     
_________________________________________________________________
activation_165 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_165 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_124 (Separa (None, 8, 8, 32)          1344      
_________________________________________________________________
activation_166 (Activation)  (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_166 (Dropout)        (None, 8, 8, 32)          0         
_________________________________________________________________
separable_conv2d_125 (Separa (None, 8, 8, 1024)        34080     
_________________________________________________________________
batch_normalization_90 (Batc (None, 8, 8, 1024)        4096      
_________________________________________________________________
activation_167 (Activation)  (None, 8, 8, 1024)        0         
_________________________________________________________________
dropout_167 (Dropout)        (None, 8, 8, 1024)        0         
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 4, 4, 1024)        0         
_________________________________________________________________
separable_conv2d_126 (Separa (None, 4, 4, 8)           17416     
_________________________________________________________________
activation_168 (Activation)  (None, 4, 4, 8)           0         
_________________________________________________________________
dropout_168 (Dropout)        (None, 4, 4, 8)           0         
_________________________________________________________________
separable_conv2d_127 (Separa (None, 4, 4, 64)          648       
_________________________________________________________________
batch_normalization_91 (Batc (None, 4, 4, 64)          256       
_________________________________________________________________
activation_169 (Activation)  (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_169 (Dropout)        (None, 4, 4, 64)          0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 1024)              0         
_________________________________________________________________
dense_58 (Dense)             (None, 256)               262400    
_________________________________________________________________
activation_170 (Activation)  (None, 256)               0         
_________________________________________________________________
dropout_170 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_59 (Dense)             (None, 512)               131584    
_________________________________________________________________
batch_normalization_92 (Batc (None, 512)               2048      
_________________________________________________________________
activation_171 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_171 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_60 (Dense)             (None, 32)                16416     
_________________________________________________________________
activation_172 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_172 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_61 (Dense)             (None, 100)               3300      
=================================================================
Total params: 670,575
Trainable params: 665,199
Non-trainable params: 5,376
_________________________________________________________________
