Model: "sequential_268"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1677 (Separ (None, 32, 32, 16)        91        
_________________________________________________________________
activation_2100 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2100 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1678 (Separ (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_1345 (Ba (None, 32, 32, 16)        64        
_________________________________________________________________
activation_2101 (Activation) (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_2101 (Dropout)       (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_1679 (Separ (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_1346 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2102 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2102 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1680 (Separ (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_2103 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_2103 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_465 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1681 (Separ (None, 16, 16, 256)       135936    
_________________________________________________________________
batch_normalization_1347 (Ba (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_2104 (Activation) (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_2104 (Dropout)       (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_466 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_268 (Flatten)        (None, 16384)             0         
_________________________________________________________________
dense_691 (Dense)            (None, 256)               4194560   
_________________________________________________________________
batch_normalization_1348 (Ba (None, 256)               1024      
_________________________________________________________________
activation_2105 (Activation) (None, 256)               0         
_________________________________________________________________
dropout_2105 (Dropout)       (None, 256)               0         
_________________________________________________________________
dense_692 (Dense)            (None, 100)               25700     
=================================================================
Total params: 4,428,847
Trainable params: 4,427,535
Non-trainable params: 1,312
_________________________________________________________________
