Model: "sequential_229"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1465 (Separ (None, 32, 32, 64)        283       
_________________________________________________________________
batch_normalization_1181 (Ba (None, 32, 32, 64)        256       
_________________________________________________________________
activation_1868 (Activation) (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1868 (Dropout)       (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_1466 (Separ (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_1182 (Ba (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_1869 (Activation) (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_1869 (Dropout)       (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_1467 (Separ (None, 32, 32, 128)       140416    
_________________________________________________________________
batch_normalization_1183 (Ba (None, 32, 32, 128)       512       
_________________________________________________________________
activation_1870 (Activation) (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_1870 (Dropout)       (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_1468 (Separ (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_1871 (Activation) (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_1871 (Dropout)       (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_404 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1469 (Separ (None, 16, 16, 32)        21024     
_________________________________________________________________
batch_normalization_1184 (Ba (None, 16, 16, 32)        128       
_________________________________________________________________
activation_1872 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1872 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_1470 (Separ (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_1873 (Activation) (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_1873 (Dropout)       (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_1471 (Separ (None, 16, 16, 32)        21024     
_________________________________________________________________
batch_normalization_1185 (Ba (None, 16, 16, 32)        128       
_________________________________________________________________
activation_1874 (Activation) (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_1874 (Dropout)       (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_405 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
flatten_229 (Flatten)        (None, 2048)              0         
_________________________________________________________________
dense_632 (Dense)            (None, 100)               204900    
=================================================================
Total params: 544,287
Trainable params: 541,727
Non-trainable params: 2,560
_________________________________________________________________
