Model: "sequential_70"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_477 (Separa (None, 32, 32, 16)        91        
_________________________________________________________________
activation_620 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_620 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_478 (Separa (None, 32, 32, 16)        416       
_________________________________________________________________
batch_normalization_371 (Bat (None, 32, 32, 16)        64        
_________________________________________________________________
activation_621 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_621 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
separable_conv2d_479 (Separa (None, 32, 32, 128)       2320      
_________________________________________________________________
batch_normalization_372 (Bat (None, 32, 32, 128)       512       
_________________________________________________________________
activation_622 (Activation)  (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_622 (Dropout)        (None, 32, 32, 128)       0         
_________________________________________________________________
separable_conv2d_480 (Separa (None, 32, 32, 512)       67200     
_________________________________________________________________
activation_623 (Activation)  (None, 32, 32, 512)       0         
_________________________________________________________________
dropout_623 (Dropout)        (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_135 (MaxPoolin (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_481 (Separa (None, 16, 16, 32)        21024     
_________________________________________________________________
batch_normalization_373 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_624 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_624 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
separable_conv2d_482 (Separa (None, 16, 16, 512)       17184     
_________________________________________________________________
activation_625 (Activation)  (None, 16, 16, 512)       0         
_________________________________________________________________
dropout_625 (Dropout)        (None, 16, 16, 512)       0         
_________________________________________________________________
separable_conv2d_483 (Separa (None, 16, 16, 32)        21024     
_________________________________________________________________
batch_normalization_374 (Bat (None, 16, 16, 32)        128       
_________________________________________________________________
activation_626 (Activation)  (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_626 (Dropout)        (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_136 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
flatten_70 (Flatten)         (None, 2048)              0         
_________________________________________________________________
dense_213 (Dense)            (None, 100)               204900    
=================================================================
Total params: 334,991
Trainable params: 334,575
Non-trainable params: 416
_________________________________________________________________
