Model: "sequential_61"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_421 (Separa (None, 32, 32, 64)        283       
_________________________________________________________________
activation_543 (Activation)  (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_543 (Dropout)        (None, 32, 32, 64)        0         
_________________________________________________________________
separable_conv2d_422 (Separa (None, 32, 32, 1024)      67136     
_________________________________________________________________
batch_normalization_322 (Bat (None, 32, 32, 1024)      4096      
_________________________________________________________________
activation_544 (Activation)  (None, 32, 32, 1024)      0         
_________________________________________________________________
dropout_544 (Dropout)        (None, 32, 32, 1024)      0         
_________________________________________________________________
separable_conv2d_423 (Separa (None, 32, 32, 16)        25616     
_________________________________________________________________
activation_545 (Activation)  (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_545 (Dropout)        (None, 32, 32, 16)        0         
_________________________________________________________________
max_pooling2d_120 (MaxPoolin (None, 16, 16, 16)        0         
_________________________________________________________________
separable_conv2d_424 (Separa (None, 16, 16, 64)        1232      
_________________________________________________________________
batch_normalization_323 (Bat (None, 16, 16, 64)        256       
_________________________________________________________________
activation_546 (Activation)  (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_546 (Dropout)        (None, 16, 16, 64)        0         
_________________________________________________________________
separable_conv2d_425 (Separa (None, 16, 16, 256)       17216     
_________________________________________________________________
batch_normalization_324 (Bat (None, 16, 16, 256)       1024      
_________________________________________________________________
activation_547 (Activation)  (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_547 (Dropout)        (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_121 (MaxPoolin (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_61 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_183 (Dense)            (None, 32)                524320    
_________________________________________________________________
batch_normalization_325 (Bat (None, 32)                128       
_________________________________________________________________
activation_548 (Activation)  (None, 32)                0         
_________________________________________________________________
dropout_548 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_184 (Dense)            (None, 512)               16896     
_________________________________________________________________
activation_549 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_549 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_185 (Dense)            (None, 512)               262656    
_________________________________________________________________
batch_normalization_326 (Bat (None, 512)               2048      
_________________________________________________________________
activation_550 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_550 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_186 (Dense)            (None, 100)               51300     
=================================================================
Total params: 974,207
Trainable params: 970,431
Non-trainable params: 3,776
_________________________________________________________________
